<template>
    <div class="page-header clear-filter">
      <div
        style="position: fixed; left: 0; top: 0; width: 100%; height: 100%; background-image: url('img/1.jpg'); max-height: 999px;"
      ></div>
<div class="container">
<h3 class="title">Тема 4. Информационные технологии в профессиональной деятельности (программа CorelDRAW) </h3>
  <div class="section section-tabs">
    <div class="container">
      <div class="row">
          <div class="card">
			  <div id="typography">
        	<div class="row">
          	<div class="col-md-12">
        	<div class="typography-line">
            </div>
        	<div class="typography-line">
            <tabs
              centered
              type="neutral"
              tab-nav-wrapper-classes="card-header"
              tab-content-classes="card-body"
              data-background-color="darkgreen"
            >
            <tab-pane class="text-color">
              <template slot="label">
                Теоретический раздел
              </template>

              <div class="row justify-content-center">
		<div class="col-8">
			<p class="blockquote blockquote-primary-new2">
          <el-carousel height="730px" arrow="always" :autoplay="false">
            <el-carousel-item>
              <img class="d-block" src="img/7/1.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/7/2.jpg" />
            </el-carousel-item>
             <el-carousel-item>
              <img class="d-block" src="img/7/3.jpg" />
            </el-carousel-item>
             <el-carousel-item>
              <img class="d-block" src="img/7/4.jpg" />
            </el-carousel-item>
             <el-carousel-item>
              <img class="d-block" src="img/7/5.jpg" />
            </el-carousel-item>
             <el-carousel-item>
              <img class="d-block" src="img/7/6.jpg" />
            </el-carousel-item>
             <el-carousel-item>
              <img class="d-block" src="img/7/7.jpg" />
            </el-carousel-item>
             <el-carousel-item>
              <img class="d-block" src="img/7/8.jpg" />
            </el-carousel-item>
             <el-carousel-item>
              <img class="d-block" src="img/7/9.jpg" />
            </el-carousel-item>
			      <el-carousel-item>
              <img class="d-block" src="img/7/10.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/7/11.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/7/12.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/7/13.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/7/14.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/7/15.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/7/16.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/7/17.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/7/18.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/7/19.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/7/20.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/7/21.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/7/22.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/7/23.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/7/24.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/7/25.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/7/26.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/7/27.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/7/28.jpg" />
            </el-carousel-item>
          </el-carousel>
		</p>
        </div>
      </div>

              <p class="blockquote blockquote-primary-new2">
                <strong><strong class="name">ОСНОВЫ РАБОТЫ</strong><br />
Работа над любой иллюстрацией заключается в создании объектов, их редактировании и задании их правильного взаимного расположения. Исходя из этого, основными принципами работы в CorelDRAW можно назвать следующие.<br />
- Создание простых геометрических фигур или произвольных кривых и ломаных, как замкнутых, так и разомкнутых. Вставка и форматирование текста.<br />
- Редактирование любого объекта, изменение цвета контура и заливки, изменение формы объекта.<br />
- Вставка готовых картинок или ранее созданных иллюстраций в документ.<br />
- Применение разнообразных художественных эффектов.<br />
- Точное позиционирование объектов относительно страницы и друг друга.<br />
Элементы рабочего окна редактора. При первом запуске программы CorelDRAW на экране появится диалоговое окно, в котором можно выбрать режим работы. Если флажок Show this Welcome Screen at startup (Показывать это окно при запуске) оставить установленным, то это диалоговое появится и при следующем запуске программы. Чтобы начать работу над новым рисунком, необходимо выбрать вариант New Graphic (Новый рисунок).<br />
Интерфейс рабочего окна программы, как и интерфейс большинства приложений, предназначенных для работы в ОС Windows, содержит в первую очередь стандартные элементы:<br />
1-заголовок окна, 2-строка меню, 3-стандартная панель инструментов,<br> 4-панель свойств или атрибутов, 5 -панель инструментов, 6 - палитра цветов,<br />
7- печатная страница, 8- рабочий стол, 9- горизонтальные и вертикальные полосы прокрутки, 10- элементы управления для перехода по страницам,<br> 11- горизонтальная и вертикальная линейка, 12- пристыковываемые окна, 13- строка состояния.<br />
<img src="img/img-137.png" ><br />
Главное меню обеспечивает доступ к командам CorelDRAW, объединенным в следующие группы:<br />
- File (Файл) — команды, позволяющие открывать, сохранять, импортировать, экспортировать файлы, распечатывать рисунки, публиковать их в Internet; в нижней части списка команды расположен список последних открывавшихся файлов;<br />
- Edit (Правка) — команды, позволяющие отменять и повторять последние действия, копировать объекты, настраивать их свойства;<br />
- View (Вид) — команды, позволяющие настраивать окно отображения объектов, устанавливать и настраивать вспомогательные элементы окна;<br />
- Layout (Макет) — команды, позволяющие добавлять, удалять и переименовывать страницы графического документа и настраивать их свойства;<br />
- Arrange (Упорядочить) — команды, позволяющие активизировать инструменты преобразования и выравнивания объектов;<br />
- Effects (Эффекты) — команды, позволяющие добавить различные специальные эффекты к объектам (например, эффекты выдавливания, тени, прозрачности и т.п.);<br />
- Bitmaps (Растры) — команды, позволяющие преобразовывать векторные изображения в растровые и наоборот, редактировать растровые изображения и добавлять к ним различные эффекты;<br />
- Text (Текст) — команды для работы с текстовыми объектами;<br />
- Tools (Инструменты) — команды, позволяющие настраивать интерфейс программы, включать и отключать панели инструментов, а также настраивать их;<br />
- Window (Окно) — команды, позволяющие переключаться между окнами разных файлов, одновременно открытых в CorelDRAW, а также вызывать дополнительные окна палитр, докеров и панелей инструментов;<br />
- Help (Помощь) — команды, позволяющие обратиться к встроенной справочной системе CorelDRAW.<br />
<img src="img/img-138.png" ><br />
В центре окна программы расположена рабочая область программы, изображенная в виде листа бумаги. При выводе изображения на печать будет напечатано только то, что находится внутри рабочей области. Полосы прокрутки позволяют передвигаться по изображению, а измерительные линейки — точно позиционировать элементы рисунка и измерять их размеры. Для работы с цветом в правой части окна расположена палитра цветов. В строке состояния выводится дополнительная информация об объектах, существенно облегчающая работу с редактором.<br />
Помимо стандартной панели инструментов, в CorelDRAW имеются и специфические панели, из которых особенно важными являются панель Toolbox (Инструменты) Рис.1.1 и панель Property Bar (Панель свойств). Инструменты панели Toolbox (Инструменты) позволяют создавать объекты, а элементы панели Property Bar (Панель свойств) позволяют изменять их свойства.<br />
Чтобы расположить панель инструментов в произвольном месте, надо перетащить ее с помощью мыши. Панели можно закрепить с любой стороны окна программы или расположить в произвольном месте рабочего окна. Главное меню также является панелью, и его местоположение также можно изменить.<br />
Любую панель инструментов можно отображать или не отображать в рабочем окне. Для этого достаточно выбрать команду меню Window/Toolbars (Окно/Панели инструментов) и установить соответствующие флажки: для стандартной панели — Standard (Основная), для главного меню программы — Menu Bar (Панель меню), для панели свойств — Property Bar (Панель свойств), для панели инструментов — Toolbox (Инструменты) и для строки состояния — Status Bar (Строка состояния).<br />
Понятие объекта в CorelDRAW. Любое изображение в векторном формате состоит из множества составляющих частей — объектов, которые можно редактировать независимо друг от друга. Вне зависимости от внешнего вида, векторные объекты CorelDRAW имеют ряд общих характеристик (рис.1.2).<br />
<img src="img/img-139.png" ><br />
Любой объект имеет некоторое количество точек, или узлов, соединенных прямыми или кривыми линиями — сегментами. Координаты узлов и параметры сегментов определяют внешний вид объекта. Сегменты объекта образуют контур. Различают замкнутые и разомкнутые контуры. Область, ограниченную замкнутым контуром, принято называть заливкой. Эту область можно закрасить (или залить) одним цветом, смесью цветов, узором или текстурой. У одного объекта не может быть несколько разных заливок или соединительных линий разной толщины и разных цветов.<br /><br><br />
<b>ПРОСТЫЕ ФИГУРЫ</b><br />
К ним можно отнести прямоугольники и эллипсы, многоугольники, клетки и спирали.<br />
<img src="img/img-140.png" ><br />
Прямоугольник. Для того чтобы изобразить прямоугольник, необходимо выбрать инструмент Rectangle Tool (Прямоугольник) в панели инструментов Toolbox (Графика), расположенной в левой части окна программы. Изображение кнопки при этом изменится, она будет как бы зафиксирована в нажатом состоянии. Это говорит о включении режима создания прямоугольников. Она останется нажатой, пока не будет выбран другой инструмент.<br />
Далее необходимо установить указатель мыши в любом месте рабочей области, нажать левую кнопку мыши, и, не отпуская ее, передвигать мышь. На экране появится прямоугольник, размеры которого будут меняться вместе с передвижением мыши. Чтобы закончить рисование, нужно отпустить кнопку мыши — прямоугольник останется на экране; вокруг него появится восемь габаритных маркеров (черные прямоугольники), в центре — перекрестие, а в вершинах — узлы.<br />
Если при рисовании прямоугольника удерживать нажатой клавишу [Ctrl], то будет рисоваться квадрат. Кроме того, в CorelDraw предусмотрена возможность рисовать объекты не от угла габаритного контейнера, а от центра объекта. Для этого нужно удерживать нажатой клавишу [Shift]. Причем, если требуется нарисовать квадрат от центра к углам, то следует одновременно удерживать нажатыми клавиши [Ctrl] и [Shift].<br />
Кроме того, существует быстрый способ нарисовать прямоугольник с размерами, совпадающими с размерами страницы. Для этого нужно дважды щелкнуть на инструменте Rectangle Tool (Прямоугольник).<br />
Начиная с версии CorelDRAW 11 появилась дополнительная возможность рисования прямоугольников. Если раскрыть вспомогательную панель инструмента Rectangle Tool (Прямоугольник), то можно выбрать инструмент 3 Point Rectangle Tool (Трехточечный прямоугольник), позволяющий нарисовать прямоугольник следующим образом: щелкнуть мышью, не отпуская кнопку мыши перетащить ее и щелкнуть еще раз — будет зафиксирована одна из сторон прямоугольника, после чего перетаскиванием мыши и третьим щелчком следует достроить прямоугольник.<br />
Эллипс. Для рисования эллипсов предназначен инструмент Ellipse Tool (Эллипс) на панели инструментов Toolbox (Инструменты). При рисовании эллипсов используются те же приемы, что и при рисовании прямоугольников, и использование клавиш [Ctrl] и [Shift] так же позволяет рисовать эллипсы от центра и круги. Кроме того, с версии v11 для рисования эллипсов появился новый инструмент, аналогичный инструменту 3 Point Rectangle (Трехточечный прямоугольник) — инструмент 3 Point Ellipse (Трехточечный эллипс): первые два щелчка задают один из диаметров эллипса, затем перетягиванием мыши и третьим щелчком достраивается эллипс.<br />
 Многоугольники, спирали, клетки. Инструменты для рисования многоугольников, спиралей и клеток объединены на одной вспомогательной панели <br />
<img src="img/img-141.png" ><br />
Для рисования многоугольников используется инструмент Polygon Tool (Многоугольник) панели Toolbox (Инструменты). При этом как до, так и после рисования многоугольника можно выполнить настройку его параметров: установить количество вершин и тип фигуры (многоугольник или звезда). Для звезд с числом вершин 7 и более можно с помощью ползунка Sharpness of Polygon (Остроконечность многоугольника) на панели Property Bar (Панель свойств) установить степень заострения (рис.2).<br />
<img src="img/img-142.png" ><br />
Чтобы выбрать инструмент для рисования спиралей, необходимо нажать кнопку Spiral Tool (Спираль). При этом с помощью панели Property Bar (Панель свойств) необходимо непосредственно перед рисованием установить параметры спирали: количество витков спирали и принцип рисования витков (т.е. будут ли расстояния между витками равными или же они будут задаваться по логарифмическому принципу). Изменение этих параметров после рисования не приведет к изменению выделенной спирали.<br />
Чтобы создать клетку, можно воспользоваться инструментом Graph Paper Tool (Клетка) на панели Toolbox (Инструменты). Параметры клетки — количество ячеек по горизонтали и по вертикали — также требуется установить перед ее созданием, используя панель Property Bar (Панель свойств).<br />
<b>ПРАВКА ОБЪЕКТОВ</b><br />
Выделение объектов. Как уже отмечалось, при создании объектов вокруг них появляются черные прямоугольники, называемые маркерами выделения. То есть, вновь созданный объект уже выделен, и вы можете сразу приступать к его редактированию. Помимо этого можно выделять любые другие объекты.<br />
<img src="img/img-143.png" ><br />
Для выделения объектов служит инструмент Pick Tool (Стрелка): если этот инструмент выбран, достаточно просто щелкнуть на объекте, чтобы выделить его. Чтобы отменить выделение объектов, надо щелкнуть мышью за пределами области выделения. Кроме того, когда выбран инструмент Pick Tool (Стрелка) и не выделен ни один объект, в панели Property Bar (Панель свойств) видна кнопка Treat as Filled (Использовать как заливку). Если она нажата, то выделять объекты можно с помощью щелчка в любом месте объекта, а если кнопка не нажата, то объекты выделяются только после щелчка на контуре.<br />
Иногда бывает необходимо выделить все объекты сразу. Для этого достаточно дважды щелкнуть мышью на инструменте Pick Tool (Стрелка). Выделение нескольких объектов обозначается маркерами выделения, расположенными вокруг них (рис.1).<br />
Для того чтобы выделить несколько произвольных объектов, следует сначала выделить один их них, а затем, удерживая нажатой клавишу [Shift], выделить остальные объекты, щелкая на них последовательно мышью. При этом в строке состояния выводится информация о выделенных объектах, например, 3 Objects selected (Выделено 3 объекта). Чтобы снять выделение одного из множества выделенных объектов, достаточно щелкнуть на нем, удерживая клавишу [Shift]. При этом все остальные объекты останутся выделенными.<br />
 Еще один способ выделения объектов — с помощью рамки выделения. Для этого надо щелкнуть левой кнопкой мыши выше и левее объекта или объектов, которые вы хотите выделить, и, передвигать мышь, удерживая ее нажатой. На экране между начальной точкой и текущим местом указателя появится пунктирный прямоугольник, называемый рамкой выделения. После того, как нужные объекты окажутся внутри пунктирного прямоугольника, необходимо отпустить кнопку мыши — объекты, целиком оказавшиеся внутри пунктирного прямоугольника, будут выделены (рис.2)<br />
<img src="img/img-144.png" ><br />
Если во время выделения рамкой держать нажатой клавишу [Alt], то выделены будут не только объекты, целиком оказавшиеся внутри пунктирного прямоугольника, но и частично попавшие в него. После выделения нескольких объектов, с ними можно работать как с единым объектом.<br />
 Отмена и возврат последних действий. В CorelDRAW, как и во многих других приложениях Windows, можно отменять последние действия. Для этого достаточно выбрать команду меню Edit/Undo (Правка/Отменить) столько раз, сколько последних операций требуется отменить. Команда меню Edit/Redo (Правка/Вернуть) возвращает отмененное действие. Можно также воспользоваться кнопками Undo (Оменить) и Redo (Вернуть) на стандартной панели инструментов. Треугольники справа от кнопок служат для вызова списка последних действий.<br />
Кроме того, в CorelDRAW можно отказаться от всех действий, которые были произведены после открытия файла. Для этого следует воспользоваться командой меню File/Revert (Файл/Восстановить). Откроется диалоговое окно, в котором будет предложено подтвердить восстановление. Нажатие на кнопку ОК безвозвратно удалит все изменения, произведенные после последнего сохранения файла.<br />
 Перемещение, копирование и удаление объектов. Удаление объектов. Чтобы удалить один или несколько объектов, проще всего выделить требуемые объекты и нажать клавишу [Delete]. Кроме того, можно для удаления выделенных объектов можно использовать команду меню Edit/Delete (Правка/Удалить) или команду контекстного меню Delete (Удалить).<br />
Перемещение объектов. Перемещать объекты в CorelDRAW можно как с помощью мыши, так и с помощью клавиатурного ввода параметров перемещения. Чтобы переместить объект мышью, следует выделить его, подвести к нему мышь, и после того, как указатель мыши изменится на перекрестие из стрелок, щелкнуть на объекте левой кнопкой мыши и, удерживая ее нажатой, переместить его. Для перемещения объектов в строго горизонтальном или вертикальном направле­нии следует во время перемещения нажать и удерживать клавишу [Ctrl].<br />
Кроме того, переместить объект можно с помощью клавиш. Для этого необходимо его выделить и, нажимая клавиши управления курсором ([←], [↑], [→] или [↓]), переместить его в требуемое место. Клавиши управления курсором перемещают объект с шагом, который можно задать в счетчике Nudge Offset (Шаг смещения). Этот счетчик становится доступным на панели свойств документа, т.е. при условии, что ни один объект не выделен (рис.3). Если при перемещении объекта с помощью клавиш управления курсором удерживать нажатой клавишу [Ctrl], то объект будет смещаться на расстояние, равное половине значения, указанного в этом счетчике. Если же удерживать нажатой клавишу [Shift], то шаг смещения будет равен удвоенному значению параметра Nudge Offset (Шаг смещения). По умолчанию это значение равно 1 дюйму.<br />
<img src="img/img-145.png" ><br />
Копирование объектов. Копировать объекты в CorelDRAW можно как с использованием буфера обмена, так и без него.<br />
Чтобы скопировать объекты, не помещая их в буфер, следует выделить эти объекты, а затем выбрать команду меню Edit/Duplicate (Правка/Дубликат) или нажать клавишу [+] справа от цифровой клавиатуры. Дубликаты объектов будут созданы на том же месте, где расположены оригиналы. Этот способ копирования объектов удобнее всего применять для копирования в пределах одной страницы документа.<br />
Если требуется скопировать объекты на другую страницу или в другой документ, то следует сначала выделить объекты и скопировать их в буфер, а затем вставить их из буфера в нужное место. Скопировать объекты в буфер можно одним из следующих способов: 1) выбрать команду меню Edit/Copy (Правка/Копировать); 2) щелкнуть на выделенных объектах правой кнопкой мыши и выбрать команду Copy (Копировать) в появившемся вспомогательном меню; 3) нажать кнопку Copy (Копировать) на стандартной панели инструментов; 4) нажать сочетание клавиш [Ctrl]+[Ins] или [Ctrl]+[С].<br />
После того, как объекты скопированы в буфер, вставить их можно одним из следующих способов: 1) выбрать команду меню Edit/Paste (Правка/Вставить); 2) щелкнуть правой кнопкой мыши на свободной области листа и в появившемся контекстном меню выбрать команду Paste (Вставить); 3) нажать кнопку Paste (Вставить) на стандартной панели инструментов; 4) нажать сочетание клавиш [Shift]+[Ins] или [Ctrl]+[V]. При этом оригинал объекта остается на своем прежнем месте.<br />
Третий способ. Этот способ отличается от предыдущего тем, что объекты копируются в буфер, и при этом удаляются с листа. Для этого используется команда меню Edit/Cut (Правка/Вырезать). Для вставки объекта из буфера можно использовать один из описанных выше способов.<br />
Четвертый способ. Все предыдущие способы используются для создания независимых копий объектов. Однако в CorelDRAW есть возможность создавать копии, которые связанны с оригиналом — клоны. Чтобы создать клон, необходимо выделить объекты и выбрать команду меню Edit/Clone (Правка/Клонировать). Созданный в результате этой операции объект полностью зависит от параметров оригинала: от типа заливки, контура и т.п., т.е. при изменении параметров оригинала будут меняться параметры копии-клона. При этом, если изменять свойства клона (например, заливку), то свойства оригинала останутся прежними, но при этом связь между оригиналом и клоном будет нарушена.<br />
Пятый способ. Если переместить объект, удерживая правую кнопку мыши, то появится контекстное меню, в котором можно выбрать одну из команд:<br />
- Move Here (Переместить сюда) — перемещает объект;<br />
-Copy Here (Скопировать сюда) — копирует объект.<br />
<b>СОСТАВНЫЕ ОБЪЕКТЫ</b><br />
В CorelDRAW широкое применение имеют операции, позволяющие получить составные объекты путем объединения, пересечения отдельных объектов, а также исключения одних объектов из других<br />
<img src="img/img-146.png" ><br />
<ol>
	<li>Объединение объектов. Для того, чтобы получить форму объединением двух и более объектов, можно воспользоваться одним из следующих способов:</li>
</ol>
1) выделить все объекты и нажать кнопку Weld (Объединение) на панели свойств;<br />
2) выделить нужные объекты и выбрать команду меню Arrange/Shaping/Weld (Упорядочить/Формирование/Объединение);<br />
3) выделить один или несколько объектов, выбрать команду меню Arrange/Shaping/Shaping (Упорядочить/Формирование/Формирование), в появившейся панели Shaping (Формирование) выбрать в выпадающем списке Weld (Объединение), щелкнуть на кнопке Weld To (Объединить с) и указать мышью на объекте, с которым требуется объединить выделенные.<br />
<img src="img/img-147.png" ><br >
При использовании последнего из описанных способов появляется возможность оставлять объекты, участвующие в операции объединения, на рабочей области, тогда как первые два способа оставляют только конечный результат.<br />
Выбрать, какие именно объекты будут оставлены, позволяют флажки Source Object (Исходный объект) и Target Object (Целевой объект). Если оставлять объекты-операнды не требуется, то порядок выделения не важен: результат операции будет одним и тем же вне зависимости от порядка выделения объектов. Если же требуется оставить какой-либо из объектов после выполнения операции, то порядок выделения помогает определить, какой объект исходный (выделен первым), а какой — целевой (выделен вторым).<br />
<ol>
	<li>Пересечение объектов. Для того, чтобы получить форму, являющуюся пересечением нескольких объектов, следует воспользоваться одним из следующих способов:</li>
</ol>
1) выделить все объекты и нажать кнопку Intersect (Пересечение) на панели свойств;<br />
2) выделить нужные объекты и выбрать команду меню Arrange/Shaping/Intersect (Упорядочить/Формирование/Пересечение);<br />
3) выделить один или несколько исходных объектов, выбрать команду меню Arrange/Shaping/Shaping (Упорядочить/Формирование/Формирование), на появившейся панели Shaping (Формирование) в выпадающем списке операций выбрать Intersect<br />
(Пересечение), нажать кнопку Intersect With (Пересечь с) и щелкнуть мышью на объекте-цели.<br />
Как и в случае с объединением форм, при использовании первых двух способов очередность выбора объектов не важна, тогда как при использовании третьего способа она может быть важна, если нужно указать, какие объекты после операции пересечения останутся, а какие будут удалены.<br />
<ol>
	<li>Исключение объектов. Для операции исключения объектов очередность их выделения важна: объекты, которые выделены первыми, будут исключаться из объектов, которые выделены последними.</li>
</ol>
Для того чтобы исключить, или, как еще говорят, вырезать один объект из другого, следует воспользоваться одним из следующих способов:<br />
1) выделить сначала объекты, которые будут исключаться, затем, в последнюю очередь, объект, из которого будет производиться исключение, и нажать кнопку Trim (Вырезка) на панели свойств;<br />
2) выделить по очереди объекты, участвующие в исключении, после чего выбрать команду меню Arrange/Shaping/Trim (Упорядочить/Формирование/Вырезка);<br />
3) выделить объекты, которые требуется исключить, выбрать команду меню Arrange/Shaping/Shaping (Упорядочить/Формирование/Формирование), в появившейся панели выбрать в раскрывающемся списке операцию Trim (Вырезка), установить с помощью соответствующих флажков, какие из объектов-операндов останутся, а какие будут удалены, после чего нажать кнопку Trim (Вырезать) и щелкнуть мышью на целевом объекте.<br />
Кроме того, имеются дополнительные возможности исключения объектов с помощью команд, которые можно выполнить, нажав соответствующие кнопки на панели свойств, или выбрав соответствующие команды в меню Arrange/Shaping (Упорядочить/Формирование): Simplify (Упрощенно), Front Minus Back (Передний без заднего) и Back Minus Front (Задний без переднего). С их использованием ознакомьтесь самостоятельно.<br />
<b>Модель кривой</b><br />
<b> </b><br />
 В основе принятой в Corel Draw модели линии лежат два понятия: узел и сегмент.<br />
Узел – точка на плоскости изображения, фиксирующая положение одного из концов сегмента кривой.<br />
Сегментом называется часть линии, соединяющая два смежных узла.<br />
Узлы и сегменты неразрывно связаны друг с другом: в замкнутой линии узлов столько, сколько сегментов, в незамкнутой – на один больше (рис.1).<br />
<img src="img/img-148.png" ><br />
Узлы линии отображаются на экране в виде небольших квадратиков с закругленными углами. Начальный узел отображается квадратиком чуть большего размера.<br />
Инструменты, позволяющие строить линии различных типов, сведены в CorelDraw в одну раскрывающуюся панель инструментов <b>Кривая </b>(рис.2).<br />
<img src="img/img-149.png" ><br />
В соответствии с общим стилем пользовательского интерфейса CorelDRAW на кнопке инструмента (Кривая )отображается значок последнего из использованных инструментов, кнопки которых присутствуют на его панели, и щелчок на этой кнопке снова активизирует тот же инструмент.<br />
<b>Линии и инструмент Кривая (Свободная рука)</b><br />
<b> </b><br />
Инструмент <b>Свободная рука</b> преобразует траекторию перемещения мыши в кривую. При этом узлы и сегменты линии формируются автоматически в соответствии с заданными параметрами инструмента (рис.3)<br />
<img src="img/img-150.png" ><br />
Если в процессе построения кривой линия «поехала не туда», не отпуская кнопку мыши, нажмите и удерживайте клавишу <b>Shift.</b> Перетаскивая указатель вдоль уже нарисованной линии в обратном направлении, можно стереть неудавшийся участок.<br />
Частота расположения узлов на строящейся кривой зависит от скорости перемещения указателя мыши.<br />
Избыточное количество кривой снижает плавность кривой. Узлы можно удалять, меняя их тип, месторасположение. Криволинейные сегменты легко преобразуются в прямолинейные и наоборот.<br />
<ol style="list-style-type: lower-latin;">
	<li>Если при работе инструментом <b>Кривая</b> возникает необходимость ограничивать наклон прямолинейных сегментов ломаной линии, нажимайте клавишу <b>Ctr</b>Если удерживать эту клавишу нажатой, то следующий прямолинейный сегмент будет наклонен к горизонтали под углом, кратным 150. Клавиша <b>Ctrl</b> ограничивает перемещение указателя также по вертикали и горизонтали.</li>
</ol>
<b> </b><br />
<b>Замыкание кривой</b><br />
<b> </b><br />
В момент приближения указателя мыши к точке, в которой начиналось построение кривой, указатель инструмента изменит свою форму. Если отпустить кнопку мыши в этот момент, то будет построена <b>замкнутая</b> кривая, если раньше - то <b>незамкнутая</b>.<br />
<b> </b><br />
<b>Инструмент Живопись (суперлиния)</b><br />
<b> </b><br />
Для построения и изменения данного типа линий можно пользоваться панелью свойств инструмента Живопись.<br />
Режимы работы с инструментом Живопись: заготовка, кисть, пульверизатор, каллиграфия, линия с нажимом (рис.4).<br />
<img src="img/img-151.png" ><br />
<b>Режим кисти</b><br />
<b> </b><br />
В режиме кисти инструмент Живопись (суперлиния) подчиненный объект не строится по управляющей линии, а только деформируется в соответствии с ее формой и заданной шириной суперлинии. Исходным материалом для деформации служат мазки – изображения, сохраненные в специальном формате.cmx (рис. 6).<br />
<img src="img/img-152.png" ><br />
<b> </b><b>Режим пульверизатора</b><br />
Режим пульверизатора инструмента Живопись (суперлиния) формирует не один подчиненный объект, а целую группу, размещая копии заранее определенного изображения или его отдельных частей (шаблон распылителя) вдоль управляющей линии (рис.7)<br />
<img src="img/img-153.png" ><br />
<b>Построение линий с помощью инструмента Размер</b><br />
<b> </b><br />
Классы объектов Corel Draw <b>Размерные линии </b>и<b> Соединительные линии </b>используются при построении специальных изображений: чертежей, схем, диаграмм, блок-схем. Для того, чтобы указать размеры объектов, следует дополнить рисунок размерными линиями.<br />
Чтобы нарисовать размерную линию, выберите нужный инструмент (<b>Вертикальный, Горизонтальный</b> или <b>Наклонный размер</b>) на панели свойств, а затем выполните два щелчка на рабочей странице для того, чтобы обозначить начальную и конечную точки размерной линии, и еще один щелчок – для фиксации расстояния линии до объекта и позиции размерного текста (рис. 8).<br />
<img src="img/img-154.png" ><br />
<img src="img/img-155.png" ><br />
<b>ОСНОВЫ РАБОТЫ С ТЕКСТОМ</b><br />
CorelDRAW существует две разновидности текстовых объектов: фигурный, или художественный (Artistic) и обычный, или простой (Paragraph) текст. Панель Property Bar (Панель свойств) при работе с текстовыми объектами похожа на панель форматирования текстового редактора.<br />
<img src="img/img-156.png" ><br />
Фигурный текст представляет собой графический объект, с которым можно работать, как с любым другим объектом CorelDRAW. Обычный текст представляет собой массив текста в рамке. Можно менять границы рамки обычного текста или придавать ей замысловатую форму, но внутри текст будет располагаться точно так же, как и в любом текстовом редакторе, например, в Microsoft Word.<br />
Фигурный текст, как правило, используется для заголовков и надписей. Обычный текст предназначен для ввода больших объемов текстовой информации и часто используется при создании рекламных листовок, а также при верстке в CorelDRAW газет и журналов.<br />
Фигурный текст. Чтобы добавить фигурный текст, нужно выбрать инструмент Text Tool (Текст) в панели инструментов Toolbox (Инструменты), установить указатель мыши на том месте, где требуется ввести текст и щелкнуть мышью: на месте щелчка появится текстовый курсор, который указывает, куда будет вставлен следующий символ при вводе с клавиатуры. На панели Property Bar (Панель свойств) можно установить гарнитуру шрифта, его размер, начертание, выравнивание текста. После этого можно вводить текст, причем, по завершении ввода вокруг текста появятся маркеры выделения, позволяющие работать с текстом, как с любым другом объектом.<br />
Если выделен текстовый объект целиком, изменится форматирование всех символов. При выбранном инструменте Text Tool (Текст) можно выделить часть текста, и поменять только его форматирование. В списках панели Property Bar (Панель свойств) настраиваются основные свойства текстового объекта. Дополнительные возможности по форматированию текста можно получить в специальном диалоге, который вызывается с помощью кнопки Format Text (Форматировать текст) панели Property Bar (Панель свойств).<br />
Чтобы отобразить все невидимые символы, достаточно нажать кнопку Non printing Characters (Непечатаемые символы). При печати эти символы будут не видны, поскольку они предназначены только для удобства при редактировании и оформлении текста.<br />
Редактирование текста осуществляется также просто. При выбранном инструменте Text Tool (Текст) следует щелкнуть мышью перед любым символом в тексте, и на месте щелчка появится текстовый курсор. В этом режиме можно перемещать текстовый курсор по фигурному тексту с помощью клавиш управления курсором. Удалять символы можно с помощью клавиш [Delete] или [Backspace]. При вводе фигурного текста, если требуется перейти на новую строку, следует воспользоваться клавишей [Enter]. Как и в текстовом редакторе, выделять фрагменты и перемещать курсор можно как с помощью мыши, так и с помощью специальных сочетаний клавиш.<br />
Обычный текст. Перед вводом обычного текста необходимо определить рамку, в которой он будет размещен. Чтобы задать эту рамку, нужно подвести указатель мыши к верхнему левому краю области, в которой требуется разместить текст, нажать левую кнопку мыши, и, не отпуская ее, начать передвигать мышь: на экране появится прямоугольная пунктирная рамка, размеры которой меняются вместе с передвижениями мыши. Далее следует подобрать нужный размер пунктирной рамки и отпустить кнопку мыши: рамка останется на экране, в ее начале появится текстовый курсор, а вокруг — маркеры выделения. На панели свойств можно выбрать параметры текста. После того, как текст будет введен, он будет отформатирован выбранным способом.<br />
При работе с обычным текстом добавляется несколько дополнительных возможностей по изменению формата. Кнопки Decrease Indent (Уменьшить отступ) и  Increase Indent (Увеличить отступ) панели свойств позволяют уменьшить и увеличить отступ текста от края рамки. Нажатие кнопки Show/Hide Drop Cap (Показать/Скрыть буквицу) панели свойств позволит получить эффект буквицы, а нажатие кнопки Show/Hide Bullet (Показать/Скрыть список) добавит маркеры списка к выделенным абзацам.<br />
<b>НАСТРОЙКА ИЗОБРАЖЕНИЯ</b><br />
<ol>
	<li>Масштаб изображения. При работе с графическим редактором часто приходится менять масштаб изображения, чтобы увидеть рисунок целиком или рассмотреть отдельные фрагменты. Мелкие фрагменты значительно легче редактировать при большом увеличении.</li>
</ol>
<img src="img/img-157.png" ><br />
Для изменения масштаба следует воспользоваться инструментом Zoom Tool (Масштаб) панели Toolbox (Инструменты). После выбора этого инструмента указатель мыши примет вид увеличительного стекла со знаком «плюс». Щелчок левой кнопкой мыши приведет к увеличению масштаба, правой — к уменьшению.<br />
Другой, более точный, способ увеличения масштаба изображения состоит в следующем: выбрать инструмент Zoom Tool (Масштаб) и обвести рамкой выделения ту область, которую необходимо рассмотреть.<br />
Кроме того, при выборе инструмента &quot;Zoom Tool&quot; на панели Property Bar (Панель свойств) появляются следующие кнопки, дающие дополнительные возможности по изменению масштаба изображения:<br />
- Zoom In (Увеличить масштаб) — увеличивает масштаб изображения;<br />
- Zoom Out (Уменьшить масштаб) — уменьшает масштаб изображения;<br />
- Zoom To Selected (Масштаб по выделенному) — изменяет масштаб выделенной области;<br />
- Zoom To All Object (Масштаб по всем объекту) — позволяет установить масштаб изображения, при котором будут видны все объекты сразу;<br />
- Zoom 1:1 (1:1) — отображает рисунок в масштабе 1:1;<br />
- Zoom To Page (Масштаб по странице) — устанавливает отображение всей страницы;<br />
- Zoom To Page Width (Масштаб по ширине страницы), Zoom To Page Height (Масштаб по высоте страницы) — отображают лист по ширине или по высоте соответственно.<br />
С помощью инструмента Hand Tool (Рука) можно передвигаться по изображению. Кроме того, панорамирование изображения можно осуществлять с помощью полос прокрутки, с помощью квадратного значка, расположенного на пересечении полос прокрутки, а также нажав и удерживая кнопку-колесико мыши.<br />
Для изменения масштаба просмотра можно использовать выпадающий список масштабов, расположенный в правой части панели Standard (Основная), а также прокручивая кнопку-колесико мыши.<br />
<img src="img/img-158.png" ><br />
Использование вспомогательных объектов. В компьютерной графике широко используется метод привязывания объектов к некоторым вспомогательным элементам или друг к другу, т.е. форсируется выравнивание узлов объектов при рисовании или перемещении. CorelDRAW, конечно, не стал исключением из правила, и предоставляет широкий спектр возможностей по использованию привязок.<br />
Привязка может осуществляться к вспомогательным объектам (сетке, направляющим линиям), а также к другим объектам. В версии CorelDRAW 12 появились вспомогательные объекты, называемые динамическими направляющими, а также расширились возможности по использованию привязок объектов друг к другу. Кроме того, при рисовании и перемещении объектов часто используются измерительные линейки.<br />
Измерительные линейки. Измерительные линейки активизируются посредством выбора команды меню View/Rulers (Вид/Линейки). Линейки располагаются в верхней и в левой частях рабочего окна и позволяют определить размеры и местонахождение объектов. Единицы измерения на линейках соответствуют единицам измерения, принятым в редактируемом документе. При выбранном инструменте Pick Tool (Стрелка) и при отсутствии выделенных объектов можно установить единицы измерения с помощью выпадающего списка Units (Единицы) панели Property Bar (Панель свойств).<br />
Нулевые координаты на линейках имеет левый нижний угол рабочей области, однако при необходимости точку отсчета можно изменить, перетащив мышью кнопку, расположенную в месте пересечения линеек.<br />
Сетка. Сетка — это вспомогательный объект, представляющий собой множество горизонтальных и вертикальных линий, расположенных друг от друга на заданном расстоянии. Привязка осуществляется к узлам сетки, т.е. к точкам, лежащим на пересечении линий сетки (рис.2). <br />
<img src="img/img-159.png" ><br />
Для того, чтобы настроить сетку, следует выбрать команду меню View/Grid and Ruler Setup (Вид/Настройка сетки и линеек). В появившемся диалоговом окне можно установить следующие параметры настройки сетки:<br />
- Frequency (Частота) — устанавливает частоту горизонтальных и вертикальных линий сетки, т.е. количество линий сетки на единицу измерения;<br />
- Spacing (Интервал) — устанавливает расстояние между линиями сетки в единицах измерения;<br />
- Show Grid (Показать сетку) — устанавливает, будет ли отображаться сетка;<br />
- Snap To Grid (Привязка к сетке) — устанавливает, будет ли осуществляться привязка объектов к узлам сетки;<br />
- Show grid as lines/ Show grid as dots (Показывать сетку как линии/Показывать сетку как точки) — устанавливает режим отображения сетки в виде линий или в виде точек соответственно.<br />
Направляющие. Направляющие линии — это вспомогательные линии, которые используются для точного позиционирования объектов (рис.3). Самый быстрый и простой способ получить направляющие — щелкнуть мышью на одной из измерительных линеек и перетащить курсор мыши в рабочую область.<br />
<img src="img/img-160.png" ><br />
Использование привязки к направляющим для построения трапеции с помощью инструмента Pen Tool (Перо)<br />
Если нужно добавить сразу несколько направляющих, проходящих под определенным углом через определенные координаты, можно воспользоваться командой меню View/Guidelines Setup (Вид/Настройка направляющих). В появившемся диалоговом окне в иерархическом списке слева можно выбрать, какие направляющие будут настраиваться: горизонтальные, вертикальные, наклонные или заготовки.<br />
При выборе пункта Horizontal (Горизонтальные) активизируется панель со списком координат горизонтальных направляющих. В поле над списком можно ввести другие координаты, а в выпадающем списке справа от поля — выбрать единицы измерения. Кроме того, имеются 4 кнопки:<br />
- Add (Добавить) — добавляет направляющую с координатой, заданной в поле над списком направляющих;<br />
- Move (Переместить) — переносит активную направляющую в координату, введенную в поле над списком направляющих;<br />
- Delete (Удалить) — удаляет направляющую из списка;<br />
- Clear (Очистить) — очищает список направляющих.<br />
При выборе пункта Vertical (Вертикальные) активизируется панель, сходная с панелью настройки горизонтальных направляющих.<br />
При выборе пункта Guides (Направляющие) на панели отобразится список всех направляющих, причем горизонтальные направляющие будут помечены буквой H, а вертикальные — буквой V. Кроме того, с помощью этой панели можно создавать наклонные направляющие. Для этого в списке Specify (Определить) выбирается метод создания наклонной направляющей: Angle and 1 Point (Угол и точка) или 2 Points (Две точки). В первом случае направляющая будет задаваться координатами точки (X;Y) и углом, под которым она проходит через эту точку, а во втором — координатами двух точек.<br />
Привязка объектов. В CorelDRAW существует возможность устанавливать привязку объектов к сетке, направляющим и другим объектам, которая будет действовать при создании и трансформации объектов. Активизация привязок осуществляется с помощью соответствующих команд меню:<br />
- View/Snap To Grid (Вид/Привязать к сетке) — устанавливает привязку к узлам сетки;<br />
- View/Snap To Guidelines (Вид/Привязать к направляющим) — устанавливает привязку к направляющим;<br />
- View/Snap To Objects (Вид/Привязать к объектам) — устанавливает привязку объектов друг к другу.<br />
У каждого объекта в CorelDRAW есть габаритные элементы, которые подчиняются установленным привязкам, если попадают в область, которая называется областью фиксации. Чтобы указать, какими габаритными элементами объекты привязываются друг к другу, следует выбрать команду меню View/Snap To Objects Setup (Вид/Настройка привязки к объектам). Появится диалоговое окно, в котором с помощью соответствующих флажков можно установить, к каким элементам будут привязываться объекты:<br />
- Node (Узел) — устанавливает привязку к узлам объектов;<br />
- Intersection (Пересечение) — устанавливает привязку к геометрическим пересечениям объектов;<br />
- Midpoint (Середина) — устанавливает привязку к серединам сегментов;<br />
- Quadrant (Квадрант) — устанавливает привязку к точкам, которые соответствуют углам в 0°, 90°, 180° и 270° на окружности, эллипсе или дуге;<br />
- Tangent (Касательная) — устанавливает привязку к точкам на контуре дуги, окружности или эллипса, в которых линия касается контура, но не пересекает его;<br />
- Perpendicular (Перпендикуляр) — устанавливает привязку к точкам на сегменте, в которых линия перпендикулярна сегмент;<br />
- Edge (Край) — устанавливает привязку к точкам на контуре объекта;<br />
- Center (Центр) — устанавливает привязку к центру габаритного контейнера объекта;<br />
- Text baseline (Базовая линия текста) — устанавливает привязку к точкам на базовой линии художественного или простого текста.<br />
<img src="img/img-161.png" ><br />
Режимы отображения документа. CorelDRAW имеет пять режимов отображения документа (рис.5):<br />
- Simple Wireframe (Упрощенный каркас) — режим отображения каркаса иллюстрации, при котором отображаются только контуры иллюстраций; очень удобен для точного размещения контуров объектов в сложных иллюстрациях; кроме того, в этом режиме несколько упрощено отображение некоторых эффектов (смешения, экструзии и контура);<br />
- Wireframe (Каркас) — аналогичен предыдущему, но эффекты отображаются полностью;<br />
- Draft (Черновик) — используется преимущественно для компоновки элементов макета: растровые изображения отображаются с пониженным разрешением, а цвета заливок рассчитываются приблизительно; при этом увеличивается скорость прорисовки изображения;<br />
- Normal (Обычный) — используется в большинстве случаев, поскольку представляет реальный компромисс между качеством и скоростью отображения;<br />
- Enhanced (Улучшенный) — использует максимальное разрешение растровых изображений, сглаживание контуров объектов и шрифтов, обеспечивая максимальное качество демонстрации документа; однако, скорость прорисовки документа снижается.<br />
<img src="img/img-162.png" ><br />
<b>СТРАНИЦЫ В CorelDRAW</b><br />
CorelDRAW позволяет создавать многостраничные макеты.<br />
Переименование страниц. Изначально каждый новый документ содержит всего одну страницу, которая называется Page 1. Чтобы переименовать страницу, можно щелкнуть правой кнопкой мыши на ярлычке с ее именем в нижней части окна, слева от горизонтальной полосы прокрутки, в появившемся меню выбрать команду Rename Page (Переименовать страницу), в открывшемся диалоговом окне в поле Page Name (Имя страницы) ввести имя и нажать кнопку ОК. Кроме того, можно воспользоваться командой меню Layout/Rename Page (Макет/Переименовать страницу).<br />
Добавление и удаление страниц. Чтобы вставить страницу перед или после текущей, можно воспользоваться одной из кнопок слева от вкладок с именами страниц. Однако эта кнопка действует только в том случае, если активной является первая или последняя страница, и вставляет только одну страницу. Если же необходимо добавить несколько страниц, то удобнее воспользоваться командой меню Layout/Insert Page (Макет/Вставить страницу): появится диалоговое окно, в котором можно установить сколько страниц нужно вставить до (Before) или после (After) текущей страницы (Page), будут ли они ориентированы вертикально (Portrait) или горизонтально (Landscape), а также формат и размеры бумаги.<br />
 Наконец, можно щелкнуть правой кнопкой на ярлычке с именем одной из страниц и в появившемся контекстном меню выбрать команду Insert Page After (Вставить страницу после) или Insert Page Before (Вставить страницу до).<br />
 Чтобы удалить страницу, можно воспользоваться командой Delete Page (Удалить страницу) контекстного меню, которое вызывается правым щелчком мыши на ярлычке с ее именем. Кроме того, можно удалить сразу несколько страниц, выбрав команду меню Layout/Delete Page (Макет/Удалить страницу). В поле Delete Page (Удалить страницу) следует ввести номер страницы, которую нужно удалить. Если же требуется удалить несколько страниц, начиная с некоторой, следует установить флажок Through to page (До страницы) и в поле справа от него ввести, до какой страницы включительно удалить, начиная со страницы, указанной в поле Delete Page (Удалить страницу).<br />
Навигация по страницам. Слева от ярлычков страниц расположены кнопки навигации: — перейти к первой странице, — перейти к предыдущей странице, — перейти к последней странице, — перейти к следующей странице. Если требуется перейти к какой-либо определенной странице, то удобно воспользоваться командой меню Layout/Go To Page (Макет/Перейти к странице). Кроме того, для быстрой навигации по страницам можно использовать клавиши [Page Up] и [Page Down] или попросту щелкать на ярлычке с именем нужной страницы.<br />
Ориентация и размеры страниц. Страницы одного документа могут иметь разные размеры и ориентацию. Для изменения ориентации существует несколько способов: 1) нажать кнопку Portrait (Портретная) или Landscape (Альбомная) на панели свойств инструмента Pick Tool (Стрелка) при условии, что ни один объект не выделен; 2) щелкнуть на ярлычке страницы правой кнопкой мыши и выбрать в контекстном меню<br />
команду Switch Page Orientation (Изменить ориентацию страницы); 3) выбрать команду меню Layout/Switch Page Orientation (Макет/Изме­нить ориентацию страницы); 4) выбрать команду меню Layout/Page Setup (Макет/Параметры страницы) и в появившемся диалоговом окне Options (Параметры) установить ориентацию страницы с помощью переключателя Portrait/Landscape (Портретная/Альбомная).<br />
Размеры страницы можно установить в полях Paper Width and Height (Ширина и высота бумаги) панели свойств инструмента Pick Tool (Стрелка) при отсутствии выделенных объектов, а также с помощью диалогового окна Options (Параметры).<br />
Следует отметить, что это диалоговое окно позволяет также устанавливать, будут ли настройки размеров страницы применяться только к текущей странице (Resize current page only), подобрать подходящий формат страницы из установок принтера (Set From Printer), а также добавить к иллюстрации прямоугольник с размерами, равными установленным размерам страницы (Add Page Frame).<br />
Фон страницы. По умолчанию страницы белые, т.е. не имеют никакого фонового цвета или рисунка. Если же требуется изменить фон страницы, то следует воспользоваться командой меню Layout/Page Background (Макет/Фон страницы). На экране появится диалоговое окно, в котором переключатель фона по умолчанию установлен в положение No Background (Нет фона). Если требуется изменить только цвет фона, то следует установить этот переключатель в положение Solid (Сплошной) и в появившемся списке цветов выбрать нужный цвет.<br />
В некоторых случаях в качестве фона требуется использовать рисунок. Тогда следует установить переключатель в положение Bitmap (Растровый), после чего нажать кнопку Browse (Обзор). Появится стандартное диалоговое окно импорта файлов, в котором требуется выбрать файл с растровым форматом, который требуется использовать в качестве фона и нажать кнопку Import (Импорт). После этого в разделе Source (Источник) будет указано место расположения файла, а с помощью соответствующего переключателя можно установить, будет ли рисунок внедрен в документ (Embedded) или будет ли вставлен как ссылка на ресурс (Linked). В разделе Bitmap Size (Размер растра) можно установить, что будет использоваться исходный (Default Size) или пользовательский (Custom Size) размер рисунка; во втором случае можно будет установить его размеры по высоте и ширине.<br />
<b>Специальные эффекты </b><br />
<strong>Одной из мощнейших возможностей программы Corel Draw 13 (X3), разработанной в Corel Corporation справедливо считается возможность применять к объектам всевозможные художественные эффекты Corel Draw, позволяющие создавать удивительные по красоте иллюстрации, например, эффекты тени, прозрачности, линзы, перспективы и др. Наши уроки Corel Draw расскажут о настройке параметров этих эффектов как путем ввода конкретных числовых значений, так и интерактивно. Обучение Corel эффектам я разбил на несколько уроков, получив, таким образом, для программы Corel Draw учебник по спецэффектам.</strong>
Для применения специальных эффектов служат инструменты, объединенные на специальной панели в разделе Toolbox (Инструменты)<br />
<strong>Corel Draw: эффект Blend (Смешение)</strong>
Этот эффект позволяет создавать цепочку объектов, преобразовывающих один объект в другой путем прогрессии формы и цветов (рис.1). При этом смешение форм может проходить как вдоль прямой, так и вдоль произвольной кривой, а также может быть составным. В создании этого эффекта участвуют два объекта: Start (Стартовый) и End (Конечный).<br />
<img src="img/img-163.png" ><br />
преобразования круга с однородной заливкой в цветок с градиентной.<br />
Чтобы создать эффект смешения вдоль прямой, на панели инструментов следует выбрать инструмент <strong>Interactive Blend Tool (Интерактивный смеситель)</strong> (рис.2). Затем следует щелкнуть на одном из объектов и, удерживая кнопку мыши нажатой, переместить курсор на второй объект и отпустить кнопку мыши: между стартовым и конечным объектами появится цепочка промежуточных объектов.<br> Чтобы создать эффект смешения вдоль произвольной кривой, можно, удерживая клавишу [Alt], рисовать произвольную кривую, соединяющую стартовый и конечный объекты. Эта кривая будет отображаться в виде синей пунктирной линии.<br />
В обоих случаях, объект, порядок которого был ниже (см. предыдущие уроки corel draw на нашем сайте), станет стартовым объектом, а тот объект, порядок которого был выше - конечным.<br />
<img src="img/img-164.png" ><br />
При использовании эффекта смешения необходимо помнить следующее:<br />
- если перемещать стартовый или конечный объекты, то цепочка промежуточных объектов будет также перемещаться;<br />
- если удалить стартовый или конечный объект, будет удалена и цепочка переходных объектов;<br />
- если изменять цвет или форму стартового или конечного объекта, то будут меняться цвет и форма промежуточных объектов;<br />
- цветовая прогрессия будет иметь место только в том случае, если объекты имеют либо однородную, либо градиентную заливку.<br />
Рассмотрим теперь панель свойств инструмента Interactive Blend Tool ((Интерактивный смеситель).<br />
В выпадающем списке Preset List (Список заготовок) можно выбрать одну из уже созданных ранее заготовок этого эффекта, а с помощью кнопок Add Preset (Добавить заготовку) и Delete Preset (Удалить заготовку) можно добавлять свои заготовки в список и удалять их из списка.<br />
С помощью кнопок Use Steps or Fixed Spacing for Blend (Использовать шаги или фиксированное расстояние) можно установить, будет ли задаваться положение промежуточных форм их числом или расстоянием между ними. В полях раздела Number of Steps or Offset Between Blend Shapes (Число шагов или расстояние между формами) можно установить, соответственно, количество промежуточных форм или расстояние между ними.<br />
В поле Blend Direction (Направление смешения) можно установить, на сколько градусов будет повернута каждая следующая фигура относительно предыдущей. С помощью кнопок Direct Blend (Направленное смешение), Clockwise Blend (Смешение по часовой стрелке) и Counterclockwise Blend (Смешение против часовой стрелки) можно установить, каким образом в процессе смешения будет прогрессировать цвет относительно спектра.<br />
Щелчок по кнопке Object and Color Acceleration (Ускорение объекта и цвета) активизирует панель, на которой можно установить, будет ли изменение формы и цвета объектов ускоряться при приближении к стартовому или конечному объекту. По умолчанию ускорение изменения цвета и ускорение изменения формы происходят одинаково. Это обеспечивается нажатой кнопкой с замочком на этой панели. Если кнопку отжать, то регулировать ускорения можно будет независимо друг от друга. Кроме того, для интерактивной регулировки этих ускорений предназначены треугольные маркеры на пунктирной линии-пути смешения.<br />
Кнопка Start and End Objects Properties (Свойства стартового и конечного объектов) вызывает вспомогательное меню, содержащее следующие команды:<br />
 - New Start (Новый стартовый) - позволяет выбрать другой объект в качестве стартового для текущего смешения; при этом порядок нового стартового объекта не может быть выше порядка текущего конечного объекта;<br />
- Show Start (Показать стартовый) - выделяет текущий стартовый объект;<br />
- New End (Новый конечный) - позволяет выбрать другой объект в качестве конечного для текущего смешения; при этом порядок нового конечного объекта не может быть ниже порядка текущего стартового объекта;<br />
- Show End (Показать конечный) - выделяет текущий конечный объект.<br />
Кнопка Path Properties (Параметры пути) программы Corel Draw активизирует вспомогательное меню, которое содержит следующие команды:<br />
- New Path (Новый путь) - позволяет выбрать некоторую кривую в качестве пути для эффекта смешения; при этом стартовый и конечный объекты будут перемещаться только вдоль этой кривой-пути; если же требуется чтобы стартовый и конечный объекты расположились точно на концах этой кривой, то можно нажать на панели свойств кнопку Miscellaneous Blend Options (Различные параметры смешения) и на появившейся панели установить флажок Blend Along Full Path (Смешение вдоль всего пути);<br />
- Show Path (Показать путь) - выделяет текущую линию-путь;<br />
- Detach From Path (Отсоединить от пути) - отсоединяет объекты смешения от текущего пути.<br />
Все вышеописанные настройки эффекта смешения становятся доступными на соответствующей панели, которая активизируется, если выбрать команду меню <strong>Effects/Blend (Эффекты/Смешение).</strong><br />

<strong>Corel Draw 13: эффект Contour (Котнур)</strong>
Эффект Contour (Контур) предназначен для многократного оконтуривания объектов, направленного как внутрь объекта, так и наружу (рис.3).<br />
Применить этот эффект можно с помощью команды меню <strong>Effect/Contour (Эффект/Контур)</strong> или с помощью инструмента Interactive Contour Tool (Интерактивный контур) на панели Toolbox (Инструменты). В последнем случае нужно выделить объект, затем выбрать инструмент Interactive Contour Tool (Интерактивный контур) щелкнуть на объекте, не отпуская мышь, переместить курсор внутрь объекта или наружу, после чего щелкнуть еще раз мышью.<br />
После применения эффекта появится специальный управляющий вектор с маркерами на концах и ползунком. Длина вектора соответствует ширине контура, а перемещение маркеров позволяет регулировать ширину и направление контура. При этом при увеличении ширины контура увеличивается число фигур контура, но не их ширина. Ширину контурных фигур можно изменять, передвигая ползунок на управляющем векторе.<br />
<img src="img/img-165.png" ><br />
Продолжим <strong>обучение Corel</strong>. Рассмотрим панель свойств инструмента Interactive Contour Tool (Интерактивный контур). В списке Presets (Заготовки) предлагается несколько уже настроенных эффектов контура. С помощью кнопок Add Preset (Добавить заготовку) и Delete Preset (Удалить заготовку).<br />
Кнопки To Center (К центру), Inside (Внутрь) и Outside (Наружу) устанавливают тип оконтуривания. В поле Contour Steps (Шаги контура) следует установить число контурных фигур. Следует отметить, что это поле недоступно при работе с типом эффекта To Center (К центру): в этом случае число фигур подбирается таким образом, чтобы они заполнили весь объект. В поле Contour Offset (Смещение контура) можно задать ширину контурных фигур.<br />
С помощью кнопок Linear Contour Colors (Цвета контура линейно), Clockwise Contour Colors (Цвета по часовой стрелке) и Counterclockwise Contour Colors (Цвета против часовой стрелки) можно установить направление перехода цветов объекта к цветам заливки и контура конечной контурной фигуры, которые, в свою очередь, устанавливаются в полях Outline Color (Цвет контура) и Fill Color (Цвет заливки).<br />
С помощью кнопки Object and Color Acceleration (Ускорение объекта и цвета) активизируется панель, на которой с помощью соответствующих ползунков можно устанавливать, с каким ускорением будут изменяться ширина и цвет контурных фигур.<br />
<strong>Эффект Corel Draw: Distortion (Искажение)</strong>
Интересные и порой неожиданные изображения можно получить, применяя в программе, производства <strong>Corel Corparation</strong> к объектам эффект искажения. Инструмент для создания этого эффекта - <strong>Interactive Distortion Tool</strong> (Интерактивное искажение) - также расположен на панели Toolbox (Инструменты). Для того чтобы применить эффект искажения, нужно выделить объект, выбрать этот инструмент, щелкнуть на объекте и, не отпуская кнопку мыши, протянуть вектор искажения.<br />
Для <strong>эффектов CorelDRAW </strong>используются три основных типа искажений: Push and Pull Distortion (Втягивание и вытягивание), Zipper Distortion («Молния») и Twister Distortion (Скручивание), что отражают наши уроки corel draw (рис.4). Для выбора типа искажения служат специальные кнопки на панели свойства инструмента Interactive Distortion Tool (Интерактивное искажение). Примечательно, что к уже искаженному объекту можно применять новые искажения. Однако, этот эффект очень требователен к ресурсам компьютера, поэтому сильно увлекаться многоразовым применением его к объектам не стоит.<br />
<img src="img/img-166.png" ><br />
Какой бы тип искажения не был выбран, на панели свойств будут расположены следующие четыре кнопки:<br />
- Center Distortion (Искажение от центра) - перемещает центр искажения в геометрический центр объекта;<br />
- Convert To Curves (Преобразовать в кривые) - преобразовывает искаженный объект в обычную кривую;<br />
- Copy Distortion Properties (Копировать свойства искажения) - позволяет скопировать параметры искажения с другого объекта: по нажатию на кнопку курсор изменится на широкую черную стрелку, после чего можно указать, параметры искажения какого объекта требуется скопировать;<br />
- Clear Distortion (Отменить искажение) - преобразовывает объект к изначальному, неискаженному виду.<br />
Помимо этого, каждому из типов искажения присущи свои специфические свойства, поля для настройки которых появляются в соответствии с тем, какой из типов выбран:<br />
 <strong>Эффекты Corel Draw: Втягивание и вытягивание</strong>. Этому типу искажения присуще только одно специфическое свойство - Push and Pull Distortion Amplitude (Амплитуда втягивания/вытягивания): положительные значения этого параметры соответствуют втягиванию, отрицательные - вытягиванию.<br />
 <strong>Эффекты Corel Draw: «Молния»</strong>. Для настройки этого типа искажения в CorelDRAW предусмотрены следующие параметры: 1) амплитуда (Zipper Distortion Amplitude) - величина, пропорциональная длине вектора; для ее изменения можно также использовать квадратный маркер на конце управляющего вектора; 2) частота (Zipper Distortion Frequency) - для ее изменения также служит ползунок на управляющем векторе.<br />
Кроме того, c помощью специальных кнопок на панели свойств можно задать дополнительные атрибуты этого типа искажения: хаотичность (Random Distortion), сглажен-ность (Smooth Distortion) и локальность (Local Distortion).<br />
<strong>Эффекты Corel Draw: Скручивание</strong>. Для этого типа специфическими параметрами являются: 1) направление скручивания - по часовой стрелке (Clockwise Rotate) или против часовой стрелки (Counterclockwise Rotate); 2) число полных оборотов (Complete Rotations); 3) дополнительное вращение (Additional Degrees) - для интерактивного изменения служит круглый маркер на управляющем векторе.<br />
<strong>Таким образом, эффекты Corel Draw 13 (X3), разработанной в Corel Corporation - отличный способ выразить ваши замыслы. Следующие уроки Corel Draw расскажут о других эффектах Corel: эффект Envelope (оболочка), эффект Extrude (выдавливание), эффект Drop Shadow (тень), эффект Transparency (прозрачность), эффект Lens (линзы), эффект Add Perspective (перспектива), эффект Powerclip (контейнер). Как я уже говорил, обучение Corel эффектам я разбил на несколько уроков, получив, таким образом, для программы Corel Draw учебник по спецэффектам.</strong>

                </strong>
              </p>
            </tab-pane>

            <tab-pane class="text-color">
              <template slot="label">
                Горячие клавиши
              </template>
              <p class="blockquote blockquote-primary">
                <strong><strong class="name"></strong>
                <img src="img/img-232.png" >
                </strong>
              </p>
            </tab-pane>

              <tab-pane class="text-color">
                <template slot="label">
                ЛПЗ №1
                </template>
                <p class="blockquote blockquote-primary">
                  <strong><strong class="name"></strong>
                  <b>Содержание работы:</b><br />
<ol>
  <li>Запустите программу Corel Draw<br> <b>Пуск – Программы – </b><b>Corel</b><b> Draw</b></li>
  <li>Рассмотрите рабочее окно программы.</li>
  <li>Построение прямоугольников.<br> Для построения прямоугольника необходимо:</li>
  <ul>
    <li>Установить курсор на кнопку инструмента <b>Прямоугольник</b> в<b> наборе инструментов</b></li>
    <li>Когда указатель мыши превратиться в небольшой крестик, щелкните в нужном месте страницы и, удерживая левую клавишу мыши, начните перетаскивать указатель.</li>
  </ul>
  <li>Применение клавиш-модификаторов <b>Ctrl</b><b> </b>и <b>Shift</b>.</li>
  · Для построения квадрата необходимо в процессе перетаскивания указателя мыши удерживать нажатой клавишу <b>Ctrl</b>.<br />
  · Для построения прямоугольника с заданным центром необходимо в процессе перетаскивания курсора мыши удерживать нажатой клавишу <b>Shift</b>.<br />
  <li>Изменение цвета абриса и фона прямоугольника</li>
  · выделите заданный объект<br />
  · подведите указатель мыши к экранной палитре цветов<br />
  · щелчком левой клавишей мыши выберите нужный цвет фона<br />
  · щелчком правой клавишей мыши выберите цвет абриса<br />
  <li>Создайте на открытой странице рисунки 1-5 (рис.1- рис.5) и ярлык страницы переименуйте, задав новое имя <b>Прямоугольник</b>.</li>
<img src="img/img-130.png" ><br />
  <li>Закругление углов прямоугольника</li>
  · Выберите в Наборе инструментов инструмент <b>Форма, </b>наведите его указатель на любой из расположенных в углах прямоугольника узлов и перетащите вдоль любой из сторон прямоугольника<br />
  · На панели свойств: Прямоугольник в поля <b>Коэффициенты закругления углов</b> введите величины радиуса закругления каждого из углов прямоугольника. Значения выражены в процентах, за 100% принята половина короткой стороны прямоугольника<br />
  · Чтобы закруглить только один угол, наведите указатель инструмента <b>Прямоугольник </b>на узел, и перед началом перетаскивания узла имя: <b>Закругление. </b>Создайте рисунки 6-11 (рис.6- рис.11).щелкните мышью – сбросится выделение всех узлов, кроме того, на котором был выполнен щелчок.<br />
  <li>Вставьте новую страницу. Присвойте</li>
<img src="img/img-131.png" ><br />
  <li>Построение и модификация эллипсов, дуг, секторов<br> Для построения эллипсов необходимо:</li>
  <ul>
    <li>Установить курсор на кнопку инструмента <b>Эллипс</b> в<b> наборе инструментов</b></li>
    <li>Когда указатель мыши превратиться в небольшой крестик, щелкните в нужном месте страницы и перетащите указатель этого инструмента по диагонали габаритной рамки будущего эллипса.</li>
    <li>Выберите инструмент <b>Форма. </b>Найдите узел вновь построенного эллипса и наведите на него указатель мыши. Нажмите кнопку мыши и сместите узел по направлению к центру габаритного прямоугольника, а затем не выходя за границу эллипса – по часовой стрелке. После отпускания кнопки мыши эллипс будет преобразован в сектор. При этом в строке состояния и в панели атрибутов отобразятся центральный угол сектора и направления ограничивающих его радиусов</li>
    <li>Постройте еще один эллипс и повторите описанную на предыдущем шаге последовательность действий, только перемещайте узел эллипса не внутри него, а снаружи. В результате будет построена дуга эллипса, а не сектор.</li>
  </ul>
  <li>Вставьте новую страницу. Присвойте имя: <b>Эллипсы. </b>Создайте рисунки 12-19 (рис.12 - рис.19).</li>
<img src="img/img-132.png" ><br />
  <li>Построение и модификация многоугольников.</li>
  Для построения многоугольников необходимо:<br />
  <ul>
    <li>Установить курсор на кнопку инструмента <b>Многоугольник</b> в наборе инструментов<b>. </b>На панели атрибутов установите число углов многоугольника</li>
    <li>Постройте многоугольник, перетащив по диагонали его габаритного прямоугольника указатель инструмента <b>Многоугольник </b></li>
    <li>Выберите инструмент <b>Форма </b>и наведите указатель на любой из его узлов и перетащите его радиусу к центру. После отпускания кнопки мыши многоугольник будет преобразован в звезду.</li>
    <li>Постройте еще один многоугольник, только перемещайте узел многоугольника по часовой стрелке вокруг центра. В результате фигура утратит осевую симметрию.</li>
  </ul>
  <li>Вставьте новую страницу. Присвойте имя: <b>Многоугольники. </b>Создайте рисунок 20 (рис.20).</li>
<img src="img/img-133.png" ><br />
  <li>Вставьте новую страницу. Присвойте имя: <b>Спирали. </b></li>
  Создайте рисунок 21 (рис.21).<br />
<img src="img/img-134.png" ><br />
  <li>Вставьте новую страницу. Присвойте имя: <b>Сетки. </b>Создайте рисунок 22 (рис.22).</li>
 <img src="img/img-135.png" ><br /> 
  <li>Вставьте новую страницу. Присвойте имя: <b>Орнамент. </b>Создайте рисунок 23 (рис.23).</li>
<img src="img/img-136.png" ><br />
</ol>
<ol>
  <b>КОНТРОЛЬНЫЕ ВОПРОСЫ </b><br />
  <b> </b><br />
	<li>Какие вы знаете графические редакторы.</li>
	<li>Преимущества и недостатки векторной графики.</li>
	<li>Элементы рабочего окна Corel Draw.</li>
	<li>Графические примитивы.</li>
	<li>Класс объектов прямоугольник: выделенный объект, рамка выделения, маркеры, клавиши-модификаторы, узлы, закругление узлов.</li>
	<li>Класс объектов эллипс: сектор и дуга эллипса.</li>
	<li>Построение выпуклых и звездчатых многоугольников.</li>
	<li>Построение сеток и спиралей.</li>
</ol>

                  </strong>
                </p>

              </tab-pane>
              <tab-pane class="text-color">
                <template slot="label">
                  ЛПЗ №2
                </template>
                  <p class="blockquote blockquote-primary">
                    <strong><strong class="name">Инструкционно -технологическая карта к теме: «Преобразование   объектов»</strong><br />
                    Задание1 :Построить изображение зонтикаЗадание1 :Построить изображение зонтика<br />
                      <img src="img/img-123.png" ><br />
                    1 .Создать новый документ Corel DRAW.<br />
<ol>
	<li>Нарисовать купол зонта. Для этого выбрать инструмент Ellipse Tool (Эллипс), на панели параметров инструмента нажать кнопку Pie ( сектор), в полях Starting and Ending Angles (Начальный и конечный углы) установить следующие значения: построить купол, закрасить его жёлтым цветом. Убрать контур, для этого на палитре цветов выполнить щелчок правой кнопкой мыши по перечёркнутому квадрат.</li>
	<li>Украсить купол зонта кругами разного размера и цвета. Для этого выбрать инструмент</li>
</ol>
Еllipse Тооl (Эллипс), на панели параметров инструмента нажать кнопку Ellipse, построить круги, раскрасить их в разные цвета.<br />
4.Создать группу из созданных объектов. Для этого выделить все созданные объекты (клавиши &lt;Ctrl+A&gt;) и сгруппировать их ( клавиши &lt;Ctrl+G&gt;).<br />
5.Построить ручку у зонта. Для этого:<br />
А<i>)</i><i> </i>построить прямоугольник шириной 5 мм и высотой 200мм и закрасить его тёмным цветом;<br />
Б) в нижнем конце этого прямоугольника построить эллипс при помощи инструмента Еllipse Тооl (Эллипс);<br />
В) преобразовать эллипс в дугу. Для этого выбрать инструмент Shape Tool (форма). Вверху эллипса будет виден узел. Левой кнопкой мыши потянуть за этот узел вдоль дуги, поместив курсор мыши в��е эллипса. При это линия разорвется. Обратить внимание, что если курсор мыши попадает внутрь эллипса, то сформируется сектор, а не дуга. Сформировать ручку зонта, перемешать узду на концах дуги;<br />
Г) установить толщину полученной дуги 5мм. Для этого выбрать инструмент <b>Outline</b><br />
<b>Pen</b><b> </b><b>Dialog</b><b> </b>(обводка контура) и в открывшемся диалоговом окне <b>Outline</b><b> </b><b>Pen</b><b> </b>в поле <b>Width</b><b> </b>(ширина) установить значение 5, а в поле Color (Цвет) установить цвет такой же , как у прямоугольника(рис1) ;<br />
Д) выбрать инструмент <b>Pick</b><b> </b>Тоо1(указатель) и переместить полученную дугу так, чтобы вместе с прямоугольником они образовали закругленную ручку зонта.<br />
<ol>
	<li>Сгруппировать детали ручки зонта. Для этого при выбранном инструменте <b>Pick</b></li>
</ol>
<b>Гоо1</b>(указатель) щелкнуть по одной детали и, удерживая кнопку &lt;Shift&gt;,щелкнуть<br />
по второй детали. Нажать на панели параметров кнопку <b>Group</b> (сгруппировать).<br />
7.Переместить ручку зонта на задний план. Для этого выделить ручку и нажать<br />
комбинацию клавиш &lt;Ctrl+Page Down&gt; или выделить купол и нажать комбинацию<br />
клавиш &lt;Ctrl+Page Up&gt;.<br />
<ol>
	<li>Сгруппировать купол и ручку (клавиши &lt;Ctrl+ G&gt;).</li>
	<li>Сохранить файл под именем <b>зонт.cdr.</b></li>
</ol>
Задания для самостоятельной работы:<br />
<b><i>задание: 1</i></b><br />
 Построить звезду, закрасить ее градиентной заливкой, добавить искорки. Сохранить файл под именем звезда<br />
 <img src="img/img-124.png" ><br />
 Указание:<br />
• для заливки создать пользовательский конический градиент (рис 2);<br />
• искорку создать из четырехугольников с помощью инструмента форма<br />
<b><i>задание: 2</i></b><br />
Построить разноцветные воздушные шарики<br />
<img src="img/img-125.png" ><br />
Указание:<br />
• для шариков применить градиентную радиальную заливку;<br />
• для создания ниточек использовать инструмент (Линия от руки)<br />
<b> </b><br />
<b> </b><br />
<b>контрольные вопросы:</b><br />
<b> </b><br />
1 .Какой основной выделяющий инструмент применяется в Corel DRAW ?<br />
<ol>
	<li>Что необходимо сделать для выделения всех объектов?</li>
	<li>Что необходимо сделать для изменения оттенка выбранного цвета объекта?</li>
</ol>

                    </strong>
                 </p>
                
              </tab-pane>
              <tab-pane class="text-color">
                <template slot="label">
                  ЛПЗ №3
                </template>
                <p class="blockquote blockquote-primary">
                  <strong><strong class="name">Инструкционно - технологическая карта к теме урока:</strong><br />
                  «Копирование, дублирование и клонирование объектов»<br />
                  программа Corel DRAW<br />
                  Копирование свойств объекта<br />
<img src="img/img-126.png" ><br />
<b>Задание 1: нарисовать несколько кружек</b><br />
<ol>
	<li>Создать новый документ CorelDraw.</li>
	<li>Установить альбомную ориентацию страницы, нажав для этого на панели параметров кнопку landscape (Альбомная) .</li>
<img src="img/img-127.png" ><br />
  <li>Построить кружку. Для этого:</li>
а) нарисовать вытянутый по вертикали прямоугольник со скругленными нижними вершинами. Для этого на панели параметров инструмента отжать кнопку (Скруглить все углы вместе) и задать параметры скругления.<br />
б) закрасить фигуру градиентной пользовательской заливкой, выбрав цвета по желанию<br />
	<li>Нарисовать ручку кружки. Для этого:</li>
а) построить дугу с помощью инструмента Ellipse Tool (Эллипс);<br />
б) увеличить толщину ручки с помощью инструмента Outline Tool<br> (Контур)<br />
в) закрасить ручку с помощью щелчка правой кнопкой мыши на выбранном цвете<br> палитры;<br />
г) поместить ручку на задний план — выбрать инструмент Picк Too1 (Указатель), выделить ручку и нажать комбинацию клавиш &lt;Ctrl + PageDown&gt;.<br />
	<li>Сгруппировать полученный рисунок. Для этого выбрать инструмент Picк Tool (Указатель) выделить все элементы рисунка и нажать на панели параметров кнопку Group (Сгруппировать)</li>
	<li>Сделать копию кружки. Для этого при выделенной кружке на дополнительной клавиатуре нажать клавишу &lt;+&gt;.</li>
	<li>Повернуть вторую кружку по горизонтали. Для этого нажать на панели параметров кнопку Mirror Buttons (Кнопки зеркального отражения).</li>
	<li>Изменить цвет ручки кружки. Для этого, удерживая клавишу&lt; Ctrl&gt;, выделить ручку и выбрать цвет в палитре цветов правой кнопкой мыши.</li>
	<li>Изменить цвет кружки. Для этого:</li>
а) выделить кружку без ручки щелчком мыши при удерживаемой клавише &lt;Ctrl&gt;,<br />
б) выбрать инструмент Interactive Fill Tool (Интерактивная заливка);<br />
в) изменить цвет крайних маркеров .<br />
10.Поместить новую кружку позади первой, нажав па панели парамет­ров кнопку То Васк (Назад).<br />
	<li>Сделать еще одну копию кружки, изменить ее цвет и уменьшить. 12.Выделить все объекты (клавиши &lt;Ctrl + А&gt;) и сгруппировать</li>
</ol>
(клавиши &lt;Ctrl + G&gt;).<br />
 Сохранить файл под именем кружки<br />
 <b>Задание 2: нарисовать салфетку</b><br />
<img src="img/img-128.png" ><br />
<ol>
  <li>Создать новый документ</li>
	<li>Построить большой круг, затем маленький так, чтобы он пересекал большой.</li>
	<li>Сместить у маленького круга центр вращения в центр вращения большого. Для этого выбрать инструмент Иск Tool (Указатель), дважды щелкнуть по маленькому кругу и переместить его центр в центр большого круга .</li>
  <li>Сделать 11 копий маленького круга с поворотом на 30°. Для этого выделить маленький круг и повторять следующие действия: нажать на дополнительной клавиатуре &lt;+&gt;, ввести в поле Angl Rotation (Угол поворота) поочередно углы поворота (30, 60, 90, 120, 150, 180, 210, 240, 270,300,330).</li>
	<li>Выделить все круги и объединить, нажав кнопку Weld (Объединение).</li>
	<li>Вставить в основу символ сердечка. Для этого выполнить команду меню <b>Text</b></li>
► <b>Insert Symbol Character</b> (Текст ► Вставить символ), в появившемся докере в списке <b>Font</b> (Шрифт) выбрать Webdings, в открывшемся списке указать на символ сердечко и нажать кнопку <b>Insert</b> (Вставить).<br />
	<li>Создать для вставленного символа 11 копий, размещая их по кругу.</li>
	<li>Вставить символ цветка. Для этого в докере <b>Insert Character</b> в списке <b>Font</b> (Шрифт) выбрать гарнитуру шрифта <b>Wingdings</b>, в появившемся списке указать па темный символ • и нажать кнопку <b>Insert</b> (Вставить). Поместить цветок по центру большого круга</li>
	<li>Сгруппировать все мелкие фигуры. Для этого нажать клавиши Ctrl+A удерживать клавишу Shift и щелкнуть по большой фигуре с выступами для исключения ее из выделенных объектов. При этом на строке состояния будет написано 25 объектов выделено на слое Нажать клавиши Ctrl+G.</li>
  <li>резать мелкие объекты из основы салфетки. Для этого выделить все Ctrl+A, выполнить команду меню Arrange - Shapinрядочить- взаимодействие - исключение)<li>
  <li>Закрасить полученную салфетку любым цветом.<li>
	<li>сохранить файл под именем салфетка.</li>
</ol>
<img src="img/img-129.png" ><br />
<b>Контрольные вопросы:</b><br />
<ol>
  <li>Какой станет заливка объекта при выборе пункта Copy Fill Here?<li>
	<li>При выборе какого пункта изменится цвет контура объекта?</li>
	<li>При выборе какого пункта изменяется цвет, толщина и тип заливки объекта?</li>
	<li>Чем отличается процесс дублирования от копирования?</li>
</ol>

                  </strong>
                </p>
              </tab-pane>

              <tab-pane class="text-color">
                <template slot="label">
                  ЛПЗ №4
                </template>
                <p class="blockquote blockquote-primary">
                  <strong><strong class="name">Содержание работы:</strong>
                  <b>Инструкционно-технологическая карта к уроку: "Работа с текстом"</b>
                  <ol>
<li>Запустите программу Corel Draw<br> <b>Пуск – Программы – </b><b>Corel</b><b> Draw</b></li>
<li>Задайте новое имя открытой странице <b>Фигурный текст.</b></li>
<li>Познакомимся с приемами создания блоков фигурного текста, а также с приемами форматирования их содержимого.<br> Выберите в наборе инструментов инструмент <b>Текст</b> и щелкните в левом верхнем углу страницы. В месте щелчка появится вертикальная черточка - текстовый курсор. На панели атрибутов выберите гарнитуру, содержащую символы кириллицы (например, Arial), установите кегль 48 и введите с клавиатуры следующий текст, разделяя строки нажатием клавиши Enter.</li><br />
А. С. Пушкин<br />
Я памятник себе воздвиг нерукотворный,<br />
К нему не зарастет народная тропа,<br />
Вознесся выше он главою непокорной<br />
 Александрийского столпа.<br />
Нет, весь я не умру — душа в заветной лире<br />
Мой прах переживет и тленья убежит,<br />
И славен буду я, доколь в подлунном мире<br />
 Жив будет хоть один пиит.<br />
Слух обо мне пройдет по всей Руси великой,<br />
И назовет меня всяк сущий в ней язык,<br />
И гордый внук славян, и финн, и ныне дикой<br />
 Тунгус, и друг степей калмык.<br />
И долго буду тем любезен я народу,<br />
Что чувства добрые я лирой пробуждал,<br />
Что в мой жестокий век восславил я Свободу<br />
 И милость к падшим призывал.<br />
��еленью божию, о муза, будь послушна.<br />
Обиды не страшась, не требуя венца,<br />
Хвалу и клевету приемли равнодушно<br />
 И не оспаривай глупца.<br /><br /><br />
<li>Теперь вставим в текст специальный символ. Установите текстовый курсор в конец всего текста. Выберите в меню <b>Текст- Вставить символ. </b>В раскрывающемся списке выберите название гарнитуры Webdings и в расположенной ниже палитре найдите следующее изображение¨.</li>
<li>Выделите произвольно выбранные части текста мышью, измените их кегли и гарнитуры. Проверьте, какое влияние на фигурный текст кнопки режимов выравнивания. Воспользуйтесь диалоговым окном форматирования для установки значения интерлиньяжа равным 120% от кегля.</li>
<li>Вставьте новую страницу. Присвойте имя: <b>Простой текст.</b></li>
<li>Познакомимся с приемами работы с простым текстом.<br> Выберите инструмент <b>Текст, </b>постройте в верхней части страницы блок простого текста произвольных размеров и перейдите в диалоговое окно <b>Редактирование текста, </b>щелкнув на соответствующей кнопке панели атрибутов.</li>
<li>Выберите гарнитуру Arial и введите текст, разбивая его на абзацы нажатием клавиши Enter.</li><br />
С. Есенин<br />
МЫСЛИ<br />
Мысли печальные, мысли глубокие,<br />
Горькие мысли, мысли тяжелые,<br />
Мысли от счастия вечно далекие,<br />
Спутники жизни моей невеселые!<br />
Мысли — родители звуков мучения,<br />
Мысли несчастные, мысли холодные,<br />
Мысли — источники слез огорчения,<br />
Вольные мысли, мысли свободные!<br />
Что вы терзаете грудь истомленную,<br />
Что заграждаете путь вы мне мой?<br />
Что возбуждаете силу сломленную<br />
Вновь на борьбу с непроглядною тьмой?<br />
Не поддержать вам костра догоревшего,<br />
Искры потухшие... Поздно, бесплодные.<br />
Не исцелить сердца вам наболевшего,<br />
Мысли больные, без жизни, холодные!<br /><br /><br />
<li>По завершении ввода закройте диалоговое окно <b>Редактирование текста.</b></li>
<li>Задайте гарнитуры и кегли для отдельных абзацев.</li>
<li>Устанавливая текстовый курсор в абзацы заголовков, задайте параметры буквиц. Для этого вначале щелкните на кнопке панели атрибутов с изображением буквицы, а затем откройте диалоговое окно форматирования. Перейдя на вкладку эффектов, установите желаемую высоту буквицы</li>
<li>Постройте цепочку связанных рамок простого текста. Цепочку стройте, «заряжая» указатель инструмента <b>Выбор</b> щелчком на нижнем индикаторе последней рамки цепочки (рис.1).</li>
</ol>

                  </strong>
                </p>
              </tab-pane>

               <tab-pane class="text-color">
                <template slot="label">
                  ЛПЗ №5
                </template>
                <p class="blockquote blockquote-primary">
                  <strong><strong class="name">Инструкционно-технологическая карта</strong><br />
                  <b>к  уроку по теме: «Палитра цветов. Типы заливки»</b><br />
Чтобы создать шестеренку, надо открыть Corel Draw и построить многоугольник со столькими гранями, сколько у вас будет зубчиков на шестеренке. Добавлять зубчики можно и на следующих этапах, пока не переведете шестеренку в кривые.<br />
<img src="img/img-224.png" ><br />
Добавим два узла на любую грань.<br />
<img src="img/img-225.png" ><br />
Передвинем узлы до необходимого результата<br />
<img src="img/img-226.png" ><br />
Заливаем шестеренку нужным цветом<br />
<img src="img/img-227.png" ><br />
Добавим немного деформации<br />
<img src="img/img-228.png" ><br />
Выдавим для придания объема<br />
<img src="img/img-229.png" ><br />
Теперь осветим, добавив эффект как на картинке<br />
<img src="img/img-230.png" ><br />
Копипастим торец нашей шестерни и немного изменим заливку, добавив эффекта<br />
<img src="img/img-231.png" ><br />
Если приложить  старания, можно добиться и такого результата<br />
                  </strong>
                </p>
              </tab-pane>
              <tab-pane class="text-color">
                <template slot="label">
                  ЛПЗ №6
                </template>
                <p class="blockquote blockquote-primary">
                  <strong><strong class="name">Инструкционно-технологическая карта</strong><br />
                  <b>к  уроку по теме: «Использование графического редактора в оформлении документов»</b>
Рисуем здания в Corel Draw<br />
<img src="img/img-212.png" ><br />
<ol>
	<li>Используя Rectangle Tool (клавиша F6), рисуем 3 прямоугольника, заливая разными оттенками</li>
<img src="img/img-213.png" ><br />
  <li>Группируем их, выделяя и нажимая ctrl+G. Теперь переходим по Effects -&gt; Add Perspective.</li>
<img src="img/img-214.png" ><br />
  <li>Делаем разную высоту зданий. Разгруппировываем их, передвигаем объекты вниз-вверх по высоте.</li>
<img src="img/img-215.png" ><br />
	<li>Применяем инструмент Interactive Extrude Tool с настройками по умолчанию. Тянем мышью объекты вниз.</li>
Если хотите соблюсти перспективу, потяните средний объект вниз ровно, а остальные к центру и вниз.<br />
<img src="img/img-216.png" ><br />
	<li>Преображаем эффект в объекты путем Arrange -&gt; Break Extrude Group Apart и потом Ungroup для каждого объекта. Получаем девять прямоугольников.<br>
  <li>Заливаем темным цветом фасад, стены заливаем светлым.</li>
<img src="img/img-217.png" ><br />
	<li>Делаем окна зданиям. Применяя Rectangle tool и Shape tool (клавиша F10), рисуем разные окна, дублируем необходимое количество раз.</li>
После копирования, используйте Edit -&gt; Dublicate (сочетание ctrl+D), чтобы копировать равномерно<br />
<img src="img/img-218.png" ><br />
	<li>Объединяем группу окон в объект путем Arrange -&gt; Combine (сочетание ctrl+L). Необходим Add Perspective эффект, искажающий окна и вписывающий их в здание</li>
<img src="img/img-219.png" ><br />
	Вот и получились наши здания. Осталось добавить тени при помощи Interactive Transparency Tool.<br>
  <li>Копируем прямоугольники, ставим сверху исходных. Располагаем при помощи ctrl+PgUp/PgDn (Arrange -&gt; Order) за окнами.</li>
  <li>Применяем Interactive Transparency Tool потянув вверх.</li>
<img src="img/img-220.png" ><br />
	<li>Выделяем все окна и заливаем градиентом (клавиша F11):</li>
<img src="img/img-221.png" ><br />
	<li>Используя Freehand tool, рисуем прямоугольники на крышах, потом заливаем и убираем обводку.</li>
<img src="img/img-222.png" ><br />
	<li>Перспективное расстояние будет прямиком зависеть от толщины линий объекта.</li>
<img src="img/img-223.png" ><br />
</ol>

                  </strong>
                </p>
              </tab-pane>
              <tab-pane class="text-color">
                <template slot="label">
                  ЛПЗ №7
                </template>
                <p class="blockquote blockquote-primary">
                  <strong><strong class="name"></strong>
                  Задание 1. Нарисуйте схему, предоставленную на рисунке<br />
                  <img src="img/img-193.png" ><br />
                  <b>Шаг 1.</b> Выберите инструмент «Прямоугольник » из панели инструментов. Чтобы нарисовать прямоугольник, перетащите указатель в пределах нужной области:<br />
                  <img src="img/img-194.png" ><br />
                  <b>Шаг 2.</b> Выберете элемент «Круг», на панели свойств выберите «Дуга» <br />
                  <img src="img/img-195.png" ><br />
                  Чтобы изменить форму эллипса, выберите инструмент «Форма»<br />
                  составьте их как показано на рисунке.<br />
                  <b>Шаг 3.</b> С помощью инструмента «Прямая через 2 точки»<br />
                  <img src="img/img-196.png" ><br />
                  соедините линиями элементы схемы как показано на рисунке. Для этого щелкните там, где требуется начать линию, а затем перетащите указатель, чтобы нарисовать ее.<br />
                  <b>Шаг 4.</b> С помощью инструмента «Текст  » подпишите элементы схемы. Для этого перетащите указатель для создания рамки простого текста.<br />
                  <img src="img/img-197.png" ><br />
                  Появится рамка, указывающая, где можно вводить текст.<br />
                  <img src="img/img-198.png" ><br />
                  
                  </strong>
                </p>
              </tab-pane>

              <tab-pane class="text-color">
                <template slot="label">
                  ЛПЗ №8
                </template>
                <p class="blockquote blockquote-primary">
                  <strong><strong class="name">Инструкционно-технологическая карта</strong><br />
                  <b>к  уроку по теме: «Приёмы создания простейших объектов»</b>
<img src="img/img-199.png" ><br />
<ol>
	<li>Создадим документ</li>
	<li>Выберем &quot;Эллипс&quot;</li>
	<li>Зажимая Ctrl для сохранения пропорций, создаем эллипс, который будет внутренним радиусом нашей детали.</li>
	<li>Теперь жмем &quot;+&quot; , что клонирует наш эллипс, который затем уменьшим, удерживая клавишу Ctrl. Вот и готова &quot;дырка&quot; в детали.</li>
<img src="img/img-200.png" ><br />
  <li>Перетащим начало координат в середину документа, зажав соответствующую кнопку</li>
<img src="img/img-201.png" ><br />
  Создаем направляющие, перетаскивая пунктирные линии на документ, и задаем нулевые координаты по рисунку:<br />
<img src="img/img-202.png" ><br />
  <li>Теперь задаем нулевые координаты кругам таким же способом.</li>
	<li>Создадим прямоугольник соответствующим элементом. Это будет наш 0 по оси Х.</li>
<img src="img/img-203.png" ><br />
  Прямоугольник будет зубом шестеренки.<br />
	<li>Зажав Ctrl, выделим малый круг и прямоугольник, затем нажав &quot;Пересечение&quot;:</li>
<img src="img/img-204.png" ><br />
  Удалим прямоугольник. То, что осталось, переносим зажав Shift к границам внешнего круга.<br />
<img src="img/img-205.png" ><br />
  <li>Придадим зубу нужный размер, зажав Shift и растянув края.</li>
	<li>Займемся остальными зубьями. Выделяем зуб и в меню жмем «Поворот».</li>
<img src="img/img-206.png" ><br />
  Угол поворота 40 градусов (1), центр – 0:0 в координатах (2). Применяем к копии (3) необходимое количество раз (4).<br />
<img src="img/img-207.png" ><br />
	<li>Выделим получившиеся зубья, а также большой круг, объединив их в элемент с помощью Ctrl+L</li>
	<li>Вырежем дырку. Для этого выделим большой и малый круг и нажмем &quot;Заднее минус переднее&quot;</li>
<img src="img/img-208.png" ><br />
</ol>
Вот и готова шестеренка. Придаем ей объем.<br />
В меню &quot;Эффекты&quot; щелкаем по &quot;интерактивное выдавливание&quot;.<br />
Зальем нужным цветом и повернем.<br />
<img src="img/img-209.png" ><br />
Теперь балуемся с освещением (1), цветом (2), скосом (3), а также камерой выдавливания (4).<br />
<img src="img/img-210.png" ><br />
Получается такая красота:<br />
<img src="img/img-211.png" ><br />
                  </strong>
                </p>
              </tab-pane>
 <tab-pane class="text-color">
                <template slot="label">
                  ЛПЗ №9
                </template>
                  <p class="blockquote blockquote-primary">
                    <strong><strong class="name">Делаем чертеж в CorelDRAW  с нанесением размеров как на уроке черчения</strong><br />
<b>Делаем чертеж в CorelDRAW X3 с нанесением размеров</b> как на уроке черчения. Работа не сложная. Часто на работе просили сделать чертежи различных деталей. Будет показана работа с линиями. Главная задача состоит в том, чтобы представлять себе деталь в трех видах. Уровень: средний<br />
1) Создайте рабочую область А4 формата.<br />
<img src="img/img-167.png" ><br />
2) Нарисуйте прямоугольник размером 100 х 60 мм.<br />
3) Теперь создайте прямую. Её размер должен быть чуть больше прямоугольника. Включите привязки.<br />
4) Теперь создайте эллипс (круг) размером 40 х 40 мм.<br />
5) Выровняйте его по правому верхнему краю.<br />
<img src="img/img-168.png" ><br />
6) Теперь созданную ранее прямую выровняйте по центру эллипса.<br />
<img src="img/img-169.png" ><br />
7) Теперь скопируйте круг с размером 40 х 40 мм и измените его размеры на 30 х 30 мм.<br />
<img src="img/img-170.png" ><br />
8) Эллипс с диаметром 30 мм выровняйте по левому краю.<br />
9) Теперь поставьте шаг 10 единиц и сместите эллипс в право.<br />
10) Выделите эллипс с размером 30 х 30 мм и сделайте дубликат.<br />
11) Теперь поместите в эллипс 40 х 40 мм наш дубликат с размером 30 х 30 мм.<br />
<img src="img/img-171.png" ><br />
12) Теперь к левому эллипсу примените эффект контур. Сделайте во внутрь эллипс с смещением в 10 единиц.<br />
13) Теперь залейте заливкой части нашей формы. Поставьте прямую на углы (начало окружностей). Протяните её вправо. Части фигуры объедините.<br />
<img src="img/img-172.png" ><br />
14) Возьмите прямоугольник за объектом и переместите как виды чертежей вниз и вправо.<br />
15) Расстояние между прямоугольниками должно быть 60 мм.<br />
<img src="img/img-173.png" ><br />
16) Теперь нарисуйте профильную часть вида.  Форма у вида квадратная 60 х 60 мм. Слева и справа расположены прямоугольники. Они выровнены по краям.<br />
<img src="img/img-174.png" ><br />
17) Создайте прямоугольник 60 х 60 мм и расположите его между видами. Заблокируйте квадрат.<br />
<img src="img/img-175.png" ><br />
18) Теперь создайте вид сверху. В прямоугольнике с размером 100 х 60 мм находятся 2 фигуры. Фигурами являются 2 прямоугольника с размерами 100 х 15 мм. Прямоугольники выровнены по краям.<br />
<img src="img/img-176.png" ><br />
19) Проведите вспомогательные линии. Используйте привязки.<br />
<img src="img/img-178.png" ><br />
20) Теперь уберите лишние линии и залейте форму с помощью интеллектуальной заливки.<br />
<img src="img/img-179.png" ><br />
21) Теперь залейте все части вида сверху заливкой.<br />
<img src="img/img-180.png" ><br />
22) Залейте части фронтального вида.<br />
<img src="img/img-181.png" ><br />
23) Теперь проведите линии от округлой поверхности на фронтальном виде к профильному виду.<br />
<img src="img/img-182.png" ><br />
24) Залейте нужные части заливкой.<br />
25) Теперь нарисуйте прямую по длине 110-120 мм. Щелкните в правом нижнем углу. В меню цвет абриса выберите штрихпунктирную линию.<br />
<img src="img/img-183.png" ><br />
26) Выберите в меню перо абриса изменение стиля линии. Постарайтесь сделать побольше точку и расширить расстояние между частями. Потом нажмите кнопку заменить.<br />
<img src="img/img-184.png" ><br />
27) Теперь продублируйте штрихпунктирные линии. Расставьте их в нужных местах согласно картинке слева.<br />
<img src="img/img-185.png" ><br />
28) Теперь поработайте с линиями. Задайте линиям толщину в 0,5 мм. Толщину задаете только нашим объектам (их очертаниям).<br />
29) Выберите инструмент размерная линия.<br />
<img src="img/img-185.png" ><br />
30) Вы задаете размеры от края  к краю.<br />
<img src="img/img-186.png" ><br />
31) Выберите направление измерения.<br />
<img src="img/img-187.png" ><br />
32) Когда поставите размер измените представление информации. Цифры должны отображаться целыми числами.<br />
<img src="img/img-188.png" ><br />
33) Поставьте расположение цифр выше линии.<br />
<img src="img/img-189.png" ><br />
34) Там где радиус с помощью кривых Безье проведите линию с поворотом. Выделите линию и выберите в нижнем правом углу цвет абриса и дважды щелкните по нему.<br />
<img src="img/img-190.png" ><br />
35) В меню выберите наконечник.<br />
36) Чтобы сделать стрелочку по центру прямой нужно сверху с помощью привязок создать еще 1 прямую. Для неё тоже нужно задать наконечник.<br />
<img src="img/img-191.png" ><br />
37) Расставьте размеры согласно рисунку.<br />
38) Вы можете покрасить в определенные цвета объекты.<br />
39) Если распечатаете на принтере это изображение, то его можно перенести на бумагу при помощи перекалывания.<br />
40) Вот такой результат должен получиться<br />
<img src="img/img-192.png" ><br />
                    </strong>
                 </p>
              </tab-pane>
              <tab-pane class="text-color">
                <template slot="label">
                  ЛПЗ №10
                </template>
                <p class="blockquote blockquote-primary">
                  <strong><strong class="name">Творческая работа по оформлению буклетов и рекламных проспектов</strong>
<b>к уроку по теме: «Творческая работа по оформлению буклетов и рекламных проспектов»</b><br />
Светодиод - урок Corel DRAW<br />
<img src="img/img-235.png" ><br />
<i>Из чего состоит светодиод? Основными его элементами являются прозрачная или матовая линза, в которую вплавлены две ножки – катод и анод. На одной из этих ножек внутри диода имеется расширение, напоминающее флажок, из которого исходит свет. Мы будем рисовать оранжевый полупрозрачный светодиод цилиндрической формы. В последствие цвет, естественно, можно будет изменить.</i><br />
<ol>
	<li>Откройте Corel DRAW и создайте новый документ. Элементы диода будем создавать один за другим, используя только векторные инструменты Corel. Для начала сделаем линзу – основную часть диода. Для этого <b>нарисуйте круг небольшого размера.</b> Чтобы рисовать круг, выберите соответствующий инструмент на левой панели или нажмите <b>Этот инструмент рисует эллипс, чтобы рисовать ровный круг, нужно нажать Ctrl</b> и не отпускать его во время рисования. После того, как нарисовали круг, окрасьте его в оранжевый цвет. <i>Чтобы не задавать каждый раз цвет еще и для контура, желательно отключать контуры объектов, нажимая в палитре справа на перечеркнутый крестом белый квадратик <b>правой</b> кнопкой мыши.</i></li>
	<li>Нарисовав круг, мы сделали верхнюю часть линзы. Теперь нужно продолжить ее вниз, создавая цилиндр, т.е. светодиод должен напоминать половинку пилюли. <b>Продолжить линзу можно, используя оранжевый квадрат.</b> Но нужно нарисовать квадрат так, чтобы по ширине он был как круг и начинался от середины этого круга. <i>Для этого сначала нужно включить привязки к объектам. Это такая вещь, которая помогает автоматически установить позицию при подведении одного объекта к другому, на основе углов, узлов, середин линий, границ и середин обоих объектов. Чтобы включить эту функцию, нажмите <b>Увидеть, что привязки включены, можно, водя курсором по центру и краям нашего круга когда он выделен, - при этом должны появляться мелкие надписи типа </b>«<b>по центру</b>», «<b>квадрант</b>», «<b>край</b>»:</i></li>
<img src="img/img-236.png" ><br />
  <li><b>Рисуем квадрат.</b> Для этого выбираем инструмент на левой панели или жмем <b>F6</b>. Так же как и с кругом, чтобы нарисовать ровный квадрат, держим <b>Ctrl</b> во время рисования. Итак, держим Ctrl нажатой, подводим курсор к самому левому краю круга, чтобы появилось маленькое слово <b><i>квадрант</i></b>, затем нажимаем левую кнопку мыши (не отпускаем) и тянем до правого края, пока и там не появится слово <b><i>квадрант</i></b>, потом отпускаем мышь и <b>Выглядит это так:</b></li>
<img src="img/img-237.png" ><br />
  <li><i>Надеюсь, Вы заметили, что курсор сам стремился присоединиться к краям круга, в этом и есть смысл привязок.</i> <b>Отмените привязки, опять нажав на Alt+Z, как и в случае их вызова.</b> Теперь <b>раскрасьте квадрат в оранжевый</b>. Для стеклянной линзы диода осталось нарисовать основание внизу, представляющее собой шляпку, которая на рисунке будет иметь вид прямоугольника, немного выступающего влево и вправо. Чтобы рациональнее и быстрее это сделать, <b>совершим копирование квадрата. Выделите квадрат и нажмите «</b><b>+»</b>, появится новый квадрат, который будет находиться там, где и прежний, но поверх него. Теперь <b>нажмите и не отпускайте Shift, и расширьте новый квадрат, оттягивая за черный квадратик вправо</b>:<br />
<img src="img/img-238.png" ><br />
  Потом потяните за верхний черный квадратик вниз, пока квадрат не отразится и не превратится в прямоугольник под светодиодом:<br />
<img src="img/img-239.png" ><br />
  В итоге получится такая шляпка основания:<br />
<img src="img/img-240.png" ><br />
  Выделите весь диод и объедините его элементы, нажав на кнопку <b>Обьединить</b> на верхней панели Corel DRAW:<br /></li>
<img src="img/img-241.png" ><br />
  <li>Корпус светодиода стал неразрывным и приобрел общие черты. Теперь дело за ножками, свечением и бликами. <b>Ножки делаются из двух прямоугольников, нарисуйте их как у меня на первом изображении:</b></li>
<img src="img/img-242.png" ><br />
  На втором показано, как выделить только два этих прямоугольника, не выделяя диод – <b>держите Alt и выделяйте, не касаясь корпуса диода.</b> На третьем изображении показан результат вырезки верхнего (по глубине) прямоугольника из нижнего. Это делается кликом в верхней панели Corel на кнопке <b>Задние минус передние</b>:<br />
<img src="img/img-242.png" ><br />
  <li>
    <i>Теперь нужно разъединить катод с анодом, т.е. ножки светодиода, и заодно придать им форму внутри линзы</i>. Разъединить их можно линией с последующим применением той же кнопки <b>Задние минус передние</b> из верхней панели. Нарисуйте ломаную линию толщиной как ножка диода, как на рисунке:<br />
<img src="img/img-243.png" ><br />
    Для рисования лини используем инструмент <b>Свободная форма (</b><b>F5)</b><br />
<img src="img/img-244.png" ><br />
    Сначала делаем клик в начале линии, потом удерживая <b>Ctrl</b>, проводим вертикальную линию, из конца которой, также удерживая <b>Ctrl</b>, проводим линию наискосок. В правом верхнем углу указываем толщину, примерно равную толщине ножек диода:<br />
<img src="img/img-245.png" ><br />
    <b>Чтобы применить операцию вырезки к линии и ножкам, нужно конвертировать линию в объект,</b> т.к. Corel DRAW игнорирует толщину линий при совершении подобных операций. Просто <b>нажмите Ctrl+Shift+Q</b> при выделенной линии, или то же самое можно сделать через главное меню: Пункт <b>Упорядочить / Преобразовать абрис в объект.</b><br />
    <b>Нажав Shift и не снимая выделение с ломаной линии, кликните по любой ножке диода где-нибудь внизу</b>, при этом выделятся и ножки, и линия, а корпус диода останется невыделенным. Осталось применить кнопку <b>Задние минус передние</b>, применяем. Ножки разъединились.<br />
    Можно нарисовать посреди них квадратики, как здесь:<br />
<img src="img/img-246.png" ><br />
    <b>Объедините квадратики с ножками.</b><br />
  </li>
  <li>
    <b>Закрасьте ножки светодиода белым или немного желтоватым цветом.</b> Чтобы создавался эффект освещения ножек, нужно книзу их утемнить, но не до черноты. Это делается копированием ножек (нажмите +) и применением к дубликату <b>интерактивной прозрачности</b>. <b>Залейте дубликат ножек черным цветом.</b><br />
    <i>Интерактивная прозрачность находится на левой панели Corel DRAW и представляет собой маленький бокал. Этот инструмент служит для создания постепенной прозрачности объекта в какую-либо сторону, т.е. например, слева объект непрозрачный, а ближе к правой стороне плавно становится прозрачным. Инструмент находится здесь:</i><br />
<img src="img/img-247.png" ><br />    
    <i>Чтобы вызвать дополнительное меню с инструментами на левой панели, задержите курсор нажатым на определенной кнопке. </i><br />
    Использовать инструмент легко – после выбора инструмента <b>подведите курсор на сантиметра 2 ниже ножек, нажмите левую кнопку мыши и не отпускайте, затем подведите курсор к основанию диода, теперь отпустите кнопку мыши.</b> Должно получиться так:<br />
<img src="img/img-248.png" ><br />   
    <i>Вы можете изменять прозрачность, таская за черный и белый квадратики появившейся растяжки. Можно будет и потом вызвать интерактивную прозрачность для выделенного объекта и отредактировать её.</i><br />
    <b>Чтобы объединить прозрачные ножки с оригинальными</b>, переходим в обычный режим (жмем стрелку Указатель, на панели инструментов), и зажимая <b>Alt-</b><b>Shift</b> кликаем по ножкам, после чего группируем (<b>Ctrl-</b><b>G</b>), <i>чтобы проверить можно подвигать ножки после чего отменить перемещение.</i><br />
  </li>
  <li>
    Сейчас нам нужно сделать темный фон, чтобы показать свечение, хотя объект будет красивым и на белом фоне, Вы потом это увидите. <b>Нарисуйте квадрат намного больше диода, и залейте его почти черным цветом.</b> Чтобы отправить квадрат на фоновой слой, <b>нажмите Ctrl+End</b> или несколько раз Ctrl+PageDown:<br />
<img src="img/img-249.png" ><br />
    <b>Чтобы квадрат фона не мешал</b> творчеству (он будет мешать выделять объекты, будет перетаскиваться и т.д.), <b>можно его заблокировать</b>. Нажмите при выделенном квадрате <b>на правую кнопку мыши</b>, и кликните в появившемся меню на пункт <b>Блокировать объект</b> с изображением маленького замочка.<br />
  </li>
  <li>
    <b>Скопируйте оранжевую линзу светодиода</b> (клавиша +) и переместите его куда-нибудь в сторону, потом он нам еще понадобится. <b>Далее делаем свечение</b>. Выделяем оранжевую линзу диода и на левой панели Corel выбираем инструмент <b>Тень</b>, там же, где и интерактивная прозрачность:<br />
<img src="img/img-250.png" ><br />    
    <b>Теперь жмем посередине оранжевого светодиода и немного двигаем курсор</b>, на миллиметры туда-сюда, под курсором должны появиться какие-то маленькие квадратики:<br />
<img src="img/img-251.png" ><br />    
    Посмотрите на верхнюю панель Corel DRAW, которая сейчас отвечает за настройки тени:<br />
<img src="img/img-252.png" ><br />    
    <i>Сейчас Вы можете не видеть тень, она черная на черном фоне. Но мы делаем не тень, а эффект свечения при ее помощи, поэтому нужно установить оранжевый цвет тени вместо черного, и установить нормальный режим наложения слоя, иначе даже изменив цвет, эффекта не добьетесь. Кроме того, тень очень маленькая и наполовину прозрачная</i>. <b>Чтобы настроить как нам требуется, смотрите скриншот, здесь показаны слева направо: видимость 100 %, размер размытия 50, наложение слоя нормальное (обычное), цвет тени оранжевый:</b><br />
<img src="img/img-253.png" ><br />    
    Вот собственно что должно у Вас получиться:<br />
<img src="img/img-254.png" ><br />  
  </li>
  <li>
    До этого <b>Вы сделали дубликат линзы диода</b>, пришло время к нему вернуться. Дальше эффекты будем делать на дубликате, чтобы свечение диода и его ножки не мешали, а потом перенесем эти эффекты на светодиод. Чтобы не запутаться, <b>я буду называть дубликат <u>диодом </u>или <u>светодиодом</u>, так как теперь мы работаем с ним.</b><br />
    <i>Сейчас будем создавать эффект, похожий на внутреннее свечение</i>.<br />
    <b>Выделите диод и нажмите «+» чтобы скопировать</b>.<br />
    <b>Окрасьте его в желтый</b>.<br />
    <i>Вокруг выделенного дубликата, как и вокруг любого выделенного объекта появляются квадратики масштабирования</i>. <b>Нажмите и не отпускайте Shift и потяните за правый верхний квадратик в сторону центра диода</b>, получится уменьшенный аналог диода, только желтый:<br />
<img src="img/img-255.png" ><br />      
    Выберем инструмент <b>Ластик</b> на левой панели, <b>или просто нажмем X</b>:<br />
<img src="img/img-256.png" ><br />      
    Резинка должна быть круглой и <b>размером 20 мм</b>, для этого на верхней панели нажмите на квадратик, чтобы он стал кружком, и введите 20 в поле ввода, показанное на рисунке:<br />
<img src="img/img-257.png" ><br />      
    <b>Сотрите выделенный желтый объект, чтобы остался серп вверху, как здесь:</b><br />
<img src="img/img-258.png" ><br />      
    <b>Переместите серп немного вверх</b>, но не до вершины оранжевого диода.<br />
    <b>Сделайте его полупрозрачным снизу, используя интерактивную прозрачность, как мы делали раньше (инструмент прозрачность):</b><br />
<img src="img/img-259.png" ><br />      
    <b>Сделайте опять желтый малый аналог диода</b>, точно такой же, как тот, из которого мы сделали серп и сровняйте его низ с низом диода, чтобы вверху между ним и серпом остался зазор:<br />
<img src="img/img-260.png" ><br />      
    <b>Нам нужно сделать этот объект по краям слева и справа прозрачным</b>, а в центре оставить нормальным. Растяните интерактивную прозрачность по объекту слева направо. Чтобы левая сторона была тоже прозрачной, нужно настроить градиент прозрачности. Он находится на верхней панели, самая левая кнопка с изображением бокала на фоне маленького системного окна:<br />
<img src="img/img-261.png" ><br />      
    После того, как появится диалог настроек градиента, переключитесь в нем с двухцветного режима на пользовательский (Настройка), и сделайте градиент как на рисунке, добавив двойным кликом посередине дополнительный цвет<br />
<img src="img/img-262.png" ><br />      
    То же самое можно сделать из <b>белого аналога диода</b>(скопировать сам диод, окрасить в белый, применить градиентную прозрачность), получив белый тонкий блик:<br />
<img src="img/img-263.png" ><br />      
    <b>В конце остается выделить полученный светодиод и перетащить его на заготовку с ножками, либо перетащить отдельные элементы бликов и изменить положение ножек чтобы они были под бликами и перед оранжевым фоном.</b><br />
    <i>Остальные элементы создаются по тем же принципам. Обводные линии внизу оранжевого светодиода созданы из обычных линий. Красноватый элемент в глубине диода тоже сделан из самого диода, серпообразные вырезы которого высечены стиральной резинкой большого диаметра. Диаметр стиральной резинки легко изменять, нажав Shift, левую клавишу мыши и тягая мышку вверх-вниз. Вот эти элементы в отдельности:</i><br />
<img src="img/img-264.png" ><br />     
    Если будут проблемы с выделением объектов, лежащих под другими объектами, то осуществить это можно, нажав Alt и несколько раз кликая по желаемому объекту, пока он не выделится. Отправлять объекты под другие можно сочетанием Ctrl+PageDown, а выставлять над другими – сочетанием Ctrl+PageUp.<br />
  </li>
</ol>
                  </strong>
                </p>
              </tab-pane>

              <tab-pane class="text-color">
                <template slot="label">
                  ЛПЗ №11
                </template>
                <p class="blockquote blockquote-primary">
                  <strong><strong class="name">Инструкционно-технологическая карта к уроку: “Творческая работа по составлению чертежей деталей”</strong><br />
Мы научимся рисовать конструкторский рисунок детали болта, который может пригодится нам, например, при создании какого либо чертежа и в работе. Итак, приступим...<br />
Болтовое соединение состоит из:<br />
· Болта.<br />
· Гайки.<br />
· Шайбы.<br />
· И двух пластин, которые соединены болтом.<br />
<img src="img/img-266.png" ><br />
Поскольку болт - это (вполне обыденная) техническая деталь (метиз), все размеры его (строго) регламентированы. Модулем (размером, от которого вычисляются все остальные размеры) является диаметр резьбы. Рисовать будем болт с диаметром М20 (метрическая резьба диаметром 20 мм), размеры которого согласно ГОСТ 12414-66 следующие.<br />
<img src="img/img-267.png" ><br />
<b>Рисуем головку болта.</b><br />
Инструментом &quot;Выделение&quot; устанавливаем направляющие:<br />
· Вертикальные - 80, 90, 100, 110 и 120 мм.<br />
· Горизонтальные - 154, 170 и 184 мм.<br />
<img src="img/img-268.png" ><br />
Инструментом &quot;Окружность&quot; (нажав и удерживая Shift и Crtl) рисуем (где-то рядом с направляющими) окружность произвольного диаметра.<br />
<img src="img/img-269.png" ><br />
Выделяем эту окружность инструментом &quot;Выделение&quot; и открываем докер &quot;Преобразования&quot; на вкладке &quot;Размер&quot;.<br />
<img src="img/img-270.png" ><br />
Устанавливаем размер 60 мм (следим, чтобы стояла галочка в окошке "Пропорционально").<br />
<img src="img/img-271.png" ><br />
Нажимаем "Применить". Окружность становится (с нужным) диаметром 60 мм.<br />
Переходим на вкладку "Положение".<br />
<img src="img/img-272.png" ><br />
И устанавливаем координаты центра окружности 100 (по вертикали) и 154 (по горизонтали).<br />
<img src="img/img-273.png" ><br />
Нажимаем "Применить". Окружность встает на место.<br />
<img src="img/img-274.png" ><br />
Инструментом "Прямоугольник" рисуем по внутренним вертикальным направляющим прямоугольник.<br />
<img src="img/img-275.png" ><br />
И инструментом "Интеллектуальная заливка"<br />
<img src="img/img-276.png" ><br />
заливаем нижнюю часть (создаем объект).<br />
<img src="img/img-277.png" ><br />
В ДО (диспетчер объектов) появляется новый объект. Называем его "сер" (средняя грань).<br />
<img src="img/img-278.png" ><br />
Объекты "Прямоугольник" и "Эллипс" нам больше не нужны. Выделяем их (в ДО) и удаляем (Delete).<br />
Инструментом "Выделение" устанавливаем дополнительную горизонтальную направляющую по верхним точкам объекта (до появления слова "узел").<br />
<img src="img/img-279.png" ><br />
Инструментом "Выделение" устанавливаем дополнительную вертикальную направляющую 85 мм.<br />
<img src="img/img-280.png" ><br />
Инструментом "Прямоугольник" рисуем прямоугольник слева от объекта "средняя грань".<br />
<img src="img/img-281.png" ><br />
Пока он выделен сразу преобразуем его в кривые - меню "Упорядочить" - "Преобразовать в кривую".<br />
<img src="img/img-282.png" ><br />
Инструментом "Форма" ("Фигура")<br />
<img src="img/img-283.png" ><br />
выделяем один из верхних углов прямоугольника<br />
<img src="img/img-284.png" ><br />
и делаем верхнюю сторону выгнутой.<br />
<img src="img/img-285.png" ><br />
Сторона еще (смотрится как) прямая, но у нее уже появились глифы (стрелки), которыми ее можно искривить.<br />
Берем эту сторону ЛКМ (левой кнопкой мыши) посередине (в точке пересечения с направляющей) и выгибаем ее вверх по направляющей.<br />
<img src="img/img-286.png" ><br />
В ДО этот объект называем "лв" ("левая грань").<br />
<img src="img/img-287.png" ><br />
Поскольку головка болта симметрична относительно центральной оси (направляющей) правую грань проще сделать так:<br />
· Скопировать левую грань.<br />
· И перенести копию направо, чтобы ее левая сторона шла вдоль вертикальной направляющей 110 мм.<br />
Копируем левую грань и тут же вставляем. Выделяем (инструментом &quot;Выделение&quot;) копию, переходим в докер &quot;Преобразования&quot; на вкладку &quot;Положение&quot;. В макете габарита устанавливаем галочку по левой стороне и в строке &quot;По горизонтали&quot; (верхняя) устанавливаем положение 110 мм.<br />
<img src="img/img-288.png" ><br />
Правая грань встала точно по месту.<br />
<img src="img/img-289.png" ><br />
В ДО этот объект называем "пр" ("правая грань").<br />
<img src="img/img-290.png" ><br />
Инструментом "Выделение" устанавливаем вертикальную направляющую по середине "правой грани".<br />
<img src="img/img-291.png" ><br />
И инструментом "Прямоугольник" рисуем прямоугольник по направляющим.<br />
<img src="img/img-292.png" ><br />
Здесь важно, что рисовать прямоугольник надо с верхнего левого угла (или правого верхнего), а нижняя сторона произвольна (в пределах высоты граней).<br />
В ДО этот прямоугольник называем "фаска" и помещаем его на самый низ.<br />
<img src="img/img-293.png" ><br />
Все объекты &quot;головки болта&quot; у нас готовы. Красим их. Красить будем (не мудрствуя лукаво) оттенками черного (в палитре вверху 10 оттенков). Предположим, свет падает справа сверху (я обычно беру такое освещение). Тогда распределение оттенков (по формуле тень - цвет - блик) будет следующее (от темного к светлому):<br />
· Левая грань - тень2. (Чем больше номер тени, тем она темнее).<br />
· Центральная грань - тень1.<br />
· Правая грань - цвет (в данном случае следующий по порядку более светлый оттенок).<br />
· Фаска - блик1. (Чем больше номер блика, тем он светлее. В данном случае у нас один блик).<br />
В ДО выбираем объект &quot;лв&quot; и красим его К50. Все черные оттенки в системе CMYK различаются разным количеством черного, т.е. К. Поэтому вполне достаточно указать только его. Чтобы увидеть состав оттенка надо навести курсор на цвет и немного подержать - появится рамочка с составом CMYK.<br />
Потом выбираем следующий по списку объект и заливаем следующим (более светлым) оттенком. И т.д.<br />
В ДО все объекты группируем, называем &quot;гол_болт&quot; (&quot;головка болта&quot;).<br />
<img src="img/img-294.png" ><br />
Удаляем обводки - щелкаем ПКМ (правая кнопка мыши) по ячейке с крестиком вверху палитры.<br />
<img src="img/img-295.png" ><br />
"Головка болта" готова.<br />
<img src="img/img-296.png" ><br />
Удаляем лишние (не нужные теперь) направляющие.<br />
<img src="img/img-297.png" ><br />
<b>Рисуем &quot;ножку болта&quot;.</b><br />
Инструментом &quot;Выделение&quot; выставляем две горизонтальные направляющие: 150 и 95 мм.<br />
<img src="img/img-298.png" ><br />
Инструментом "Прямоугольник" рисуем верхнюю часть "ножки" и красим ее линейной интерактивной заливкой (оттенки слева направо К90 - К20 - К50).<br />
<img src="img/img-299.png" ><br />
В ДО эту часть &quot;ножки&quot; называем &quot;врх&quot; (&quot;верх&quot;). Нижняя часть &quot;ножки&quot; будет &quot;резьба&quot;.<br />
<b>Рисуем &quot;резьбу&quot;.</b><br />
Резьба состоит из:<br />
· Цилиндра - &quot;внутреннего диаметра резьбы&quot; и<br />
· витков резьбы, которые накручиваются на цилиндр снаружи.<br />
Рисовать резьбу будем на другой странице. Для этого внизу в счетчике страниц создаем новую страницу и переходим на нее.<br />
Инструментом &quot;Выделение&quot; добавляем еще две вертикальные направляющие внутрь по 1 мм: 91 и 109 мм.<br />
<img src="img/img-300.png" ><br />
И по этим направляющим рисуем "внутренний диаметр резьбы" и красим его аналогично "верху", но (на один тон) темнее (К100 - К40 - К60).<br />
<img src="img/img-301.png" ><br />
В ДО называем его &quot;вну&quot; (&quot;внутренний диаметр резьбы&quot;).<br />
<b>Рисуем &quot;виток резьбы&quot;.</b><br />
К нижней горизонтальной направляющей добавляем еще три направляющие (через 1 мм): 94, 96 и 97 мм.<br />
<img src="img/img-302.png" ><br />
По внешним вертикальным направляющим инструментом "Кривая Безье" по точкам рисуем ломаную кривую.<br />
<img src="img/img-303.png" ><br />
Нажимаем кнопку F12 и переходим в докер &quot;Перо абриса&quot; (докер обводок). Задаем:<br />
· Толщину обводки 1 мм.<br />
· Цвет обводки - зеленый.<br />
· И обрезанные углы.<br />
<img src="img/img-304.png" ><br />
Нажимаем ОК.<br />
<img src="img/img-305.png" ><br />
Копируем и вставляем эту линию. Инструментом "Форма" удаляем крайние узы. Красим эту линию (остаток копии) в красный цвет.<br />
<img src="img/img-306.png" ><br />
Из меню "Упорядочить" - "Преобразовать абрис в объект" превращаем эту красную линию в объект и инструментом "Форма" добавляем на концах линии по 2 узла и правим по внешней направляющей и лежащей ниже зеленой линии.<br />
<img src="img/img-307.png" ><br />
<img src="img/img-308.png" ><br />
Так же и с другой стороны (зазубрину вниз). Зеленую линию удаляем. Красный отрезок называем в ДО "виток" и красим его интерактивной заливкой аналогично верхней части ножки (К90 - К20 - К50)<br />
<img src="img/img-309.png" ><br />
"Виток" должен быть немного светлее, чем "внутренний диаметр резьбы". Дополнительные (для построения) горизонтальные направляющие удаляем.<br />
Выделяем "виток" и из меню "Правка" вызываем докер "Шаг и повтор".<br />
<img src="img/img-310.png" ><br />
Устанавливаем в нем:<br />
•	Смещение по горизонтали - "без смещения".<br />
•	Смещение по вертикали - "смещение".<br />
•	И в нем "Расстояние" - 2 мм.<br />
•	Количество копий - 30.<br />
<img src="img/img-311.png" ><br />
Нажимаем "Применить".<br />
Получается 31 витков резьбы.<br />
<img src="img/img-312.png" ><br />
Докер "Шаг и повтор" закрываем.<br />
Смотрим на рисунок. Верхние три витка лишние. Их надо выделить в ДО и удалить. Верхний виток надо подправить инструментом "Форма", чтобы правая часть витка не вылезала за контур цилиндра.<br />
<img src="img/img-313.png" ><br />
Инструментом "Форма" подправляем по направляющим нижний виток.<br />
<img src="img/img-314.png" ><br />
<img src="img/img-315.png" ><br />
В ДО все "витки" группируем в группу "витки", располагаем эту группу выше объекта "вну" и, в свою очередь, группируем их. Называем эту группу "резьба".<br />
<img src="img/img-316.png" ><br />
И, наконец, на странице сборки (там, где у нас "головка болта") собираем все созданные объекты (группы):<br />
•	"резьба"<br />
•	"врх"<br />
•	"гол_болт"<br />
Группируем их в группу "болт".<br />
<img src="img/img-317.png" ><br />
В принципе, болт готов.<br />
<img src="img/img-318.png" ><br />
Но если присмотреться внимательно, то видно, что между отдельными объектами (группами): "головка болта" и "врх", "врх" и "резьба" видны волосяные линии. Особенно они заметны, например, на красном фоне.<br />
<img src="img/img-319.png" ><br />
Это незначительный, но все-таки брак изображения. Для того, чтобы от него избавиться, Надо под изображение подложить фон-подложку, контур которого совпадает с общим контуром изображения. И покрасить этот фон в какой-нибудь близкий изображению цвет (в нашем случае подойдет К50).<br />
Для этого копируем "болт" и переносим (вставляем) на другую (пустую) страницу. В ДО выделяем объект "витки" и удаляем их (чтобы у фона было не слишком много ненужных узлов). Остается такое изображение.<br />
<img src="img/img-320.png" ><br />
Выбираем в меню "Упорядочить" - "Формирование" - "Граница". Вокруг изображения появляется граница нового объекта.<br />
<img src="img/img-321.png" ><br />
Этот объект называем "фон", красим его К50,<br />
<img src="img/img-322.png" ><br />
переносим его на страницу сборки (где у нас болт с резьбой) и располагаем его ниж�� всех других объектов.<br />
<img src="img/img-323.png" ><br />
Вот теперь "болт" готов без всяких замечаний.<br />
<img src="img/img-324.png" ><br />
<b>Рисуем (соединяемые) пластины.</b><br />
Рисовать будем на новой пустой странице. (Можно оставить только страницу сборки, на которой &quot;болт&quot;. Остальные страницы промежуточных разработок болта удалить и снова сделать новую страницу.)<br />
Инструментом &quot;Выделение&quot; выставляем направляющие:<br />
· Горизонтальные - 170, 146 и 122 мм.<br />
· Вертикальные - 50, 89, 100, 111 и 150 мм.<br />
<img src="img/img-325.png" ><br />
Верхняя пластина состоит из собственно пластины и отверстия (вид сбоку). Рисуем их инструментом "Прямоугольник" (без всяких ухищрений) по направляющим.<br />
<img src="img/img-326.png" ><br />
В ДО объектов называем их "пл_врх" ("верхняя пластина") и "отв" ("отверстие"). Красим их:<br />
•	"пл_врх" - К60,<br />
•	"отв" - К80.<br />
Обводки удаляем и группируем в группу "пл_врх".<br />
<img src="img/img-327.png" ><br />
Точно также рисуем нижнюю пластину. Но красим чуть темнее:<br />
•	"пл_низ" - К70,<br />
•	"отв" - К90.<br />
Добавляем прямоугольник - общий фон. Помещаем его вниз и красим К80. Получаются такие пластины.<br />
<img src="img/img-328.png" ><br />
В ДО получается такая группа.<br />
<img src="img/img-329.png" ><br />
Всю эту группу переносим на страницу сборки (где болт) и размещаем ее ниже группы "болт".<br />
<img src="img/img-330.png" ><br />
Рисуем шайбу.<br />
Снова переходим на пустую страницу и выставляем направляющие:<br />
•	Горизонтальные - 122 (нижняя кромка нижней пластины) и 119 мм (толщина шайбы).<br />
•	Вертикальные - 78 и 122 мм (диаметр шайбы).<br />
<img src="img/img-331.png" ><br />
По пересечениям направляющих инструментом "Прямоугольник" рисуем прямоугольник, удаляем обводку, красим интерактивной заливкой (К90 - К40 - К70).<br />
<img src="img/img-332.png" ><br />
В ДО называем этот объект "шайба" и переносим его на страницу сборки. Помещаем выше всех других объектов (групп).<br />
<img src="img/img-333.png" ><br />
Рисуем гайку.<br />
Разметка гайки направляющими (на пустой странице).<br />
•	Горизонтальные - 119 (нижняя кромка шайбы) и 103 мм (толщина гайки).<br />
•	Вертикальные - 80, 90, 100 (центральная ось), 110 и 120 мм. (Вертикальные направляющие можно выставить по головке болта.)<br />
<img src="img/img-334.png" ><br />
Я рисовать гайку не буду, потому что она рисуется аналогично головке болта (см. выше).<br />
Разница лишь в том, что:<br />
•	У головки болта одна фаска (сверху), у гайки две (снизу и сверху).<br />
•	Раскраска гайки несколько темнее, чем головки болта (потому что она находится ниже).<br />
Должна получиться такая гайка.<br />
<img src="img/img-335.png" ><br />
Переносим ее на страницу сборки. Получается такая сборка.<br />
<img src="img/img-336.png" ><br />
Все объекты группируем в группу "болт".<br />
<img src="img/img-337.png" ><br />
Для завершения рисунка, инструментом "Прямоугольник" нарисуем прямоугольник 130 х100 мм. В ДО поместим его ниже группы "болт", назовем "фон", удалим обводку и закрасим в какой-нибудь светлый (бледный) цвет.<br />
<img src="img/img-338.png" ><br />
В ДО выделим группу "болт" и "фон" и нажмем на клавиатуре клавиши "Е" и "С". Это клавиши выравнивания выбранных объектов по горизонтали и вертикали.<br />
Рисунок принимает законченный вид.<br />
<img src="img/img-339.png" ><br />




                  </strong>
                </p>
              </tab-pane>

              <tab-pane class="text-color">
              <template slot="label">
                Вспомогательный раздел
              </template>
              <p class="blockquote blockquote-primary-new2">
                <strong><strong class="name"><a class="a-href" target="_blank" href="https://www.youtube.com/watch?v=76MTFWlnO10&list=PLBCEC87C0BCFD1220&index=1">Видеоуроки по CorelDRAW</a></strong></strong><br />
              </p>
                <p class="blockquote blockquote-primary-new2">
                  <strong><strong class="name">Для любознательных</strong><br /></strong>
                <img src="img/img-233.png" >
                <img src="img/img-234.png" ><br />
                </p>
                <p class="blockquote blockquote-primary-new2">
                <img src="img/RedPhoto/1.png" ><br />
                </p>
                <p class="blockquote blockquote-primary-new2">
                <img src="img/RedPhoto/2.png" ><br />
                </p>
                <p class="blockquote blockquote-primary-new2">
                <img src="img/RedPhoto/3.jpg" ><br />
                </p>
                <p class="blockquote blockquote-primary-new2">
                <img src="img/RedPhoto/4.jpg" ><br />
                </p>
                <p class="blockquote blockquote-primary-new2">
                <img src="img/RedPhoto/5.png" ><br />
                </p>
                <p class="blockquote blockquote-primary-new2">
                  <strong><strong class="name">Для творчества</strong><br />
                <img src="img/235.jpg" ><br />
                <img src="img/236.jpg" ><br />
                <img src="img/237.jpg" ><br />
                <img src="img/238.jpg" ><br />
                <img src="img/239.jpg" ><br />
                <img src="img/240.jpg" ><br />
                <img src="img/242.jpg" ><br />
                <img src="img/243.jpg" ><br />
                <img src="img/244.png" ><br />
                </strong>
              </p>
            </tab-pane>

          <tab-pane class="text-color">
            <template slot="label">
              Раздел контроля
            </template>
            <p class="blockquote blockquote-primary-new2">
              <strong><strong class="name"><a class="a-href" target="_blank" href="http://dolinin-infografika.narod.ru/download/instrumenty_coreldraw.htm">Тест по теме «Инструментарий CorelDraw»</a></strong></strong><br />
              <strong><strong class="name"><a class="a-href" target="_blank" href="https://testedu.ru/test/informatika/10-klass/corel-draw.html">Тест по теме "Работа с объектами в CorelDraw"</a></strong></strong><br />
              <strong><strong class="name"><a class="a-href" target="_blank" href="https://testserver.pro/run/test/CorelDRAW-X6/">Итоговый тест по теме "CorelDraw"</a></strong></strong><br />
            </p>
            <p class="blockquote blockquote-primary-new2" >
               <strong>
                 <div class="name-2">
                   <strong class="name">Онлайн тестирование</strong><br />
                 </div>
                    <iframe src="https://docs.google.com/forms/d/e/1FAIpQLSfCWGonRcT1VcQd1iZa7G3wr0tg2WcRb8YLhL6e04n6RsId4w/viewform" class="iframe" />
               </strong>
            </p>
            <p class="blockquote blockquote-primary-new2">
                <strong>
                  <div class="name-2">
                  <strong class="name" >Упражнение "Кроссворд"</strong>
                <iframe src="https://learningapps.org/watch?v=p3i3q9fo320" style="border:0px;width:100%;height:500px" webkitallowfullscreen="true" mozallowfullscreen="true"></iframe>
                  </div>
                </strong>
                </p>
                <p class="blockquote blockquote-primary-new2">
                <strong>
                  <div class="name-2">
                  <strong class="name" >Упражнение "Отсортировать картинки"</strong>
                <iframe src="https://learningapps.org/watch?v=p9ydw8yta20" style="border:0px;width:100%;height:700px" webkitallowfullscreen="true" mozallowfullscreen="true"></iframe>
                  </div>
                </strong>
                </p>
                <p class="blockquote blockquote-primary-new2">
                  <strong>
                    <div class="name-2">
                    <strong class="name">Упражнение "Вставить пропущенные слова"</strong>
                  <iframe src="https://learningapps.org/watch?v=pk001cwsk20" style="border:0px;width:100%;height:500px" webkitallowfullscreen="true" mozallowfullscreen="true"></iframe>
                    </div>
                  </strong>
                </p>
            <p class="blockquote blockquote-primary-new2">
                  <strong>
                    <div class="name-2">
                      <strong class="name">Соотнести</strong>
                        <iframe src="https://learningapps.org/watch?v=pxze4qwx320" style="border:0px;width:100%;height:700px" webkitallowfullscreen="true" mozallowfullscreen="true"></iframe>
                    </div>
                  </strong>
                </p>
          </tab-pane>

            </tabs>
			   </div>    
            </div>
            </div>
      	   </div> 
          </div>    
      </div>
        </div>
      </div>
    </div>
    </div>
</template>
<script>
import { Button, Tabs, TabPane } from "@/components";
import { Carousel, CarouselItem } from "element-ui";

export default {
  components: {
    [Button.name]: Button,
    [Carousel.name]: Carousel,
    [CarouselItem.name]: CarouselItem,
    Tabs,
    TabPane,
  },
};
</script>
<style scoped>
.text-color {
  color: black;
}
.name {
  font-size: 1.5rem;
}
.name-2 {
  text-align: center;
}
.checkbox-cell {
  height: 40px;
  display: flex;
  justify-content: center;
  align-items: center;
}
.typography {
  font-size: 24px;
}
.blockquote {
  padding: 20px;
  font-size: 1.3rem;
  line-height: 1.8;
}
.blockquote.blockquote-primary {
  color: black;
  border-color: black;
}
.blockquote.blockquote-primary-new {
  color: black;
  border-color: white;
}
.blockquote.blockquote-primary-new2 {
  color: black;
  border-color: rgb(23, 23, 172);
  border-width: 2px;
}
.typography-line {
  padding-left: 0%;
  margin-bottom: 0px;
  position: relative;
  display: block;
  width: 100%;
}
.tab-content.tab-content-padding {
  padding: 20px;
}
.container {
  max-width: 1600px;
}
.el-carousel__container {
  position: relative;
  height: 730px;
}
.card {
  margin-bottom: 0px;
}
.a-href {
  color: black;
}
.data-background-color {
  background-color: darkgreen;
}
.iframe {
  width: 100%;
  min-height: 100vh;
}
</style>