<template>
    <div class="page-header clear-filter">
      <div
        style="position: fixed; left: 0; top: 0; width: 100%; height: 100%; background-image: url('img/1.jpg'); max-height: 999px;"
      ></div>
<div class="container">
<h3 class="title">Тема 2. Информационная безопасность и уровни её обеспечения</h3>
  <div class="section section-tabs">
    <div class="container">
      <div class="row">
          <div class="card">
			  <div id="typography">
        	<div class="row">
          	<div class="col-md-12">
        	<div class="typography-line">
            </div>
        	<div class="typography-line">
              <blockquote>
            <tabs
              centered
              type="neutral"
              tab-nav-wrapper-classes="card-header"
              tab-content-classes="card-body"
              data-background-color="darkgreen"
            >
              <tab-pane class="text-color">
                <template slot="label">
                Теоретический раздел
                </template>

                <div class="row justify-content-center">
		<div class="col-8">
			<p class="blockquote blockquote-primary-new2">
          <el-carousel height="730px" arrow="always" :autoplay="false">
            <el-carousel-item>
              <img class="d-block" src="img/6/1.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/6/2.jpg" />
            </el-carousel-item>
             <el-carousel-item>
              <img class="d-block" src="img/6/3.jpg" />
            </el-carousel-item>
             <el-carousel-item>
              <img class="d-block" src="img/6/4.jpg" />
            </el-carousel-item>
             <el-carousel-item>
              <img class="d-block" src="img/6/5.jpg" />
            </el-carousel-item>
             <el-carousel-item>
              <img class="d-block" src="img/6/6.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/6/7.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/6/8.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/6/9.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/6/10.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/6/11.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/6/12.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/6/13.jpg" />
            </el-carousel-item>
          </el-carousel>
		</p>
        </div>
      </div>

                <p class="blockquote blockquote-primary-new2">
                <strong><strong class="name">Тема урока: «Информационная безопасность и уровни её обеспечения»</strong><br />
<b>Цели урока</b>:<br />
<b><u>Обучающая</u></b>: сформировать понятия о представления учащихся об информационной безопасности и уровнях её обеспечения<br />
<b><u>Развивающая: </u></b>способствовать развитию профессионального мышления<br />
<b><u>Воспитательная</u></b>: способствовать воспитанию положительного отношения к знаниям, сознательного отношения к труду<br />
<b>Материально-техническое оснащение</b>: компьютеры<br />
<b>Межпредметные связи</b>: математика<br />
<b>Оборудование: </b>компьютер учителя, мультимедийный проектор, компьютеры обучающихся<br />
<b>Тип урока</b>: лабораторно-практическая работа<br />
<b>Ход урока:</b><br />
<ol>
	<li><b>Организационный момент</b></li>
</ol>
Проблема обеспечения информационной безопасности в Интернете становится все более актуальной в связи с существенным возрастанием численности пользователей.<br />
<b> </b><br />
<ol>
	<li><b>Изучение нового материала</b></li>
</ol>
Международный день защиты информации – 30 ноября. Праздник начал существовать в 1998 году (с праздника есть даже сайт) т.к. в 1988 г. была зафиксирована первая массовая эпидемия червя, получившего название по имени своего «творца» – Морриса. Праздник существует и признан международным благодаря американской Ассоциация компьютерного оборудования. Цель этого Дня — напомнить всем о необходимости защиты компьютерной информации, а также обратить внимание производителей и пользователей аппаратных и программных средств на проблемы безопасности.<br />
Международный день безопасного Интернета – второй вторник февраля (введен в 2004 году).<br />
- Какие воздействия могут нанести ущерб информации или владельцу, то есть что представляет угрозу информационной безопасности?<br />
<i>Учащиеся </i><i>делают свои предположения и определяются 7 направлений:</i><br />
<ol>
	<li>Кража личных данных, утечка информации</li>
	<li>Вирусы, черви, трояны</li>
	<li>Спам</li>
	<li>Хакеры</li>
	<li>Авторское право, нелицензионное ПО</li>
	<li>Мошенничество</li>
	<li>Дезинформация</li>
</ol>
- Задачи информационной безопасности сводятся к минимизации ущерба, а также к прогнозированию и предотвращению таких воздействий. Давайте разделимся на группы и установим, какие действия нужно предпринять, чтобы обезопасить себя от таких воздействий.<br />
<i>Работа группами по карточкам, обсуждение - </i><i>5</i><i> минут, затем представители от каждой группы сообщают всем свои методы защиты (принимая или оспаривая), </i><br />
<i>- разрабатывается памятка</i><i> ( можно с помощью сети Интернет)</i><br />
<b><i> Кража личных данных, утечка информации</i></b><br />
· старайтесь не &quot;светить&quot; номер кредитки в Сети;<br />
· совершая онлайновую покупку, обращайте внимание на защищенность канала передачи данных;<br />
· отслеживайте файлы cookies на жестком диске, регулярно проверяйте их принадлежность и удаляйте подозрительные.<br />
<b><i>Вирусы, черви, трояны.</i></b><br />
· приобретите хороший антивирусный пакет, установите его в режиме максимальной безопасности, и своевременно обновляйте;<br />
<b><i>Спам.</i></b><br />
· не сообщайте посторонним ваш адрес электронной почты, особенно тот, который предоставлен провайдером или особенно важен для вас;<br />
· пользуйтесь почтовыми серверами с установленными фильтрами.<br />
<b><i>Хакеры.</i></b><br />
· никогда не храните пароли на винчестере (даже в зашифрованном виде), не ленитесь каждый раз набирать их вручную;<br />
· отсоединяйтесь от Internet при подозрении на хакерскую атаку, запускайте антивирусную программу, изменяйте пароли;<br />
· старайтесь меньше пользоваться общедоступными программами сомнительного происхождения;<br />
· просматривайте чаще системный реестр на предмет подозрительных записей;<br />
· обязательно делайте резервные копии данных на дискеты или CD R/RW;<br />
<b><i>Авторское право</i></b><br />
· укрепление законодательной базы;<br />
· пресекайте попытки воровства вашего творчества;<br />
· используйте только лицензионное ПО.<br />
<b><i>Мошенничество (денежное надувательство).</i></b><br />
· просто будьте более скептичными и менее доверчивыми.<br />
<b><i>Дезинформация.</i></b><br />
· разумный скептицизм плюс ее проверка в других средствах массовой информации.<br />
- Рассмотрим, как можно защитить информацию из своего файла от посторонних глаз, защитить файл от изменений.<br />
<b>Игра «За и против».</b><br />
Преподавательтель предлагает игру «За или против».<br />
 Попробуйте привести аргументы, отражающие противоположную точку зрения.<br />
Давайте попробуем выработать правила работы в Интернете (записывать на слайде)<br />
- Что можно? Что нельзя? К чему надо относиться осторожно?<br />
Выработка правил работы в сети Интернет<br />
<ol>
	<li>Не входите на незнакомые сайты.</li>
	<li>Если к вам по почте пришел файл Word или Excel, даже от знакомого</li>
</ol>
лица, прежде чем открыть, обязательно проверьте его на вирусы.<br />
<ol>
	<li>Никогда не посылайте никому свой пароль.</li>
	<li>Старайтесь использовать для паролей трудно запоминаемый набор цифр и букв.</li>
	<li>Если в сети необходимо пройти регистрацию, то должны сделать ее так, чтобы в ней не было указано никакой личной информации.</li>
	<li>Не всей той информации, которая размещена в Интернете, можно верить.</li>
	<li>Не сохраняйте важные сведения на общедоступном компьютере.</li>
	<li><b>Закрепление изученного материала.</b></li>
</ol>
И помните, Интернет может быть прекрасным и полезным средством для обучения, отдыха или общения с друзьями. Но – как и реальный мир – Сеть тоже может быть опасна!<br />
<ol>
	<li><b>Подведение итогов урока</b></li>
	<li><b>Домашнее задание:</b> подготовить сообщение на тему: « Уровни обеспечения информационной безопасности»</li>
</ol> <br /><br />

<b>Информационная безопасность</b><br />
Международный день защиты информации – 30 ноября. Праздник начал существовать в 1998 году (с праздника есть даже сайт) т.к. в 1988 г. была зафиксирована первая массовая эпидемия червя, получившего название по имени своего «творца» – Морриса. Праздник существует и признан международным благодаря американской Ассоциация компьютерного оборудования. Цель этого Дня — напомнить всем о необходимости защиты компьютерной информации, а также обратить внимание производителей и пользователей аппаратных и программных средств на проблемы безопасности.<br />
Международный день безопасного Интернета – второй вторник февраля (введен в 2004 году).<br />
- Какие воздействия могут нанести ущерб информации или владельцу, то есть что представляет угрозу информационной безопасности?<br />
<ol>
	<li>Кража личных данных, утечка информации</li>
	<li>Вирусы, черви, трояны</li>
	<li>Спам</li>
	<li>Хакеры</li>
	<li>Авторское право, нелицензионное ПО</li>
	<li>Мошенничество</li>
	<li>Дезинформация</li>
</ol>
- Задачи информационной безопасности сводятся к минимизации ущерба, а также к прогнозированию и предотвращению таких воздействий. Давайте разделимся на группы и установим, какие действия нужно предпринять, чтобы обезопасить себя от таких воздействий.<br />
<b><i> Кража личных данных, утечка информации</i></b><br />
· старайтесь не &quot;светить&quot; номер кредитки в Сети;<br />
· совершая онлайновую покупку, обращайте внимание на защищенность канала передачи данных;<br />
· отслеживайте файлы cookies на жестком диске, регулярно проверяйте их принадлежность и удаляйте подозрительные.<br />
<b><i>Вирусы, черви, трояны.</i></b><br />
· приобретите хороший антивирусный пакет, установите его в режиме максимальной безопасности, и своевременно обновляйте;<br />
<b><i>Спам.</i></b><br />
· не сообщайте посторонним ваш адрес электронной почты, особенно тот, который предоставлен провайдером или особенно важен для вас;<br />
· пользуйтесь почтовыми серверами с установленными фильтрами.<br />
<b><i>Хакеры.</i></b><br />
· никогда не храните пароли на винчестере (даже в зашифрованном виде), не ленитесь каждый раз набирать их вручную;<br />
· отсоединяйтесь от Internet при подозрении на хакерскую атаку, запускайте антивирусную программу, изменяйте пароли;<br />
· старайтесь меньше пользоваться общедоступными программами сомнительного происхождения;<br />
· просматривайте чаще системный реестр на предмет подозрительных записей;<br />
· обязательно делайте резервные копии данных на дискеты или CD R/RW;<br />
<b><i>Авторское право</i></b><br />
· укрепление законодательной базы;<br />
· пресекайте попытки воровства вашего творчества;<br />
· используйте только лицензионное ПО.<br />
<b><i>Мошенничество (денежное надувательство).</i></b><br />
· просто будьте более скептичными и менее доверчивыми.<br />
<b><i>Дезинформация.</i></b><br />
· разумный скептицизм плюс ее проверка в других средствах массовой информации.<br />

          </strong>
          </p>
      </tab-pane>
	  <tab-pane class="text-color">
		  <template slot="label">
			  Практический раздел
		  </template>
		   <p class="blockquote blockquote-primary">
            <strong><strong class="name">Практическая работа 1. Анализ источников, каналов распространения и каналов утечки информации </strong><br />
<b>Цель работы:</b> формирование навыка работы с нормативными документами по исследуемому вопросу; анализ угроз информационной безопасности<b> </b><br />
<b>Время выполнения: </b>2 часа<b> </b><br />
<b>Оборудование: </b>учебный персональный компьютер.<b> </b><br />
<strong>Теоретические основы</strong><br />
Понятие «информационная безопасность» (ИБ) рассматривается как состояние защищенности потребностей личности, общества и государства в информации, при котором обеспечиваются их существование и прогрессивное развитие независимо от наличия внутренних и внешних информационных угроз. Тогда с позиции обеспечения ИБ можно определить, что под информационной угрозой понимается воздействие дестабилизирующих факторов на состояние информированности, подвергающее опасности жизненно важные интересы личности, общества и государства.<br />
В законе РБ «О безопасности» дано определение угрозы безопасности как совокупности условий, факторов, создающих опасность жизненно важным интересам личности, общества и государства. Под угрозой информации в системах ее обработки понимается возможность возникновения на каком -либо этапе жизнедеятельности системы такого явления или события, следствием которого могут быть нежелательные воздействия на информацию. К настоящему времени известно большое количество разноплановых угроз различного происхождения, таящих в себе различную опасность для информации. Для системного представления их удобно классифицировать по виду, возможным источникам, предпосылкам появления и характеру проявления.<br />
Виды угроз Определив понятие «угроза государству, обществу и личности» в широком смысле, рассмотрим его относительно не посредственного воздействия на конфиденциальную информацию, обрабатываемую на каком-либо объекте (кабине те, предприятии, фирме). Анализируя возможные пути воздействия на информацию, представляемую как совокупность информационных элементов, связанных между собой логическими связями (рис. 1), можно выделить основные нарушения:<br />
— физической целостности (уничтожение, разрушение элементов);<br />
— логической целостности (разрушение логических связей );<br />
— содержания (изменение блоков информации, внешнее навязывание ложной информации);<br />
— конфиденциальности (разрушение защиты, уменьшение степени защищенности информации), — прав собственности на информацию (несанкционированное копирование, использование).<br />
С учетом этого для таких объектов систем угроза информационной безопасности представляет реальные или потенциально возможные действия или условия, приводящие к овладению конфиденциальной информацией, хищению, искажению, изменению, уничтожению ее и сведений о самой системе, а также к прямым материальным убыткам.<br />
Обобщая рассмотренные угрозы, можно выделить три наиболее выраженные для систем обработки информации:<br />
1) подверженность физическому искажению или уничтожению;<br />
2) возможность несанкционированной (случайной или злоумышленной) модификации;<br />
3) опасность несанкционированного (случайного или преднамеренного) получения информации лицами, для которых она не предназначалась.<br />
Кроме того, с точки зрения анализа процесса обработки информации выделяют такую угрозу, как блокирование доступа к обрабатываемой информации.<br />
Угрозы безопасности информации в современных системах ее обработки определяются умышленными (преднамеренные угрозы) и естественными (непреднамеренные угрозы) разрушающими и искажающими воздействиями внешней среды, надежностью функционирования средств обработки информации, а также преднамеренным корыстным воздействием несанкционированных пользователей, целями которых являются хищение, уничтожение, разрушение, несанкционированная модификация и использование обрабатываемой информации. При этом под умышленными, или преднамеренными, понимаются такие угрозы, которые обусловливаются злоумышленными действиями людей. Случайными, или естественными, являются угрозы, не зависящие от воли людей. В настоящее время принята следующая классификация угроз сохранности (целостности)<br />
<img src="img/img-3.png"><br />
Под источником угроз понимается непосредственный исполнитель угрозы с точки зрения ее негативного воздействия на информацию. Источники можно разделить на следующие группы:<br />
— люди;<br />
— технические устройства;<br />
— модели, алгоритмы, программы;<br />
— технологические схемы обработки;<br />
— внешняя среда<br />
Предпосылки появления угроз Существуют следующие предпосылки, или причины, появления угроз:<br />
— объективные (количественная или качественная недостаточность элементов системы) — не связанные непосредственно с деятельностью людей и вызывающие случайные по характеру происхождения угрозы;<br />
— субъективные — непосредственно связанные с деятельностью человека и вызывающие как преднамеренные (деятельность разведок иностранных государств, промышленный шпионаж, деятельность уголовных элементов и недобросовестных сотрудников), так и непреднамеренные (плохое психофизиологическое состояние, недостаточная подготовка, низкий уровень знаний) угрозы информации.<br />
Перечисленные разновидности предпосылок интерпретируются следующим образом:<br />
— количественная недостаточность — физическая не хватка одного или нескольких элементов системы обработки, вызывающая нарушения технологического процесса обработки или перегрузку имеющихся элементов;<br />
— качественная недостаточность — несовершенство конструкции (организации) элементов системы, в силу чего может появляться возможность случайного или преднамеренного негативного воздействия на обрабатываемую или хранимую ин формацию;<br />
— деятельность разведорганов иностранных государств — специально организуемая деятельность государственных органов разведки , профессионально ориентированных на добывание необходимой информации всеми доступными способами и средствами;<br />
— промышленный шпионаж: — негласная деятельность отечественны х и зарубежных промышленных организаций (фирм), направленная на по лучение незаконным путем конфиденциальной информации, используемой для достижения промышленных, коммерческих, политических или подрывных целей;<br />
— злоумышленные действия уголовных элементов — хищение информации, средств ее обработки или компьютерных программ в целях наживы или их разрушение в интересах конкурентов;<br />
— плохое психофизиологическое состояние — постоянное или временное психофизиологическое состояние сотрудников, приводящее при определенных нестандартных внешних воздействиях к увеличению ошибок и сбоев в обслуживании систем обработки информации или непосредственно к разглашению конфиденциальной информации;<br />
— недостаточная качественная подготовка сотрудников — уровень теоретической и практической подготовки персонала к выполнению задач по защите информации, недостаточная степень которого может привести к нарушению процесса функционирования системы защиты информации.<br />
В современной литературе и нормативно-правовых актах в области информационной безопасности можно встретить такую классификацию угроз информации, которая делит их на внутренние и внешние. Одной из наиболее принципиальных особенностей проблемы защиты информации является формирование полного множества угроз информации, потенциально возможных на объекте ее обработки. В самом деле, даже одна неучтенная угроза может в значительной мере снизить эффективность защиты.<br />
Возможные пути получения конфиденциальной информации<br />
Анализ рассмотренных видов угроз позволяет сгруппировать их по двум основным областям:<br />
1) угрозы нарушения физической и логической целостности, а также содержания информации (несанкционированная модификация). Их можно объединить в причины нарушения целостности информации (ПНЦИ);<br />
2) угрозы, следствием которых может быть получение защищаемой информации (хищение или копирование) лицами, не имеющими на это полномочий, — в каналы несанкционированного получения информации (КНПИ).<br />
Под действием рассмотренных выше угроз может произойти утечка защищаемой информации, то есть несанкционированное, неправомерное завладение соперником данной информацией и возможность использования ее в своих, в ущерб интересам собственника (владельца) информации, целях. При этом образуется канал утечки информации, под которым понимается физический путь от источника конфиденциальной информации к злоумышленнику. Для его возникновения необходимы определенные пространственные, энергетические и временные условия, а также соответствующие средства восприятия и фиксации информации на стороне злоумышленника .<br />
. В зависимости от используемых соперником сил и средств для получения несанкционированного доступа к носителям защищаемой информации различают каналы агентурные, технические, легальные.<br />
Агентурные каналы утечки информации — это использование противником тайных агентов для получения несанкционированного доступа к носителям защищаемой информации. В случае использования агентами технических средств разведки (направленны х микрофонов, закладных устройств, миниатюрных видеокамер и др.) говорят о ведении агентурно-технической разведки.<br />
Технические каналы утечки информации — совокупность технических средств разведки, демаскирующих признаков объекта защиты и сигналов, несущих информацию об этих признаках. Эти каналы образуются без участи я человека в процессе обработки информации техническими средствами, а поэтому являются одними из наиболее опасны х и требуют отдельного рассмотрения.<br />
Легальные каналы утечки информации — это использование соперником открытых источников информации (литературы, периодических изданий и т. п), обратный инжиниринг, выведывание под благовидным предлогом информации у лиц, располагающих интересующей соперника информацией, и других возможностей. В основу классификации ПНЦИ положен показатель, характеризующий степень участия в этом процессе человека. В соответствии с таким подходом ПНЦИ делятся на два вида (объективные и субъективные) .<br />
Для предотвращения возможной утечки конфиденциальной информации и нарушения ее целостности на объектах ее обработки разрабатывается и внедряется система защиты информации. Система защиты информации — совокупность взаимосвязанных средств, методов и мероприятий, направленных на предотвращение уничтожения, искажения, несанкционированного получения конфиденциальных сведений, отображенных физическими полями, электромагнитными, световыми и звуковыми волнами или вещественно-материальными носителями в виде сигналов, образов, символов, технических решений и процессов.<br />
<b>Задание</b><br />
Необходимо провести анализ защищенности объекта защиты информации по следующим разделам:<br />
<ol>
	<li>Виды возможных угроз</li>
	<li>Характер происхождения угроз</li>
	<li>Классы каналов несанкционированного получения информации</li>
	<li>Источники появления угроз</li>
	<li>Причины нарушения целостности информации</li>
	<li>Потенциально возможные злоумышленные действия</li>
	<li>Определить класс защищенности автоматизированной системы</li>
</ol>
<strong>Отчет</strong>
Отчет должен содержать:<br />
<ol>
	<li>наименование работы;</li>
	<li>цель работы;</li>
	<li>задание;</li>
	<li>последовательность выполнения работы;</li>
	<li>ответы на контрольные вопросы;</li>
	<li><b> </b>вывод о проделанной работе.<b> </b></li>
</ol>
<b> </b><br />
<b> </b><br />
<b> </b><br />
<b> </b><br />
<b>Контрольн</b><b>ые вопросы</b><br />
<ol>
	<li>Что такое информационный риск?</li>
	<li>В чем заключается задача управления информационными рисками?</li>
	<li>Какие существуют методики оценки рисков и управления ими?</li>
	<li>Какие формулы используются при количественной оценке информационных рисков?<b> </b></li>
</ol>
            </strong>
		   </p>
	  </tab-pane>
	  <tab-pane class="text-color">
		  <template slot="label">
			  Карточка заданий
		  </template>
		  <p class="blockquote blockquote-primary">
            <strong><strong class="name">Какие действия нужно предпринять, чтобы обезопасить себя от таких воздействий, как:</strong><br />
· <b><i>Кража личных данных, утечка информации</i></b><br />
· <b><i>Вирусы, черви, трояны</i></b><br />
· <b><i>Спам</i></b><br />
· <b><i>Хакеры</i></b><br />
· <b><i>Авторское право</i></b><br />
· <b><i>Мошенничество (денежное надувательство)</i></b><br />
· <b><i>Дезинформация</i></b><br /><br /><br />
· старайтесь не &quot;светить&quot; номер кредитки в Сети;<br />
· совершая онлайновую покупку, обращайте внимание на защищенность канала передачи данных;<br />
· отслеживайте файлы cookies на жестком диске, регулярно проверяйте их принадлежность и удаляйте подозрительные.<br />
· приобретите хороший антивирусный пакет, установите его в режиме максимальной безопасности, и своевременно обновляйте;<br />
· не сообщайте посторонним ваш адрес электронной почты, особенно тот, который предоставлен провайдером или особенно важен для вас;<br />
· пользуйтесь почтовыми серверами с установленными фильтрами.<br />
· никогда не храните пароли на винчестере (даже в зашифрованном виде), не ленитесь каждый раз набирать их вручную;<br />
· отсоединяйтесь от Internet при подозрении на хакерскую атаку, запускайте антивирусную программу, изменяйте пароли;<br />
· старайтесь меньше пользоваться общедоступными программами сомнительного происхождения;<br />
· просматривайте чаще системный реестр на предмет подозрительных записей;<br />
· обязательно делайте резервные копии данных на дискеты или CD R/RW;<br />
· укрепление законодательной базы;<br />
· пресекайте попытки воровства вашего творчества;<br />
· используйте только лицензионное ПО.<br />
· просто будьте более скептичными и менее доверчивыми.<br />
· разумный скептицизм плюс ее проверка в других средствах массовой информации.<br />
- Рассмотрим, как можно защитить информацию из своего файла от посторонних глаз, защитить файл от изменений.<br />


            </strong>
		  </p>
	  </tab-pane>

    <tab-pane class="text-color">
      <template slot="label">
        Раздел контроля
      </template>
        <p class="blockquote blockquote-primary-new">
			    <strong><strong class="name"><a class="a-href" target="_blank" href="https://testedu.ru/test/informatika/11-klass/informaczionnaya-bezopasnost-4.html">Информационная безопасность №1</a></strong></strong><br />
          <strong><strong class="name"><a class="a-href" target="_blank" href="https://onlinetestpad.com/ru/test/64399-informacionnaya-bezopasnost">Информационная безопасность №2</a></strong></strong><br />
          <strong><strong class="name"><a class="a-href" target="_blank" href="https://testserver.pro/run/test/1374">Информационная безопасность №3</a></strong></strong><br />
        </p>
    </tab-pane>

            </tabs>
             </blockquote>
			   </div>    
            </div>
            </div>
      	   </div> 
          </div>    
      </div>
        </div>
      </div>
    </div>
    </div>
</template>
<script>
import { Button, Tabs, TabPane } from "@/components";
import { Carousel, CarouselItem } from "element-ui";

export default {
  components: {
    [Button.name]: Button,
    [Carousel.name]: Carousel,
    [CarouselItem.name]: CarouselItem,
    Tabs,
    TabPane,
  },
};
</script>
<style scoped>
.text-color {
  color: black;
}
.name {
  font-size: 1.5rem;
}
.checkbox-cell {
  height: 40px;
  display: flex;
  justify-content: center;
  align-items: center;
}
.typography {
  font-size: 24px;
}
.blockquote {
  padding: 20px;
  font-size: 1.3rem;
  line-height: 1.8;
}
.blockquote.blockquote-primary {
  color: black;
  border-color: black;
}
.typography-line {
  padding-left: 0%;
  margin-bottom: 0px;
  position: relative;
  display: block;
  width: 100%;
}
.tab-content.tab-content-padding {
  padding: 20px;
}
.container {
  max-width: 1600px;
}
.el-carousel__container {
  position: relative;
  height: 730px;
}
.card {
  margin-bottom: 0px;
}
.a-href {
  color: black;
}
.blockquote.blockquote-primary-new2 {
  color: black;
  border-color: rgb(23, 23, 172);
  border-width: 2px;
}
</style>