<template>
    <div class="page-header clear-filter">
      <div
        style="position: fixed; left: 0; top: 0; width: 100%; height: 100%; background-image: url('img/1.jpg'); max-height: 999px;"
      ></div>
<div class="container">
<h3 class="title">Тема 3. Электронные документы и способы их обработки</h3>
  <div class="section section-tabs">
    <div class="container">
      <div class="row">
          <div class="card">
			  <div id="typography">
        	<div class="row">
          	<div class="col-md-12">
        	<div class="typography-line">
            </div>
        	<div class="typography-line">
              <blockquote>
            <tabs
              centered
              type="neutral"
              tab-nav-wrapper-classes="card-header"
              tab-content-classes="card-body"
              data-background-color="darkgreen"
            >
              <tab-pane class="text-color">
                <template slot="label">
                Теоретический раздел
                </template>
                <p class="blockquote blockquote-primary">
                <strong><strong class="name">Документы и их обработка</strong><br />
                Ранее документом называли деловую бумагу, подтверждающую ка­кой-нибудь факт. С появлением компьютерных технологий это понятие расширилось и электронным документом стали именовать набор информа­ции, который имеет имя, определенную структуру, хранится в памяти сис­темы и может передаваться между нею и пользователем. Материальным носителем документа стала не только бумага, но и фотопленка, платежная карточка, магнитная лента, магнитный, и оптический диск.<br />Содержащиеся в документе сведения должны быть удобны для обработки в системах. Ес­ли они записываются в общепринятой форме, определяемой международ­ными стандартами, то говорят, что <b>создается <i>открытый документ</i>.</b>Документ характеризуется стилем, содержит текст, изображения, фрагменты звука, соотносится со временем его создания, <b>имеет <i>реквизиты </i>- обязательно указываемые сведения.</b> Например, адрес, наименование, ав­тор, подпись. Составляется документ на одном из естественных либо ис­кусственных языков.<br /><b>Развитие информационных систем и сетей привело к появлению <i>электронных документов</i>.</b> Все более важное значение получают так называемые составные электронные доку­менты. Они создаются пользователями из заранее подготовленных блоков данных (текстов, изображений, фрагментов речи) либо сообщений, полу­ченных по электронной почте, факсимильной связи.<br />Любые электронные документы должны создаваться в таком виде, чтобы они были понятны как пользователям, так и системам. Если они вначале составляются на бумаге, то предпочтительно применение машино­читаемых шрифтов. Из групп электронных документов формируются фай­лы. Последние хранятся в базах данных и знаний, а их поиск осуществля­ется информационными поисковыми системами. Из одной системы в другую электронные документы передаются в виде сообщений.<br />Обработка документов является процессом их создания и преобра­зования. Она заключается в классификации, сортировке, преобразовании в нужную форму, размещении в базах данных, поиске и выдаче пользовате­лям. Стремление к созданию независимой от конкретных пользователей обработки привело к появлению технологии <i>обработки открытых докумен­тов.</i> Она опирается на международные стандарты. При этом выделяют две наиболее широкие сферы применения обработки документов: издательская и учрежденческая. Издательская деятельность охватывает обработку пуб­ликаций (книг, журнальных статей, рекламных изданий и т.д.). Здесь глав­ным является взаимодействие между автором и издательством. Автор от­вечает за содержание произведения, оставляя издательству процесс его оформления.<br />
Учрежденческая деятельность имеет дело с обработкой и передачей документов. Этот обмен осуществляется, в отличие от издательской дея­тельности, без предварительных договоренностей и ограничений по харак­теру их обработки. Вместе с этим необходимо, чтобы адресаты понимали получаемые документы.<br /><b>При обработке документов необходимо решать большое число за­дач, к которым, в частности, относятся:</b><br /><b> подбор необходимых сведений и ввод их в систему;</b><br /><b> организация хранения документов;</b><br /><b> комплексное структурирование информации;</b><br /><b> включение в документ разнородной информации (текстов, изображе­ний, фрагментов звуков);</b><br /><b> объединение фрагментов, подготовленных различными работниками;</b><br /><b> передача страниц документов между таблицами и базами данных;</b><br /><b> внесение изменений, редактирование и актуализация использованных документов;</b><br /><b>· координация действий работников, участвующих в подготовке слож­ных документов;</b><br /><b>· выбор шрифтов, форматов и форм представлений документов;</b><br /><b>· рассылка и распечатка документов.</b><br /><ul><li><b>Для уменьшения объема необходимой памяти осуществляется сжа­тие хранимых документов. При этом объемы логической и физической па­мяти могут отличаться в несколько раз. Сжимаемые документы при их хранении записываются в наиболее медленно работающие (а поэтому – дешевые) запоминающие устройства. Чаще всего ими являются оптические диски или магнитные ленты. В результате реализации рассматриваемой технологии создаются <i>электронные архивы</i> документов. Специальные про­граммы позволяют управлять структурой архивов, быстро находить и вы­давать пользователям необходимые им документы.</b><br />
</li>
</ul>
<br />
Для этого любой документ, помещаемый в базу данных или знаний, должен иметь имя (условное обозначение). Оно может присваиваться до­кументу путем его <i>индексирования</i> – методики описания данных в базе с помощью указателей (индексов). Файл, обращение к содержимому которо­го происходит при помощи индексов, называют индексированным. Метод доступа к такому файлу именуется индексно-последовательным.<br />Процесс индексирования заключается в нахождении набора слов или кодов, служащих для идентификации документов и используемых для их поиска. Существует несколько методов индексирования. Статистиче­ский метод заключается в том, что из текста документа отбрасываются все незначащие слова, например: <i>из, под, но.</i> Затем подсчитывается час­тота употребления каждого оставшегося слова <b>и учитывается отклонение частоты слов в документе от ожидаемой. В результате, создается <i>поиско­вый образ документа</i>.</b> Он готовится специалистом либо прикладной про­граммой и от его качества зависит полнота поиска, т.е. процент найденных документов, содержащих искомые сведения. Используются три степени поиска: по заголовкам, рефератам, полным текстам.<br />Документооборот определяет потоки электронных документов, не­обходимых в организации либо на предприятии для обеспечения эффек­тивной координации и управления работой. Осуществляется документо­оборот с помощью системы, состоящей из комплекса прикладных про­грамм. Последние обеспечивают запуск процессов, поиск документов, их анализ, классификацию, хранение и передачу в заданные информационные системы.<br />Для функционирования системы автоматизируемый процесс должен быть выделен из всей массы выполняемых на предприятии работ. Естест­венно, что этот процесс должен быть формализован и описан в виде алго­ритма. В выделенном бизнес-процессе участвует группа сотрудников предприятия (организации). Поэтому, в нужных случаях, должны быть уч­тены вопросы синхронизации их деятельности.<br />

          </strong>
          </p>
      </tab-pane>
            </tabs>
             </blockquote>
			   </div>    
            </div>
            </div>
      	   </div> 
          </div>    
      </div>
        </div>
      </div>
    </div>
    </div>
</template>
<script>
import { Button, Tabs, TabPane } from "@/components";

export default {
  components: {
    [Button.name]: Button,
    Tabs,
    TabPane
  },
};
</script>
<style scoped>
.text-color{
  color: black;
}
.name{
  font-size: 1.5rem;
}
.checkbox-cell {
  height: 40px;
  display: flex;
  justify-content: center;
  align-items: center;
}
.typography{
  font-size: 24px;
}
.blockquote {
    padding: 20px;
    font-size: 1.3rem;
    line-height: 1.8;
}
.blockquote.blockquote-primary {
    color: black;
    border-color: black;
}
.typography-line {
    padding-left: 0%;
    margin-bottom: 0px;
    position: relative;
    display: block;
    width: 100%;
}
.tab-content.tab-content-padding {
  padding: 20px;
}
.container{
	max-width: 1600px;
}
.el-carousel__container {
    position: relative;
    height: 730px;
}
.card {
    margin-bottom: 0px; 
}
</style>