<template>
    <div class="page-header clear-filter">
      <div
        style="position: fixed; left: 0; top: 0; width: 100%; height: 100%; background-image: url('img/1.jpg'); max-height: 999px;"
      ></div>
<div class="container">
<h3 class="title">Тема 3.1. Создание документов с помощью шаблонов в текстовом редакторе WORD </h3>
  <div class="section section-tabs">
    <div class="container">
      <div class="row">
          <div class="card">
			  <div id="typography">
        	<div class="row">
          	<div class="col-md-12">
        	<div class="typography-line">
            </div>
        	<div class="typography-line">
            <tabs
              centered
              type="neutral"
              tab-nav-wrapper-classes="card-header"
              tab-content-classes="card-body"
              data-background-color="darkgreen"
            >
              <tab-pane class="text-color">
                <template slot="label">
                Теоретический раздел
                </template>

                <div class="row justify-content-center">
		<div class="col-8">
			<p class="blockquote blockquote-primary-new2">
          <el-carousel height="730px" arrow="always" :autoplay="false">
            <el-carousel-item>
              <img class="d-block" src="img/5/1.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/5/2.jpg" />
            </el-carousel-item>
             <el-carousel-item>
              <img class="d-block" src="img/5/3.jpg" />
            </el-carousel-item>
             <el-carousel-item>
              <img class="d-block" src="img/5/4.jpg" />
            </el-carousel-item>
             <el-carousel-item>
              <img class="d-block" src="img/5/5.jpg" />
            </el-carousel-item>
             <el-carousel-item>
              <img class="d-block" src="img/5/6.jpg" />
            </el-carousel-item>
             <el-carousel-item>
              <img class="d-block" src="img/5/7.jpg" />
            </el-carousel-item>
             <el-carousel-item>
              <img class="d-block" src="img/5/8.jpg" />
            </el-carousel-item>
             <el-carousel-item>
              <img class="d-block" src="img/5/9.jpg" />
            </el-carousel-item>
			      <el-carousel-item>
              <img class="d-block" src="img/5/10.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/5/11.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/5/12.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/5/13.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/5/14.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/5/15.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/5/16.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/5/17.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/5/18.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/5/19.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/5/20.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/5/21.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/5/22.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/5/23.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/5/24.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/5/25.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/5/26.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/5/27.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/5/28.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/5/29.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/5/30.jpg" />
            </el-carousel-item>
            <el-carousel-item>
              <img class="d-block" src="img/5/31.jpg" />
            </el-carousel-item>

          </el-carousel>
		</p>
        </div>
      </div>


                <p class="blockquote blockquote-primary-new2">
                <strong><strong class="name"></strong><br />
<b>Преподаватель: </b>Антоненкова И.П.<br />
<b>Учебный предмет</b>: Прикладная информатика<br />
<b>Тема программы</b>: Работа с большими документами в текстовом редакторе Word<br />
<b>Тема урока</b>: Создание оглавления, предметного указателя, закладок, сносок<br />
<b>Тип урока</b>: лабораторно-практическая работа<br />
<b>Цели урока</b>:<br />
<ol>
	<li><b><u>Обучающая</u></b>: сформировать понятия о подготовке документа для создания автоматического оглавления, предметного указателя, закладок, сносок</li>
	<li><b><u>Развивающая: </u></b>способствовать развитию профессионального мышления</li>
	<li><b><u>Воспитательная</u></b>: способствовать воспитанию положительного отношения к знаниям, сознательного отношения к труду</li>
	<li><b><u>Методическая:</u></b> проверить эффективность методики организации самостоятельной работы учащихся на практическом занятии по информатике</li>
</ol>
<b>Материально-техническое оснащение</b>: компьютеры<br />
<b>Межпредметные связи</b>: математика<br />
<b>Оборудование: </b>компьютер учителя, мультимедийный проектор, компьютеры обучающихся<br />
<b>Ход урока</b><br />
<ol style="list-style-type: lower-latin;">
	<li><b>Организационный момент</b></li>
	<li><b>Актуализация опорных знаний, умений и навыков</b></li>
</ol>
<ol>
	<li>Что понимается под форматированием?</li>
	<li>Что можно изменять в процессе форматирования символов?</li>
	<li>Что можно изменять в процессе форматирования абзацев?</li>
	<li>Какие преимущества обеспечивает стилевое форматирование?</li>
	<li>Перечислите наиболее распространенные форматы файлов, в которых сохраняют текстовые документы?</li>
	<li>С какой целью разработчики включают в текстовые документы списки, таблицы, графические изображения?</li>
	<li>Какая информация может быть организована в табличной форме?</li>
	<li>Какие преимущества обеспечивает табличное представление информации?
<ol style="list-style-type: lower-latin;">
	<li><b>Мотивация учебной деятельности</b></li>
</ol>
Читая учебники и художественные произведения, просматривая газеты, журналы и другую печатную продукцию, вы могли обратить внимание на разнообразие способов оформления текста. Различные операции по приданию текстовому документу требуемого вида совершаются на этапе форматирования. Сегодня мы с вами будем учиться создавать ссылки, сноски, предметные указатели, оглавления, т.е. все то, что придает приятный внешний вид любому документу.<br />
Сообщение темы и целей урока.<br />
<ol style="list-style-type: lower-latin;">
	<li><b>Изучение нового материала</b></li>
</ol></li>
</ol>
<b>Создание гиперссылок в тексте</b><br />
Гиперссылку можно создать в текстовом документе MS Word несколькими способами.<br />
<img src="img/img-4.png"><br />
 Основные из них связаны с диалоговым окном <b>Добавление гиперссылки</b>.<br />
 Это диалоговое окно открывается командой <b>Вставка – Гиперссылка</b>. В верхней части диалогового окна располагаются элементы управления, позволяющие задать текст, щелчок на котором будет восприниматься как команда перехода по гиперссылке, и текст подсказки, всплывающей при наведении указателя мыши на текст гиперссылки. Если в момент открытия диалогового окна в текстовом документе будет выделен фрагмент текста, то он становится текстом гиперссылки. Если в момент открытия 
диалогового окна будет выделен графический элемент текстового документа, гиперссылка будет связана с ним. В последнем случае текст гиперссылки не определяется.<br />
Текст подсказки гиперссылки (текстовой или графической) вводится в единственное текстовое поле вспомогательного диалогового окна, раскрывающегося кнопкой <b>Подсказка.</b><br />
Остальные элементы управления диалогового окна <b>Добавление гиперссылки</b> предназначены для задания адреса гиперссылки. В левой части окна представлены несколько вариантов задания адреса гиперссылки.<br />
<b>Вставка гиперссылки на элемент того же текстового документа</b><br />
Вставка в документ Web гиперссылок на элементы, расположенные в том же документе, дает замечательную возможность автоматизировать перемещение по документу.<br />
Чтобы вставить в документ MS Word гипертекстовую ссылку на элемент того же документа, необходимо выполнить следующие шаги:<br />
<ol>
	<li>Если элемент, на который должна привести гиперссылка, не является заголовком оглавления документа, и на него не была ранее определена закладка, определить описанным выше приемом закладку с уникальным именем.</li>
	<li>Выбрать в тексте документа фрагмент, который будет служить текстом гиперссылки, или графический элемент, с которым будет связана гиперссылка.</li>
	<li>Открыть диалоговое окно <b>Добавление гиперссылки </b>командой <b>Вставка - Гиперссылка.</b></li>
	<li>При необходимости задать текст всплывающей подсказки, щелкнуть мышью на кнопке <b>Подсказка </b>и ввести текст в поле вспомогательного диалогового окна, а затем щелкнуть в нем кнопку <b>OK</b><b>.</b></li>
	<li>В зоне выбора места в документе диалогового окна <b>Добавление гиперссылки </b>выбрать щелчком мыши заголовок или закладку, определяющую адрес формируемой гиперссылки, а затем щелкнуть в нем кнопку <b>OK</b>.</li>
</ol>
<b>Чтобы вставить в документ </b><b>MS</b><b> </b><b>Word</b><b> гиперссылку на другой документ, следует:</b><br />
<ol>
	<li><b>Открыть</b> файл, на который будет ссылаться новая гиперссылка, и, при необходимости, вставить новую закладку.</li>
	<li><b>Открыть</b> файл, в который должна быть вставлена новая гиперссылка, и выбрать текст или объект, который будет связан с ней.</li>
	<li><b>Открыть</b> диалоговое окно <b>Добавление гиперссылки </b>командой <b>Вставка – Гиперссылка.</b></li>
	<li>В списке <b>Связать</b> c диалогового окно <b>Добавление гиперссылки </b>выбрать вариант 1 имеющимся файлом, <b>Web</b><b>-страницей</b>.</li>
	<li>Найти и выбрать документ, на который должна указывать гиперссылка, воспользовавшись кнопкой <b>Файл.</b></li>
	<li>При необходимости указать в гиперссылке закладку, нажав кнопку <b>Закладка</b>, а затем выбрать нужную.</li>
	<li>При необходимости задать текст всплывающей подсказки, щелкнуть мышью на кнопке Подсказка и ввести текст подсказки в поле вспомогательного диалогового окна, а затем нажать в нем кнопку <b>OK</b><b>.</b></li>
	<li>Создать гиперссылку, нажав кнопку <b>OK</b> диалогового окна <b>Добавление гиперссылки.</b></li>
</ol>
<b>Вставка оглавлений</b><br />
В текстовом процессоре <b>MS Word</b> предусмотрена значительная степень автоматизации многих действий по оформлению отдельных структурных элементов документа. Это вставка сносок, колонтитулов, создание оглавлений (или содержаний) и предметных указателей.<br />
Для того чтобы оглавление могло быть вставлено автоматически, при наборе или форматировании документа все заголовки определенного уровня должны быть оформлены с помощью соответствующего стиля заголовка (<b>ЗАГОЛОВОК1, ЗАГОЛОВОК2</b> и т.д.). Всего в иерархии заголовков возможно девять уровней.<br />
Затем в соответствующем месте документа <b>(если это оглавление, то в начале, если содержание — в конце)</b> осуществляется вставка оглавления.<br />
 Это можно проделать одним из способов: меню <b>Вставка ==&gt; Ссылка ==&gt; Оглавление и указатели</b> или через панель инструментов <b>Структура</b>, инструмент <b>Оглавление</b><br />          
 <img src="img/img-5.png"><br />
 <img src="img/img-6.png"><br />
 В диалоговом окне необходимо выбрать формат оглавления (т.е. один из вариантов оформления), ориентируясь на образец; заполнитель между последним словом пункта оглавления и номером страницы; задать, если необходимо, количество уровней заголовков в структуре документа, по которым собирается оглавление.<br />
После этого оглавление можно вставить. Если что-либо в его оформлении не устраивает, вставку можно повторить. Довольно часто по ошибке стилем заголовков оформляют не являющиеся таковыми абзацы. Естественно, что они попадают в оглавление. Необходимо очистить у них формат заголовка, задав нужный стиль, и повторить вставку оглавления или произвести обновление оглавления: панель инструментов <b>Структура</b>, кнопка <b>Обновить оглавление</b> .<br />
<b>Создание указателей и сносок</b><br />
При работе с большими документами, например, техническими, достаточно большую помощь в поиске нужной информации может оказать предметный указатель. Как известно, чаще всего предметный указатель содержит перечень терминов и страницы, на которых они упоминаются.<br />
Создание предметного указателя происходит в два этапа.<br />
На первом этапе должны быть помечены один за другим все термины и другие элементы текста, которые предполагается включить в указатель. Делается это следующим образом. Прежде всего, термин выделяется в тексте. Затем обращаемся к меню <b>Вставка ==&gt; Ссылка ==&gt; Оглавление и указатели</b>, вкладка <b>Указатель</b>.<br />
<img src="img/img-7.png"><br />
В этом окне нажимается кнопка <b>Пометить</b>, что открывает ещё одно окно <b>Определение элемента указателя</b>.<br />
<img src="img/img-8.png"><br />
Здесь задаются основной и дополнительный (если необходимо) элементы указателя, для правильной ссылки должен быть установлен переключатель <b>текущая страница</b>, можно указать формат номера страницы. Затем выбирается кнопка <b>Пометить</b> (кнопка <b>Пометить все </b>может быть выбрана в том случае, когда во всем документе нужно отметить текст, заданный как основной).<br />
Теперь можно, не закрывая окно <b>Определение элемента указателя</b>, перейти к следующему элементу.<br />
Второй этап заключается собственно во вставке предметного указателя. Для этого курсор устанавливается в то место документа, где должен быть указатель, и через меню <b>Вставка ==&gt; Ссылка ==&gt; Оглавление и указатели</b>, вкладка <b>Указатель</b>, выбрав кнопку <b>ОК</b>, вставляем указатель.<br />
Аналогично оглавлению предметный указатель может быть изменен и обновлен. В документе <b>MS Word</b> можно использовать два вида сносок — в конце страницы и в конце документа.<br />
Для добавления сноски используется меню <b>Вставка ==&gt; Ссылка ==&gt; Сноска</b>, после чего в диалоговом окне задаются все параметры сноски: положение сноски — внизу страницы или в конце документа, формат номера и область применения заданных изменений.<br />
<img src="img/img-9.png"><br />
После нажатия кнопки Вставить набирается текст сноски.<br />
<b>Колонтитулы</b><br />
На каждой странице документа (вверху или внизу) может размещаться повторяющийся текст – колонтитул.<br />
Для вставки нового колонтитула выбирают меню <b>Вид ==&gt; Колонтитулы</b>. При этом основной текст становится недоступным для редактирования, можно работать лишь с колонтитулом. Кроме того, открывается панель инструментов <b>Колонтитулы</b>. Текст колонтитула вводится, редактируется и форматируется точно так же, как и основной документ. С помощью панели инструментов <b>Колонтитулы</b> можно перемещаться между верхним и нижним колонтитулом.<br />
Щелчок по кнопке <b>Закрыть</b> на панели инструментов Колонтитулы завершает работу с колонтитулом. Для редактирования колонтитула достаточно сделать двойной щелчок в его области. Удалить колонтитул можно, удалив его содержание.<br />
<img src="img/img-10.png"><br />
<b>Вставка титульного листа, нумерация страниц</b><br />
<b>Титульный лист</b><br />
Достаточно часто для оформления объемной работы используют титульный лист — первую страницу, на которой указывают название работы, автора и другие необходимые сведения.<br />
Для вставки в документ титульного листа перейдите на вкладку <b>Вставка</b> и в группе <b>Страницы</b> щелкните на кнопке <b>Титульная страница</b>. Появится меню, содержащее доступные шаблоны титульных страниц. Выберите из списка нужный вариант, в результате чего в документе появится первая страница указанного вида. Введите в поля нужный текст. Имя автора появится автоматически (<b>Word</b> вставит имя, указанное при установке программы), но при необходимости вы можете изменить это имя. Для этого просто щелкните на нем и наберите новое. Ненужные элементы можно удалить. Для этого щелкните на них и два раза нажмите клавишу <b>Delete.</b> Чтобы удалить титульную страницу, выполните команду Удалить титульную страницу в меню кнопки <b>Титульная страница.</b><br />
<b>Нумерация страниц</b><br />
Чтобы пронумеровать страницы, сделайте следующее.<br />
<ol>
	<li>Перейдите на вкладку <b>Вставка ленты</b> и в группе <b>Колонтитулы</b> щелкните на кнопке <b>Номер страницы.</b></li>
	<li>В открывшемся меню подведите указатель мыши к нужному положению номера на странице (внизу, вверху, на полях или в месте, в котором установлен курсор) и в появившемся подменю щелкните на требуемом варианте. В выбранном месте страницы появится номер указанного формата, и при этом программа перейдет в режим работы с колонтитулами.</li>
</ol>
Если нужно настроить формат номера страницы, в меню кнопки <b>Номер страницы</b> выберите команду <b>Формат номеров страниц</b>. Появится окно <b>Формат номера страницы</b>, в котором можно задать нумерацию глав, а также указать формат номера (вместо арабских цифр можно выбрать римские, буквы алфавита).<br />
Чтобы удалить номера страниц, выполните команду <b>Удалить</b> номера страниц в меню кнопки <b>Номер страницы</b>.<br />
Если нужно, чтобы на первой странице документа не было номера, то сделайте следующее.<br />
<ol>
	<li>Щелкните на кнопке в правом нижнем углу группы <b>Параметры страницы</b> вкладки <b>Разметка страницы</b>.</li>
	<li>В открывшемся окне <b>Параметры</b> страницы перейдите на вкладку <b>Источник бумаги.</b></li>
</ol>
Установите флажок первой страницы в области <b>Различать колонтитулы.</b><br />
В процессе сохранения документа необходимо, прежде всего, в иерархической файловой системе компьютера выбрать диск и папку, в которой файл документа необходимо сохранить.<br />
<b>Как правильно сохранить документ?</b><br />
<b>Файл – Сохранить как</b> – выбрать нужную папку и сохранить работу.<br />
Кроме того, необходимо выбрать формат файла, который определяет способ хранения текста в файле. Существуют универсальные форматы текстовых файлов, которые могут быть прочитаны большинством текстовых редакторов, и оригинальные форматы, которые используются только определенными текстовыми редакторами<br />
Формат <b>ТХТ</b> (только текст, расширение в имени файла txt) является наиболее универсальным текстовым форматом. Файлы, сохраненные в этом формате, могут быть прочитаны приложениями, работающими в различных операционных системах. Достоинством этого формата является небольшой информационный объем файлов, а недостатком то, что не сохраняются результаты форматирования текста.<br />
Формат <b>RTF </b>(расширенный текстовый формат, расширение в имени файла rtf) является также универсальным форматом текстовых файлов, в котором сохраняются результаты форматирования. Недостатком этого формата является большой информационный объем файлов.<br />
<ol style="list-style-type: lower-latin;">
	<li>Формат <b>DОС</b> и <b>DOCX</b>(документ <b>Word</b><b>,</b> расширение в имени файла doc) является оригинальным форматом текстового редактора <b>Microsoft</b><b> </b><b>В этом формате полностью сохраняются результаты форматирования. Этот формат фактически является универсальным, так как понимается практически всеми текстовыми редакторами.</b></li>
</ol>
Формат <b>Web-страница</b> (расширение в имени файла htm или html) используется для хранения Web-страниц в компьютерных сетях, так как файлы в этом формате имеют небольшой информационный объем, и при этом сохраняются результаты форматирования. Документы в этом формате создаются в Web-редакторах, а также могут сохраняться с использованием многих текстовых редакторов. Достоинством этого формата является его универсальность, так как Web-страницы могут просматриваться с использованием специализированных программ (браузеров) в любых операционных системах.<br />
<ol style="list-style-type: lower-latin;">
	<li><b>Физкультминутка</b></li>
	<li><b>Работа за компьютером (приложение1)</b></li>
	<li><b>Подведение итогов урока</b></li>
</ol>
Итак, сегодня мы познакомились с принципами создания гипертекста, ссылок, нумерации страниц, создания колонтитулов; научились использовать эти операции в текстовом редакторе Word, сохранять документы в различных текстовых форматах, придавать документу требуемый вид.<br />
<ol style="list-style-type: lower-latin;">
	<li><b>Домашнее задание</b></li>
</ol>
Проработать материал п 4.3.6. стр. 166-167, выучить алгоритмы вставки сносок, указателей, гиперссылок<br />

          </strong>
          </p>
      </tab-pane>
      
      <tab-pane class="text-color">
                <template slot="label">
                ЛПЗ №1
                </template>
                <p class="blockquote blockquote-primary">
                <strong><strong class="name">СОЗДАНИЕ ДОКУМЕНТОВ В РЕДАКТОРЕ MICROSOFT WORD </strong><br />
<b>Цель работы</b>: Изучение информационной технологии создания, форматирования и сохранения документов в MS Word.<br />
<b> </b><br />
<b>Задание 1. </b>Подготовка к созданию текстового документа.<br />
1.Создать в папке <b><i>Мои документы</i></b> папку с именем <b><i>Номер группы</i></b>, а в ней свою папку (в качестве имени папки набрать свою фамилию).<br />
2.Запустить текстовый редактор Microsoft Word.<br />
3.Установить параметры программы (меню <b><i>Сервис – Параметры</i></b>, вкладка <b><i>Вид</i></b>):<br />
· Показывать - выделение цветом;<br />
· Показывать - строку состояния;<br />
· Показывать - всплывающие подсказки;<br />
· Показывать - анимацию текста;<br />
· Показывать - горизонтальную полосу прокрутки;<br />
· Показывать - вертикальную полосу прокрутки;<br />
· Затенение полей – никогда;<br />
· Знаки форматирования – все;<br />
· Параметры режима разметки и Web-документа – рисунки;<br />
· Параметры режима разметки и Web-документа – границы текста;<br />
· Параметры режима разметки и Web-документа – вертикальная линейка;<br />
4.Установить вид экрана <b><i>Обычный</i></b> (меню <b><i>Вид – Обычный</i></b>).<br />
<b>Задание 2. </b>Набор текста.<br />
1.Установить гарнитуру шрифта – Times New Roman, размер шрифта 14, курсив.<br />
2.Набрать текст по образцу:<br />
Чтобы представлять, как располагается текст на листе, используйте режим <b><i>Разметка страницы.</i></b> Для задания этого вида воспользуйтесь меню <b><i>Вид</i></b> и выберите команду <b><i>Разметка страницы</i></b><i>.</i><br />
Если Вам на экране не видны края документа, выберите масштаб «по ширине» (меню <b><i>Вид</i></b><i>,</i> команда <b><i>Масштаб по ширине</i></b>).<br />
3.В набранном тексте выделите названия пунктов меню и команды полужирным шрифтом.<br />
<b>Задание 3</b>. Изменения вида экрана.<br />
1.Установите режим <b><i>Разметка страницы</i></b> (меню <b><i>Вид – Разметка страницы</i></b>).<br />
2.Для выбора оптимального размера документа на экране установить в порядке указанной очередности ниже перечисленные виды масштабов (меню <b><i>Вид – Масштаб</i></b>):<br />
стандартный 500% и 75%; произвольный 38% и 130%; несколько страниц; страница целиком; по ширине страницы.<br />
3.Оставить для работы с документом последний установленный вид масштаба <b><i>по ширине</i></b>.<br />
<b>Задание 4</b>. Вставка символов.<br />
1.Вставить после текста следующие символы (меню <b><i>Вставка – Символ</i></b>). При выборе нескольких символов окно <b><i>Символ</i></b> можно не закрывать, последовательно выбирать мышью вставляемые символы и нажимать кнопку <b><i>Вставить</i></b>. Если Вы не видите нужных символов, то необходимо в зоне <b><i>Шрифт</i></b> окна <b><i>Символ</i></b> выбрать другой вид шрифта.<br />
<img src="img/img-11.png"><br />
<b>Задание 5. </b>Форматирование текста.<br />
1.Установить в первом абзаце напечатанного текста различные размеры шрифта (меню <b><i>Формат – Шрифт, </i></b>вкладка<b><i> Шрифт</i></b>): первое слово – 22 пт; второе слово – 18 пт; третье слово – 14 пт; четвертое слово – 10 пт.<br />
2.Оформить во втором абзаце в первой строке все слова разным цветом (меню <b><i>Формат – Шрифт, </i></b>вкладка<b><i> Шрифт</i></b>).<br />
3.Произвести во втором абзаце следующие преобразования, выделяя нужные слова (меню <b><i>Формат – Шрифт, </i></b>вкладка<b><i> Шрифт</i></b>):<br />
первые два слова оформить <b>полужирным шрифтом</b>;<br />
вторые два слова – <i>курсивом</i>; третьи два слова – <u>подчеркиванием</u>; следующие два слова – <i>курсивом</i> + <b>полужирным</b> + <u>подчеркиванием</u>.<br />
4.Задать в первом абзаце разные виды подчеркивания (меню <b><i>Формат – Шрифт, </i></b>вкладка<b><i> Шрифт</i></b>):<br />
первое слово – <u>с одинарным подчеркиванием</u>; второе – <u>с пунктирным подчеркиванием</u>; третье – <u>с двойным подчеркиванием</u>.<br />
5.Набрать слово «эффект». Скопировать его пять раз (меню <b><i>Правка – Копировать, Правка – Вставить</i></b>) и наложить следующие видоизменения (меню <b><i>Формат – Шрифт, </i></b>вкладка<b><i> Шрифт</i></b>):<br />
<img src="img/img-12.png"><br />
6.Наложить на первую строку первого абзаца эффект анимации «Фейерверк» (меню <b><i>Формат –</i></b> <b><i>Шрифт, </i></b>вкладка<b><i> Анимация</i></b>).<br />
7.На слова «Разметка страницы» установить интервал разрежения на 10 пт. (меню <b><i>Формат –Шрифт, </i></b>вкладка<b><i> Интервал </i></b>– интервал разреженный на 10 пт.).<br />
8.На слова «Масштаб по ширине» установить волнистое подчеркивание и синий цвет шрифта.<br />
9.Выделить второй абзац текста и изменить гарнитуру шрифта на Arial<i>.</i><br />
<b> </b><br />
<b>Задание 6. </b>Обрамление и заливка текста.<br />
1.Произведите обрамление первой строки текста. Для этого выделить первую строку, в меню <b><i>Формат</i></b> выбрать команду <b><i>Границы</i></b> <b><i>и заливка</i></b>, на вкладке <b><i>Границы</i></b> задать цвет линии – синий, толщину – 1,5 пт., тип линии – сплошная линия; применить – к тексту, тип границ – рамка. При применении рамки «к тексту» рамка окаймит только выделенные слова, а при применении рамки «к абзацу» – рамка примет размеры по ширине листа без учета полей.<br />
2.Произвести заливку цветом второго абзаца текста. Для этого выделите второй абзац, в меню <b><i>Формат</i></b> выбрать команду <b><i>Границы и заливка</i></b>, на вкладке <b><i>Заливка</i></b> выбрать цвет.<br />
3.Сохранить набранный документ в своей папке с именем <b>Фамилия1.doc</b> (меню <b><i>Файл - Сохранить как</i></b>).<br />
4.Создать свою визитку, заключенную в рамку:<br />
<img src="img/img-13.png"><br />
<strong>Дополнительное задание</strong>
Применяя все известные приемы создания, копирования и форматирования текстовых документов, выполните задание по образцу, стараясь создать по внешнему виду документы как можно ближе к оригиналу задания.<br />
<img src="img/img-14.png"><br />
<img src="img/img-15.png"><br />
          </strong>
          </p>
      </tab-pane>
      <tab-pane class="text-color">
        <template slot="label">
          ЛПЗ №2
        </template>
        <p class="blockquote blockquote-primary">
                <strong><strong class="name">ОФОРМЛЕНИЕ АБЗАЦЕВ ДОКУМЕНТОВ. КОЛОНТИТУЛЫ </strong><br />
<b>Цель работы: </b>Изучение информационной технологии создания и форматирования абзацев текста в MS Word.<br />
<b>Задание 1. </b>Форматирование абзацев текста. 1.Набрать один абзац текста по образцу:<br />
<img src="img/img-16.png"><br />
<table><tr><td></td>
</tr>
<tr><td></td>
<td><br></td>
</tr>
</table><br> Перед набором текста необходимо задавать помимо параметров шрифта параметры абзаца. Для этого надо воспользоваться командой <i>Формат – Абзац</i> и в открывшемся окне установить параметры выравнивания текста на листе бумаги, параметры первой строки, межстрочного расстояния и межабзацного интервала.<br />
2.Скопировать набранный абзац текста пять раз (<b><i>Правка – Копировать</i></b>, <b><i>Правка – Вставить</i></b>).<br />
3.Выделить первый абзац текста и установить следующие параметры абзаца (<b><i>Формат – Абзац, </i></b>вкладка<b><i> Отступы и интервалы): </i></b><br />
первая строка – отступ стандартный; межстрочный интервал – полуторный; выравнивание – по ширине.<br />
4.Выделить третий абзац и установить следующие параметры абзаца:<br />
первая строка – отступ стандартный; межстрочный интервал – одинарный; выравнивание – по левому краю.<br />
5.Выделить пятый абзац текста и установить следующие параметры абзаца:<br />
первая строка – нет; межстрочный интервал – двойной; выравнивание – по правому краю.<br />
6.Выделить шестой абзац и установить следующие параметры абзаца:<br />
первая строка – отступ на 2,5 см; межстрочный интервал – множитель 1,3; выравнивание – по центру.<br />
7.Выделить второй абзац и установить следующие параметры абзаца:<br />
первая строка – отступ на 1,5 см; отступ справа – 4 см; межстрочный интервал – множитель 1,8; выравнивание – по ширине.<br />
8.Выделить четвертый абзац и установить следующие параметры абзаца:<br />
первая строка – отступ на 2 см; отступ справа – 3 см; отступ слева – 6 см; межстрочный интервал – множитель 2,5; выравнивание – по ширине.<br />
<b>Задание 2</b>. Обрамление абзацев.<br />
Выделяя абзацы текста, установить следующие параметры рамки (<b><i>Формат – Границы и заливка, </i></b>вкладка<b><i> Граница</i></b>).<br />
<i>Первый абзац: </i>тип линии – обычная линия; цвет – авто; ширина – 0,5 пт.; применить – к абзацу; тип обрамления – рамка.<br />
<i>Третий абзац: </i>тип линии – обычная линия; цвет – синий; ширина – 2,25 пт.; применить – к абзацу; тип обрамления – линии слева и снизу.<br />
<i>Пятый абзац: </i>тип линии – пунктирная линия; цвет – красный; ширина – 1,5 пт.; применить – к абзацу; тип обрамления – линии слева и справа.<br />
<b> </b><br />
<b>Задание 3. </b>Заливка абзацев.<br />
Выделяя абзацы текста, установить следующие параметры заливки (<b><i>Формат – Границы и заливка, </i></b>вкладка<b><i> Заливка</i></b>).<br />
<i>Второй абзац: </i>заливка – светло-желтый цвет; узор – 10%; применить – к абзацу.<br />
<i>Четвертый абзац: </i><br />
заливка – светло-голубой цвет; узор – нет; применить – к тексту.<br />
<i>Шестой абзац: </i><br />
заливка – сиреневый цвет; узор – светлый по диагонали вниз; применить – к абзацу.<br />
<b>Задание 4</b>. Задание межабзацных расстояний<b>. </b><br />
Выделить весь текст командой<b> <i>Правка – Выделить все</i> </b>и задать<b> </b>межабзацное расстояние<b> </b>24 пт. командой<b> <i>Формат – Абзац, </i></b>вкладка<b><i> Отступы и интервалы, Интервал перед </i></b>– 24 пт.<br />
<b>Задание 5</b>. Задание колонтитулов.<br />
1.Установить вид документа <i>Разметка страницы</i> (<b><i>Вид – Разметка страницы</i></b>).<br />
2.Задать колонтитулы документа (<b><i>Вид – Колонтитулы</i></b>). В колонтитулы ввести следующую информацию:<br />
в верхний колонтитул – Ф.И.О., дата, время; в нижний колонтитул – название учебного заведения и номера страниц. Дата, время и номера страниц задаются кнопками панели <b><i>Колонтитулы</i></b>.<br />
Переключение на нижний колонтитул производится также кнопкой панели <b><i>Колонтитулы – Верхний/Нижний колонтитул</i></b>. При вводе колонтитулов основной текст приобретает бледный цвет и становится недоступен. Окончание работы с колонтитулами производится кнопкой <b><i>Закрыть</i></b> панели <b><i>Колонтитулы</i></b>. Колонтитулы видны только в виде <i>Разметка страницы</i>.<br />
3.Установить параметры страницы и расстояние от края до колонтитула (<b><i>Файл – Параметры страницы</i></b>): верхнее поле – 1,5 см; нижнее поле – 1,5 см; левое поле – 3 см; правое поле – 1 см; расстояние от края до верхнего колонтитула – 1 см; расстояние от края до нижнего колонтитула – 1 см.<br />
4.Измените вид экрана на обычный (<b><i>Вид – Обычный</i></b>).<br />
Обратите внимание, что колонтитулы не видны в обычном виде документа.<br />
5.Сохранить набранный документ в своей папке с именем <b>Фамилия2.doc </b><br />
<h3>Дополнительное задание</h3>
Используя копирование и форматирование, набрать по образцу:<br />
<img src="img/img-17.png"><br />
Мы не можем признать Вашу претензию по следующей причине. Согласно<br />
п.6 нашего договора, Вы обязались открыть по телеграфу безотзывный аккредитив в нашу пользу на полную стоимость товара в течение 5 дней от даты нашего телеграфного извещения о готовности товара к отгрузке.<br />
<img src="img/img-18.png"><br />
Мы не можем признать Вашу претензию по следующей причине. Согласно п.6 нашего договора, Вы обязались открыть по телеграфу безотзывный аккредитив в нашу пользу на полную стоимость товара в течение 5 дней от даты нашего телеграфного извещения о готовности товара к отгрузке.<br />
МЫ НЕ МОЖЕМ ПРИЗНАТЬ ВАШУ ПРЕТЕНЗИЮ ПО СЛЕДУЮЩЕЙ<br />
ПРИЧИНЕ. СОГЛАСНО П.6 НАШЕГО ДОГОВОРА, ВЫ ОБЯЗАЛИСЬ ОТКРЫТЬ ПО ТЕЛЕГРАФУ БЕЗОТЗЫВНЫЙ АККРЕДИТИВ В НАШУ ПОЛЬЗУ НА ПОЛНУЮ СТОИМОСТЬ ТОВАРА В ТЕЧЕНИЕ 5 ДНЕЙ ОТ<br />
ДАТЫ НАШЕГО ТЕЛЕГРАФНОГО ИЗВЕЩЕНИЯ О ГОТОВНОСТИ ТОВАРА К ОТГРУЗКЕ.<br />
          </strong>
          </p>
      </tab-pane>

      <tab-pane class="text-color">
        <template slot="label">
          ЛПЗ №3
        </template>
         <p class="blockquote blockquote-primary">
                <strong><strong class="name">КОЛОНКИ. БУКВИЦА. ФОРМАТИРОВАНИЕ РЕГИСТРОВ</strong><br />
<b>Цель работы: </b>Изучение информационной технологии создания текста с колонками и оформления текста в MS Word.<br />
<b>Задание 1. </b>Создание многоколонных документов.<br />
1.Набрать один абзац текста по приведенному образцу, расположенному ниже (гарнитура шрифта – Times New Roman, размер шрифта – 14):<br />
Если Вам нужно создать колонки типа газетных, или такие, как в бюллетенях и брошюрах, то нужно настроить программу Word так, чтобы она соответствующим образом отформатировала Ваш текст. Можно оформить в виде нескольких колонок весь текст документа или только выделенную его часть.<br />
Лучше набирать текст документа до разбиения на несколько колонок.<br />
2.Скопировать набранный фрагмент текста два раза (<b><i>Правка – Копировать</i></b>, <b><i>Правка - Вставить</i></b>).<br />
3.Выделить первый фрагмент и разбить его на две колонки с разделителем (<b><i>Формат</i></b> - <b><i>Колонки</i></b>).<br />
4.Выделить второй фрагмент текста и разбить его на три колонки (<b><i>Формат – Колонки</i></b>).<br />
<b>Задание 2</b>. Оформление документов буквицей.<br />
В каждый абзац документа добавить буквицу. Для добавления буквицы надо установить курсор на первую строку текста, а затем выбрать <b><i>Формат – Буквица</i></b>. Задать параметры: высота в строках – 2 см, расстояние от текста –<br />
0,5 см.<br />
<b>Задание 3</b>. Изменение регистра шрифта и направления текста.<br />
1.Выделяя отдельные строки третьего фрагмента текста и пользуясь командой <b><i>Формат - Регистр</i></b>, отформатировать текст следующим образом:<br />
первая строка – все прописные; вторая строка – все строчные; третья стро-<br />
ка – начинать с прописных; четвертая строка – изменить регистр; пятая строка – как в предложениях.<br />
2.Набрать таблицу, провести форматирование текста в таблице, изменить направление текста (<b><i>Формат – Направление текста</i></b>) и выровнять текст в ячейке (<b><i>Таблица – Свойства таблицы</i></b> – <b><i>Ячейка</i></b>).<br />
<img src="img/img-19.png"><br />
<b>Дополнительное задание </b>Набрать текст по образцу:<br />
Чтобы оформить текст в виде нескольких колонок, нужно выполнить следующие действия:<br />
<img src="img/img-20.png"><br />
Чтобы быстро добавить несколько колонок и дать программе Word самой отрегулировать интервал между ними, нужно выделить текст, который будет форматироваться, а затем щелкнуть по панели инструментов Колонки. Перетащив мышь вправо, чтобы выделить нужное число колонок, и отпустив кнопку, Word отформатирует текст соответствующим образом.<br />
Если оформлять текст в виде колонок, выровненных по правому краю, то, возможно, придется использовать переносы в тексте документа. В колонках, текст которых выровнен, часто содержится много лишних пробелов, которые Word вставляет для того, чтобы произвести выравнивание по правому краю.<br />

                </strong>
          </p>
          </tab-pane>
          <tab-pane class="text-color">
            <template slot="label">
              ЛПЗ №4
            </template>
            <p class="blockquote blockquote-primary">
              <strong><strong class="name">СОЗДАНИЕ СПИСКОВ В ТЕКСТОВЫХ ДОКУМЕНТАХ </strong><br />
<b>Цель работы: </b>Изучение информационной технологии создания списков в MS Word.<br />
При создании списков можно использовать два способа: задать параметры списка в процессе набора текста или наложить вид списка после набора текста.<br />
<b>I способ</b>: задание параметров списка в процессе набора текста. <b>Образец текста с нумерованным списком </b>Элементарные операции информационного процесса включают:<br />
сбор, преобразование информации, ввод в компьютер; передачу информации; хранение и обработку информации; предоставление информации пользователю.<br />
1.Набрать первую строку образца текста, нажать [Enter].<br />
2.Нажать в панели инструментов кнопку <b><i>Нумерация</i></b>, появится цифра 1 или выбрать команду меню <b><i>Формат – Список</i></b>, вкладка <b><i>Нумерованный</i></b>.<br />
3.Набрать текст первого пункта и нажать [Enter]. Точка ввода переместится на следующую строку, которая сразу получает порядковый номер (2, 3 и т.д.). Набрать остальные пункты списка.<br />
3.Преобразовать уже готовый список из нумерованного в маркированный. Для этого выделить все пункты списка и нажать кнопку <b><i>Маркер</i></b> или выбрать команду меню <b><i>Формат – Список</i></b>, вкладка <b><i>Маркированный. </i></b><br />
<b>II способ</b>: наложение параметров списка после набора текста.<br />
1.Набрать текст по приведенному образцу, расположенному ниже. Строки (будущие элементы списка) ввести как отдельные абзацы, нажимая [Enter] в конце каждой строки.<br />
<strong>Образец текста</strong>
Элементарные операции информационного процесса включают в себя: сбор, преобразование информации, ввод в компьютер; передачу информации; хранение и обработку информации; предоставление информации пользователю.<br />
2.Скопировать набранный фрагмент текста 4 раза (<b><i>Правка – Копировать, Правка – Вставить</i></b>).<br />
3.Сформировать одноуровневый нумерованный список. Для этого выделить списочную часть первого фрагмента (2<b><i>–</i></b>5 строки), задать команду <b><i>Формат</i></b> – <b><i>Список</i></b>, выбрать вкладку <b><i>Нумерованный</i></b> и выбрать вид обычной нумерации, нажать ОК.<br />
4.Выделить списочную часть второго фрагмента (2<b><i>–</i></b>5 строки) и сформировать одноуровневый маркированный список. Для этого использовать команду <b><i>Формат – Список</i></b>, выбрать вкладку <b><i>Маркированный</i></b> и задать вид маркера списка.<br />
5.Выделить списочную часть третьего фрагмента (2<b><i>–</i></b>5 строки) и сформировать многоуровневый нумерованный список. Для этого использовать команду <b><i>Формат – Список</i></b>, выбрать вкладку <b><i>Многоуровневый</i></b> и выбрать вид многоуровневого нумерованного списка. Произойдет нумерация в первом уровне списка. Чтобы увидеть нумерацию второго и т.д. уровней, необходимо увеличить отступ кнопкой панели инструментов <b><i>Увеличить отступ</i></b>.<br />
6.Выделить списочную часть четвертого фрагмента (2<b><i>–</i></b>5 строки) и сформировать многоуровневый маркированный список. Для этого использовать команду <b><i>Формат – Список</i></b>, выбрать вкладку <b><i>Многоуровневый</i></b> и вид многоуровневого маркированного списка.<br />
Для изменения вида маркеров по уровням, в окне <b><i>Список</i></b> после выбора маркированного списка нажать кнопку <b><i>Изменить</i></b>. В открывшемся окне <b><i>Изменение многоуровневого списка</i></b> задать уровень списка и выбрать вид маркера для этого уровня (в зоне <b><i>Нумерация</i></b>). Если не устраивает вид маркера в зоне <b><i>Нумерация</i></b>, выбрать в этой же зоне команду <b><i>Новый маркер</i></b>, при этом откроется таблица символов. Подобрать новый вид маркера и нажать <b><i>ОК</i></b>. Произойдет нумерация маркерами в первом уровне списка. Чтобы увидеть нумерацию маркерами второго, третьего и т.д. уровней, необходимо увеличить отступ кнопкой панели инструментов <b><i>Увеличить отступ</i></b>.<br />
<strong>Дополнительное задание 1</strong>
Набрать в текстовом редакторе Microsoft Word списки (одноуровневые и многоуровневые) по следующим образцам:<br />
<strong>Копирование текста методом перетаскивания</strong>
<ol>
	<li>Определить текст, который необходимо скопировать, а также его место назначения.</li>
	<li>Выделить текст и перетащить его при нажатой кнопке мыши в новое место. Отпустить кнопку мыши, где должен появиться копируемый фрагмент.</li>
	<li>В раскрывшемся меню выбрать пункт <b><i>Копировать</i></b>.</li>
</ol>
<img src="img/img-21.png"><br />
<b><u>Копирование текста методом перетаскивания</u> </b><br />
 Определить текст, который необходимо скопировать, а также его место назначения.<br />
 Выделить текст и перетащить его при нажатой кнопке мыши в новое место. Отпустить кнопку мыши там, где должен появиться копируемый фрагмент.<br />
 В раскрывшемся меню выбрать пункт <b><i>Копировать</i>.</b><br />
<img src="img/img-22.png"><br />
а) Определить текст, который необходимо скопировать, а также его место<br />
назначения.<br />
б) Выделить текст и перетащить его при нажатой кнопке мыши в новое ме-<br />
сто. Отпустить кнопку мыши там, где должен появиться копируемый фрагмент.<br />
в) В раскрывшемся меню выбрать пункт <b><i>Копировать</i>. </b><br />
<strong>Копирование текста методом перетаскивания</strong>
1) Определить текст, который необходимо скопировать, а также его место на- значения.<br />
а) Выделить текст и перетащить его при нажатой кнопке мыши в новое ме- сто. Отпустить кнопку мыши там, где должен появиться копируемый фрагмент.<br />
 i) В раскрывшемся меню выбрать пункт <b><i>Копировать</i>.</b><br />
<img src="img/img-23"><br />
<strong>Дополнительное задание 2</strong>
Создать таблицу и ввести указанные элементы списка как отдельные абзацы (текст вводится в первую колонку, а в остальные колонки – копируется).<br />
Оформить текст различными видами списков по приведенному образцу.<br />
<img src="img/img-24.png"><br />
              </strong>
            </p>
          </tab-pane>
          <tab-pane class="text-color">
            <template slot="label">
              ЛПЗ №5
            </template>
            <p class="blockquote blockquote-primary">
              <strong><strong class="name">СОЗДАНИЕ И ФОРМАТИРОВАНИЕ ТАБЛИЦ</strong><br />
              <b>Цель работы: </b>Изучение информационной технологии создания и форматирования таблиц в MS Word<br />
<b>Задание 1. </b>Создание и форматирование таблицы.<br />
1.Установить параметры страницы, используя команду <b><i>Файл – Параметры страницы</i></b>:<br />
 размер бумаги – А4; ориентация – книжная; левое поле – 3 см; правое поле – 2 см;верхнее поле – 3 см;нижнее поле – 2,5 см2.Установить формат абзаца:первая строка – отступ; межстрочный интервал – полуторный.3.Создать таблицу (2 столбца, 11 строк), используя команду <b><i>Таблица – Добавить – Таблица</i></b> или кнопку <b><i>Добавить таблицу</i></b> на панели инструментов.
<img src="img/img-25.png"><br />
4.Изменить ширину колонок по образцу. Навести стрелку мыши на вертикальный разделитель таблицы, при этом стрелка мыши примет вид разделителя; нажатием и продвижением разделителя левой кнопкой мыши задать нужную ширину столбцов таблицы.<br />
Изменение размеров ячеек можно производить, используя свойства таблиц. Для этого установить курсор внутри таблицы, в меню <b><i>Таблица</i></b> выбрать команду <b><i>Свойства таблицы</i></b>. В появившемся диалоговом окне на вкладке <b><i>Таблица</i></b> можно изменить размер, выравнивание, обтекание. На вкладке <b><i>Строка</i></b> изменяется высота строк, а на вкладке <b><i>Столбец</i></b> – ширина столбцов, на вкладке <b><i>Ячейка</i></b> – размер ячейки. Автоподбор параметров таблицы можно произвести командой меню <b><i>Таблица – Автоподбор</i></b>. Microsoft Word производит автоматический подбор ширины столбцов или строк в зависимости от ширины листа и объема текста в каждой ячейке.<br />
5.Выделить первую строку таблицы и задать тип выравнивания – по центру.<br />
6.Выделить второй столбец таблицы и задать тип выравнивания – по центру.<br />
7.Сохранить файл в Вашей папке с именем <b>Таблица1 </b>(команда меню <b><i>Файл</i></b> <b><i>– Сохранить как).</i></b><br />
8.Произвести автоформатирование таблицы (команда меню <b><i>Таблица – Автоформат таблицы</i></b>).<br />
9.Сохранить отформатированную таблицу в вашей папке с именем <b>Таблица2 </b>(команда меню <b><i>Файл - Сохранить как</i></b>).<br />
<b>Задание 2. </b>Набрать таблицы по образцу.<br />
Для объединения или разбиения ячеек следует выделить группу ячеек и применить команду <b><i>Таблица – Объединить ячейки</i></b> или <b><i>Таблица – Разбить ячейки</i></b>. Для изменения ширины одной ячейки необходимо выделить ее, затем изменить ширину ячейки.<br />
<img src="img/img-26.png"><br />
<img src="img/img-27.png"><br />
              </strong>
            </p>
          </tab-pane>
          <tab-pane class="text-color>">
            <template slot="label">
              ЛПЗ №6
              </template>
              <p class="blockquote blockquote-primary">
                <strong><strong class="name">ВСТАВКА ОБЪЕКТОВ В ДОКУМЕНТ. ПОДГОТОВКА К ПЕЧАТИ </strong>
                <b>Цель работы: </b>Изучение информационной технологии вставки объектов в текст MS Word.<br />
<b>Задание 1. </b>Вставка в текст объектов WordArt.<br />
С помощью WordArt создать заголовок документа:<br />
<b>Задание 2.</b> Вставка в текст рисунков.<br />
1.Вставить автофигуры (<b><i>Вставка – Рисунок – Автофигуры</i></b>):<br />
<img src="img/img-28.png"><br />
2.Вставить три рисунка в текст документа с помощью команд <b><i>Вставка – Рисунок – Картинки</i></b>:<br />
<img src="img/img-29.png"><br />
Для изменения размера рисунка необходимо активизировать его (щелчком мыши по рисунку) и переместить маркер рисунка на новое место. Перемещение рисунка по документу производится путем перетаскивания его мышью.<br />
<b>Задание 3.</b> Форматирование рисунков.<br />
1.Открыть любой файл, созданный Вами. Вставить в него рисунок для изучения форматирования. Установить различные виды обтекания рисунка текстом (выделить рисунок командой <b><i>Формат - Рисунок</i></b> – вкладка <b><i>Положение</i></b>).<br />
Обратите внимание, как изменяется положение текста относительно рисунка.<br />
2.Произвести обрезку рисунка на 0,5 см (<b><i>Формат – Рисунок </i></b>– вкладка <b><i>Рисунок</i></b>).<br />
3.Выполнить заливку фона рисунка (<b><i>Формат – Рисунок</i></b> – вкладка <b><i>Цвета и линии</i></b>).<br />
4.Сохранить документ в своей папке с именем «Документ 6» (<b><i>Файл – Сохранить как</i></b>).<br />
<b>Задание 4</b>. Подготовка документа к печати.<br />
К параметрам страницы относятся размеры листа, поля (расстояние от края страницы до текста), расстояние от края листа до колонтитула и ориентация страницы. Параметры страницы задаются командой <b><i>Файл – Параметры страницы</i></b>, вкладками <b><i>Поля</i></b> и <b><i>Размер бумаги</i></b>.<br />
1.Подготовить любой документ к печати. Установить параметры страницы:<br />
верхнее поле – 1,5см; нижнее поле – 1,5 см; левое поле – 3 см; правое поле – 1 см; расстояние от края до верхнего колонтитула – 1 см; ориентация – книжная.<br />
2.Задать нумерацию страниц (<b><i>Вставка – Номера страниц</i></b>), положение – вверху страницы, выравнивание – справа, с номером на первой странице.<br />
3.Проверить орфографию (<b><i>Сервис – Правописание</i></b> или клавиша [F7]).<br />
4.Задать автоматическую проверку орфографии (<b><i>Сервис – Параметры</i></b> – вкладка <b><i>Правописание</i></b>), отметить галочкой позицию <b><i>Автоматически проверять орфографию</i></b>.<br />
5.Выполнить предварительный просмотр документа (<b><i>Файл – Предварительный просмотр</i></b>). Задать просмотр нескольких страниц. Если небольшая часть текста в конце документа расположена на отдельном листе, воспользуйтесь кнопкой <b><i>Подгонка страниц</i></b>, при этом программа уменьшит размер шрифта и интервалы.<br />
<b>Задание 5. </b>Печать документа.<br />
1.Для печати всего документа в одном экземпляре использовать кнопку панели инструментов <b><i>Печать</i></b>.<br />
2.Для печати диапазона страниц или нескольких копий выполнить следующие действия: <b><i>Файл – Печать</i></b>, задать номера страниц для печати – 1, 3 и количество копий – 2.<br />
3.Для печати фрагмента документа выделить фрагмент, дать команду <b><i>Формат – Печать</i></b> и установить переключатель страниц в положение – <b><i>Выделенный фрагмент</i></b>.<br />
<b>Дополнительное задание </b>Набрать текст по образцу.<br />
<h3>Виды обтеканий рисунков текстом</h3>
В компьютере для записи чисел используется двоичная система счисления,<br />
т.е. любое число записывается в виде сочетания двух цифр – 0 и 1. Почему? Просто двоичные числа проще всего реализовать технически: 0 – нет сигнала, 1<br />
– есть сигнал (напряжение или ток).<br />
<i>В ком-пьютере для записи чисел ис- пользуется двоичная система счисления, т.е. любое число записывается в виде сочетания двух цифр – 0 и 1. Почему? Просто двоичные числа проще всего реализовать технически: 0 – нет сигнала, 1 – есть сигнал (напряжение или ток). </i><br />
В компьютере для записи чисел используется двоичная система счисления,<br />
т.е. любое число записывается в виде сочетания двух цифр – 0 и 1. Почему?<br />
Просто двоичные числа проще всего реализовать технически: 0 – нет сигнала, 1<br />
– есть сигнал (напряжение или ток).<br />
В компьютере для записи чисел используется двоичная система счисления,<br />
т.е. любое число записывается в виде сочетания двух цифр – 0 и 1. Почему? Просто двоичные числа проще всего реализовать технически: 0 – нет сигнала, 1<br />
– есть сигнал (напряжение или ток).<br />
В компьютере для записи чисел используется двоичная система счисления,<br />
т.е. любое чи<u>с</u>ло записывается в виде сочетания двух цифр – 0 и 1. Почему? Просто двоичные числа проще всего реализовать технически: 0 – нет сигнала, 1 – есть сигнал (напряжение или ток).<br />
<img src="img/img-30.png"><br />
                </strong>
              </p>
          </tab-pane>
          <tab-pane class="text-color">
            <template slot="label">
              ЛПЗ №7
            </template>
            <p class="blockquote blockquote-primary">
              <strong><strong class="name">СОЗДАНИЕ ДЕЛОВЫХ ДОКУМЕНТОВ В РЕДАКТОРЕ  MICROSOFT WORD</strong>
<b>Цель работы: </b>Изучение информационной технологии создания, сохранения и подготовки к печати документов MS Word.<br />
<b> </b><br />
<b>Задание 1. </b>Оформить приглашение по образцу.<br />
1.Установить параметры страницы (размер бумаги –А4; ориентация – книжная; левое поле – 3 см; правое поле – 1,5см; верхнее поле – 3 см; нижнее поле – 1,5см), используя команду <b><i>Файл</i></b> - <b><i>Параметры</i></b> <b><i>страницы</i></b> (вкладка <b><i>Поля</i></b> и <b><i>Размер</i></b> <b><i>бумаги</i></b>).<br />
2.Установить межстрочный интервал – полуторный, выравнивание – по центру, используя команду <b><i>Формат</i></b> – <b><i>Абзац</i></b> (вкладка <b><i>Отступы</i></b> <b><i>и</i></b> <b><i>интервалы</i></b>).<br />
3.Набрать текст приглашения.<br />
<img src="img/img-31.png"><br />
В процессе набора текста менять начертание, размер шрифта (для заголовка – 14 пт.; для основного текста – 12 пт., типы выравнивания абзаца – по центру, по ширине, по правому краю), используя кнопки на панелях инструментов.<br />
4.Заключить текст приглашения в рамку и произвести цветовую заливку.<br />
Для этого<br />
а)выделить весь текст приглашения;<br />
б)выполнить команду <b><i>Формат – Границы и заливка</i></b>;<br />
в)на вкладке <b><i>Граница</i></b> установить параметры границ: тип – рамка; ширина<br />
линии – 3 пт.; применить – к абзацу; цвет линии – по Вашему усмотрению;<br />
г)на вкладке <b><i>Заливка</i></b> выбрать цвет заливки;<br />
д)указать условие применения заливки – применить к абзацу;<br />
е)нажать кнопку ОК.<br />
5.Вставить рисунок в текст приглашения (<b><i>Вставка</i></b> – <b><i>Рисунок</i></b> – <b><i>Картинки</i></b>); задать положение текста относительно рисунка – Вокруг рамки (<b><i>Формат</i></b> – <b><i>Рисунок</i></b> – <b><i>Положение</i></b> - <b><i>Вокруг</i></b> <b><i>рамки</i></b>).<br />
6.Скопировать дважды на лист типовое приглашение (<b><i>Правка</i></b> – <b><i>Копировать</i></b>, <b><i>Правка</i></b> – <b><i>Вставить</i></b>).<br />
7.Отредактировать лист с полученными двумя приглашениями и подготовить к печати (<b><i>Файл</i></b> – <b><i>Предварительный</i></b> <b><i>просмотр</i></b>).<br />
8.Сохранить файл в Вашей папке (команда <b><i>Файл</i></b> – <b><i>Сохранить</i></b> <b><i>как</i></b>…).<br />
<b>Задание 2.</b> Оформить докладную записку по образцу.<br />
Верхнюю часть докладной записки оформить в виде таблицы (2 столбца и 2 строки; тип линий – нет границ). Этот прием оформления позволит выполнить разное выравнивание в ячейках таблицы: в левой ячейке – по левому краю; в правой – по центру. <b>Образец задания </b><br />
<b> </b><br />
Сектор аналитики и экспертизы Директору Центра ГАНЛ<br />
 Н.С.Петрову<br />
<h3>ДОКЛАДНАЯ ЗАПИСКА</h3>
03.10.2012<br />
Сектор не может завершить в установленные сроки экспертизу проекта маркетингового исследования фирмы «Астра – Н» в связи с отсутствием полных сведений о финансовом состоянии фирмы.<br />
Прошу дать указания сектору технической документации предоставить полные сведения по данной фирме.<br />
Приложение: протокол о некомплектности технической документации фирмы «Астра – Н».<br />
Руководитель сектора<br />
аналитики и экспертизы (подпись) М.П.Спелов<br />
<b>Дополнительные задания Задание 3.</b> Оформить рекламное письмо по образцу.<br />
Верхнюю часть рекламного письма оформить в виде таблицы (3 столбца и 2 строки; тип линий – нет границ, кроме разделительной линии между строками). Произвести выравнивание в ячейках таблицы: первая строка – по центру; вторая строка – по левому краю.<br />
<img src="img/img-32.png"><br />
<h3>РУКОВОДИТЕЛЯМ ФИРМ, ПРЕДПРИЯТИЙ, БАНКОВ И СТРАХОВЫХ КОМПАНИЙ</h3>
Международный институт «Работа и управление» предлагает Вашему вниманию и вниманию Ваших сотрудников программу «Имидж фирмы и управляющий персонал».<br />
Цель программы: Формирование положительного имиджа фирмы (приобретение сотрудниками фирмы коммуникативных и этикетных навыков).<br />
Продолжительность курса – 20 ч.<br />
Предлагаемая тематика:<br />
1.Психология делового общения.<br />
2.Деловой этикет.<br />
3.Культура внешнего вида персонала фирмы.<br />
В реализации проекта участвуют опытные психологи, культурологи, медики, визажисты, модельеры.<br />
По окончании обучения слушателям выдается удостоверение Международного института «Работа и управление» по программе повышения квалификации.<br />
Надеемся на плодотворное сотрудничество, понимая исключительную важность и актуальность предлагаемой нами тематики.<br />
Ректор (подпись) Е.В.Добрынина<br />
<b>Задание 4.</b> Оформить заявление по образцу.<br />
Верхнюю часть заявления оформить в виде таблицы (2 столбца и 1 строка; тип линий – нет границ) или в виде надписи инструментами панели <b><i>Рисование</i></b>.<br />
Произвести выравнивание в ячейках по левому краю и по центру.<br />
<img src="img/img-33.png"><br />
Прошу принять меня на работу на должность главного специалиста.<br />
 (подпись) О.И. Коврова<br />
<b>Задание 5.</b> Создать справку личного характера.<br />
<h4>Образец задания</h4>
ОАО «Вестор»<br />
СПРАВКА<br />
08.10.2012 № 45<br />
Васильева Ольга Ивановна работает в должности ведущего специалиста ОАО «Вестор».<br />
Должностной оклад – 17550 руб.<br />
Справка выдана для предоставления по месту требования.<br />
Начальник отдела кадров (подпись) П.П.Смелов <b>Задание 6.</b> Создать краткий протокол.<br />
<h4>Образец задания</h4>
ОАО «Вестор»<br />
ПРОТОКОЛ<br />
08.10.2012 № 6<br />
Заседания Совета директоров<br />
Председатель – А.С.Серов<br />
Секретарь – Н.С.Иванчук<br />
Присутствовали: 7 человек (список прилагается)<br />
Приглашенные: Заместитель директора «Книжной палаты» Н.И.Стрелков.<br />
РАССМОТРЕННЫЕ ВОПРОСЫ:<br />
1.Организационные вопросы.<br />
2.О проекте иллюстрированного издания о деятельности фирмы.<br />
ПРИНЯТЫЕ РЕШЕНИЯ:<br />
1.А.А.Сидорову подготовить проект штатного расписания на 2008 г.<br />
2.Поручить члену научно-информационной комиссии К.С.Петрову согласовать проект издания с «Книжной палатой».<br />
Председатель (подпись) А.С.Серов Секретарь (подпись) Н.С.Иванчук<br />
<b>Задание 7.</b> Создать Акт о списании имущества.<br />
<h4>Образец задания</h4>
<b> </b><br />
 ООО «Прогресс» УТВЕРЖДАЮ<br />
 АКТ Генеральный директор<br />
 03.09.2012 № 17 ______________________ А.В. Орлов<br />
 Вологда 05.09.2012<br />
О списании имущества<br />
Основание: приказ генерального директора ООО «Прогресс» от 25.08.2012 № 1 «О проведении инвентаризации».<br />
Составлен комиссией в составе: председатель – коммерческий директор А.Л.Диева члены комиссии: 1.Главный бухгалтер Л.Д.Жданова<br />
 2.Начальник административно-хозяйственного отдела<br />
 Л.Д.Роклеев<br />
Присутствовали: кладовщица Р.Л.Крылова.<br />
В период с 26.08.2012 по 03.09.2012 комиссия провела работу по установлению непригодности для дальнейшего использования имущества.<br />
Комиссия установила: согласно прилагаемому к акту перечню подлежит списанию имущество в связи с непригодностью его использования.<br />
<img src="img/img-34.png"><br />
              </strong>
            </p>
          </tab-pane>
          <tab-pane class="text-color">
            <template slot="label">
              ЛПЗ №8
            </template>
            <p class="blockquote blockquote-primary">
              <strong><strong class="name">ОФОРМЛЕНИЕ ТЕКСТОВЫХ ДОКУМЕНТОВ, СОДЕРЖАЩИХ ТАБЛИЦЫ </strong>
              <b>Цель работы: </b>Изучение технологии создания и форматирования документов, содержащих таблицы.<br />
<b>Задание 1.</b> Создать таблицу с автоформатом, рассчитать сумму столбца.<br />
1.Создать таблицу (число столбцов – 8; число строк – 7) с автоформатом, используя команды <b><i>Таблица – Добавить – Таблица – Автоформат – Столбцы таблицы 5</i></b>. Оформить таблицу по образцу.<br />
2.Ввести в таблицу произвольные данные.<br />
3.Рассчитать сумму столбца <i>Оклад</i>, используя команду <b><i>Таблица</i></b> – <b><i>Формула</i></b>. Установить курсор в ячейку <i>Оклад</i> – <i>Итого</i>. В строке <i>Формула</i> ввести<br />
=SUM(ABOVE). В строке <i>Формат</i> <i>числа</i> выбрать: ### 0,00.<br />
<img src="img/img-35.png"><br />
<b>Задание 2.</b> Создать таблицу, используя табуляцию.<br />
Перед набором табличных данных расставить табуляторы определенного вида на горизонтальной линейке. Вид табулятора и его положение на линейке приведены ниже:<br />
для 1-й колонки – (с выравниванием слева) 1,5 см для 2-й колонки – (с выравниванием по центру) 7,5 см для 3-й колонки – (с выравниванием по десятичной запятой) 10,5 см<br />
Табуляторы выбрать в левом углу линейки и установить на линейке одинарным щелчком мыши или задать командой <b><i>Формат</i></b> – <b><i>Табуляция</i></b>. Набрать таблицу в виде столбцов, используя табуляцию.<br />
<img src="img/img-36.png"><br />
<b>Задание 3.</b> Создать таблицу, используя объединение ячеек.<br />
Набрать таблицу изменения роста поставок компьютерного оборудования за 2005–2009 годы, используя объединение ячеек (<b><i>Таблица</i></b> – <b><i>Объединить</i></b> <b><i>ячейки</i></b>).<br />
<img src="img/img-37.png"><br />
<h4>Дополнительные задания</h4>
<b>Задание 4.</b> Оформить документ, содержащий таблицу, по образцу. Произвести расчет штатной численности по каждой группе оплаты труда.<br />
Верхнюю часть документа оформить с использованием таблицы (тип линий – нет границ). Произвести расчет суммы по столбцам. Дату вставить командой <b><i>Вставка</i></b> – <b><i>Дата</i></b>.<br />
<table border="0"><tr><td>ОАО «Прогресс»<br />
</td>
<td>Утверждаю<br />
</td>
</tr>
<tr><td>23.09.2007 № 38 Москва<br />
</td>
<td>Генеральный директор<br />
_____________________ Б.Н.Добров<br />
03.10.2012<br />
</td>
</tr>
</table>
<img src="img/img-38.png"><br />
<b>Задание 5.</b> Оформить таблицу анализа объема выпуска продукции по изделиям в соответствии с образцом. Произвести расчеты в таблице.<br />
Для изменения направления текста выделить группу ячеек и использовать команду <b><i>Формат</i></b> – <b><i>Направление</i></b> <b><i>текста</i></b>.<br />
<img src="img/img-39.png"><br />
              </strong>
            </p>
          </tab-pane>
          <tab-pane class="text-color">
            <template slot="label">
              ЛПЗ №9 
            </template>
            <p class="blockquote blockquote-primary">
              <strong><strong class="name">СОЗДАНИЕ ТЕКСТОВЫХ ДОКУМЕНТОВ НА ОСНОВЕ ШАБЛОНОВ.  СОЗДАНИЕ ШАБЛОНОВ И ФОРМ </strong>
              <b>Цель работы: </b>Изучение информационной технологии создания документов MS Word с использованием шаблонов, создание шаблонов и форм.<br />
<b>Задание 1.</b> Создать докладную записку на основе шаблона.<br />
1.Создать на основе шаблона <b><i>Стандартная</i></b> <b><i>записка</i></b> докладную записку (<b><i>Файл</i></b> – <b><i>Создать</i></b> – вкладка <b><i>Записки</i></b> – <b><i>Стандартная</i></b> <b><i>записка</i></b>).<br />
Для использования шаблона докладной записки выделить текст, который следует заменить, и ввести текст своей записки. Чтобы сохранить созданный документ как шаблон, выбрать команду <b><i>Файл</i></b> – <b><i>Сохранить</i></b> <b><i>как</i></b>. В списке <b><i>Тип</i></b> <b><i>файла</i></b> выбрать <b><i>Шаблон</i></b> <b><i>документа</i></b>. Чтобы использовать сохраненный шаблон, выбрать команду <b><i>Файл</i></b> – <b><i>Создать</i></b>, а затем дважды щелкнуть мышью по нужному шаблону.<br />
<strong>Пример созданной докладной записки на основе шаблона</strong><br />
<img src="img/img-40.png"><br />
2.Сохранить созданный документ в Вашей папке.<br />
<b>Задание 2.</b> Создать календарь на текущий месяц с использованием шаблона.<br />
1.Создать календарь на текущий месяц с использованием шаблона. Для этого в окне создания документа (<b><i>Файл</i></b> – <b><i>Создать</i></b>) на вкладке <b><i>Другие</i></b> <b><i>документы</i></b> выбрать <b><i>Мастер</i></b> <b><i>создания</i></b> <b><i>календарей</i></b>.<br />
Последовательно выбирая стиль, ориентацию листа и месяц/год, создать календарь на текущий месяц.<br />
2.Сохранить документ в Вашей папке.<br />
<b>Задание 3.</b> Создать шаблон-форму «Календарь дел рабочей недели».<br />
Форма – это документ, который содержит следующие элементы: текст и графические элементы, которые не могут быть изменены; незаполненные области, в которые вводится информация.<br />
1.Создать документ «Календарь дел рабочей недели» по образцу.<br />
<b><i>Календарь дел рабочей недели </i></b><br />
На месяц<br />
<img src="img/img-41.png"><br />
2.Ввести поля в место ввода месяца и в ячейки таблицы. Для этого открыть панель инструментов <b><i>Формы</i></b> по команде <b><i>Вид</i></b> – <b><i>Панели</i></b> <b><i>инструментов</i></b> – <b><i>Формы</i></b>, установить курсор в то место документа, где задается поле формы для ввода, и нажать кнопку <b><i>Затенение</i></b> <b><i>полей</i></b> <b><i>формы</i></b> и <b><i>Текстовое</i></b> <b><i>поле</i></b> (<b>аб</b> | ). В документе появится затененное поле для ввода текста в форму.<br />
3.Установить защиту формы (<b><i>Сервис</i></b> – <b><i>Установить</i></b> <b><i>защиту</i></b>). Установить переключатель <b><i>Запретить</i></b> <b><i>любые</i></b> <b><i>изменения</i></b>, <b><i>кроме</i></b> в положение <b><i>Ввода</i></b> <b><i>данных</i></b> <b><i>в</i></b> <b><i>поля</i></b> <b><i>формы</i></b> или нажатием кнопки <b><i>Защита</i></b> <b><i>формы</i></b>.<br />
4.Сохранить форму как шаблон. Для этого при сохранении задать тип файла – шаблон документа, при этом файл получит расширение .dot. Закрыть шаблон-форму.<br />
5.Открыть вновь созданную шаблон-форму и заполнить поля формы. Сохранить созданный документ в Вашей папке.<br />
<b><i>Календарь дел рабочей недели </i></b><br />
На март месяц<br />
<img src="img/img-42.png"><br />
<strong>Дополнительные задания</strong>
<b>Задание 4.</b> Создать рекламное письмо на основе шаблона.<br />
Для создания рекламного письма использовать шаблон (<b><i>Файл – Создать</i></b> – вкладка <b><i>Письма и факсы – Стандартное письмо</i></b>).<br />
<strong>Содержание рекламного письма</strong>
<b> </b><br />
<img src="img/img-43.png"><br />
<strong>РУКОВОДИТЕЛЯМ ФИРМ, ПРЕДПРИЯТИЙ, БАНКОВ И СТРАХОВЫХ КОМПАНИЙ</strong>
Международный институт «Работа и управление» предлагает Вашему вниманию и вниманию Ваших сотрудников программу «Имидж фирмы и управляющий персонал».<br />
Цель программы: Формирование положительного имиджа фирмы (приобретение сотрудниками фирмы коммуникативных и этикетных навыков).<br />
Продолжительность курса – 20 ч.<br />
Предлагаемая тематика:<br />
1.Психология делового общения.<br />
2.Деловой этикет.<br />
3.Культура внешнего вида персонала фирмы.<br />
В реализации проекта участвуют опытные психологи, культурологи, медики, визажисты, модельеры.<br />
По окончании обучения слушателям выдается удостоверение Международного института «Работа и управление» по программе повышения квалификации.<br />
Надеемся на плодотворное сотрудничество, понимая исключительную важность и актуальность предлагаемой нами тематики.<br />
Ректор (подпись) Е.В.Добрынина<br />
<b> </b><br />
<b>Задание 5. </b>Создать резюме на основе шаблона.<br />
Для создания резюме использовать шаблон (<b><i>Файл</i></b> – <b><i>Создать</i></b> – вкладка <b><i>Другие</i></b> <b><i>документы</i></b> – <b><i>Современное</i></b> <b><i>резюме</i></b>).<br />
<b> </b><br />
<b>Задание 6. </b>Создать форму-шаблон расписания занятий.<br />

              </strong>
            </p>
          </tab-pane>
          <tab-pane class="text-color">
            <template slot="label">
              ЛПЗ №10
            </template>
            <p class="blockquote blockquote-primary">
              <strong><strong class="name">СОЗДАНИЕ КОМПЛЕКСНЫХ ДОКУМЕНТОВ  В ТЕКСТОВОМ РЕДАКТОРЕ </strong>
<b>Цель работы: </b>Изучение технологии создания комплексных документов.<br />
<b>Задание 1.</b> Создать текстовый документ, содержащий рисунок в виде схемы и маркированный список.<br />
1.Развернуть окно редактора на весь экран. Установить вид «Разметка страницы», масштаб – 85%.<br />
2.Задать все поля страницы по 2,5 см<br />
3.Перед началом набора текста установить размер шрифта – 12 пт.; вид – курсив и гарнитуру шрифта – Times New Roman Cyr.<br />
4.По команде <b><i>Формат</i></b> – <b><i>Абзац</i></b> задать следующие параметры: межстрочный интервал – множитель 1,2; выравнивание – по ширине.<br />
5.По команде <b><i>Сервис</i></b> – <b><i>Язык</i></b> – <b><i>Расстановка</i></b> <b><i>переносов</i></b> установить автоматическую расстановку переносов.<br />
6.Набрать образец текста. Образец содержит один абзац текста, рисунок в виде схемы и маркированный список. Для создания схемы использовать панель <b><i>Рисование</i></b> (<b><i>Вид</i></b> – <b><i>Панели</i></b> <b><i>инструментов</i></b> – <b><i>Рисование</i></b>). После создания схемы провести группировку для того, чтобы вся схема воспринималась как единый графический объект. Для этого выделить всю схему при помощи кнопки <b><i>Выбор</i></b> <b><i>объекта</i></b> панели <b><i>Рисование</i></b>, нажать на кнопку <b><i>Действия</i></b> и выбрать команду <b><i>Группировать</i></b>. Для создания списка использовать команду <b><i>Формат</i></b> – <b><i>Список</i></b> – <b><i>Маркированный</i></b>.<br />
<h3>Образец текста</h3>
<b> </b><br />
<i>Информационное письмо </i><br />
Методология планирования материальных ресурсов производства (MRP) обеспечивает ситуацию, когда каждый элемент производства, каждая комплектующая деталь находится в нужное время в нужном количестве (рис.4.1).<br />
На основании входных данных MRP-система выполняет следующие операции:<br />
<img src="img/img-44.png"><br />
<h4>Рис. 4.1. Структурная схема MRP</h4>
• определяется количество конечных данных изделий для каждого периода времени планирования;<br />
• к составу конечных изделий добавляются запасные части;<br />
• определяется общая потребность в материальных ресурсах в соответствии с ведомостью материалов и составом изделия;<br />
• общая потребность материалов корректируется с учетом состояния запасов для каждого периода времени планирования;<br />
• осуществляется формирование заказов на пополнение запасов с учетом необходимого времени опережения.<br />
7.Проверить введенный текст с точки зрения грамматики командой <b><i>Сервис – Правописание</i></b>. Исправить все найденные ошибки. Сохранить документ.<br />
<b>Задание 2.</b> Приемы работы с многостраничным текстовым документом.<br />
1.Скопировать созданный документ в задании 1 четыре раза, пользуясь пунктами меню <b><i>Правка – Копировать </i></b>и<b><i> Правка – Вставить </i></b>или соответствующими кнопками на панели инструментов.<br />
Выполнить принудительное разделение на страницы после каждого информационного письма клавишами [Ctrl + Enter]. В результате этих действий каждое информационное письмо будет располагаться на новой странице.<br />
Задать нумерацию страниц (вверху страниц, справа) командой <b><i>Вставка – Номера страниц</i></b>.<br />
2.Отформатировать первый абзац текста каждого информационного письма командами <b><i>Формат – Абзац </i></b>следующим образом:<br />
1-е письмо: шрифт Times New Roman Cyr, 12, с красной строкой (отступом); выравнивание – по ширине;<br />
2-е письмо: шрифт Arial Cyr, 14, с висячей строкой (выступом); выравнивание – по левой границе; абзацные отступы – по 2 см слева и справа;<br />
3-е письмо: шрифт Times New Roman Cyr, 10, первая строка абзаца без отступа и выступа; выравнивание – по ширине;<br />
4-е письмо: фрагмент отформатировать, как во втором письме, пользуясь режимом <b><i>Формат по образцу</i></b>, который вызывается кнопкой на панели инструментов.<br />
5-е письмо: первый абзац отформатировать, как в третьем письме, пользуясь режимом <b><i>Формат по образцу. </i></b><br />
3.Задать стиль заголовков на каждой странице, используя шаблоны стилей. Для этого выделить заголовок и командой <b><i>Формат – Стиль</i></b> задать стиль <b><i>Заголовок 2.</i></b><br />
4.Создать оглавление документа. Установить курсор в самое начало документа, выполнить команду <b><i>Вставка – Оглавление и указатели</i></b>. Используя оглавление, перейти на третью страницу документа.<br />
5.После первого письма поместить закладку, используя команду <b><i>Вставка</i></b> – <b><i>Закладка</i></b>, с именем <b><i>Письмо1</i></b>. Имя закладки не должно содержать пробелы.<br />
6.Установить курсор в конце третьего письма. Поставить обычную сноску внизу документа с текстом <b><i>Третье письмо. </i></b><br />
7.Вставить в конце каждого письма свою фамилию, имя и отчество, пользуясь командами <b><i>Сервис – Автозамена</i></b>. Предварительно выполнить следующие действия:<br />
а)командой <b><i>Сервис</i></b> – <b><i>Автозамена</i></b> активизировать диалоговое окно <b><i>Авто-</i></b><br />
<b><i>замена</i></b>;<br />
б) в поле <b><i>Заменить</i></b> ввести символ наклонной черты ( \ );<br />
в) в поле <b><i>На</i></b> набрать полностью свою ФИО;<br />
г) нажать кнопки <b><i>Добавить</i></b>, <b><i>ОК</i></b>.<br />
Перейти к первому абзацу с помощью закладки через команды <b><i>Правка – Перейти - Закладка – Письмо1. </i></b><br />
Ввести с клавиатуры символ ( \ ) – появятся Ваши ФИО. Далее поставить ФИО после каждого письма.<br />
8.Пользуясь командой <b><i>Формат – Регистр</i></b>, переформатировать текст первого абзаца каждого письма следующим образом:<br />
письмо 1 – Все прописные; письмо 2 – Все строчные; письмо 3 – Начинать с прописных; письмо 4 – Изменить регистр; письмо 5 – Как в предложениях.<br />
9.Сохранить созданный документ с типом файла «Web-страница». Закрыть документ и вновь открыть его. Обратите внимание, что документ открывается в обозревателе Internet Explorer.<br />
<h3>Дополнительные задания</h3>
<b> </b><br />
<b>Задание 3.</b> Оформить схемы по образцу.<br />
<img src="img/img-45.png"><br />
<img src="img/img-46.png"><br />
<img src="img/img-47.png"><br />
<img src="img/img-48.png"><br />
<b>Задание 4. </b>Оформить документ по образцу.<br />
<img src="img/img-49.png"><br />
• сбор, преобразование информации, ввод в компьютер;<br />
• передачу информации;<br />
• хранение и обработку информации;<br />
• предоставление информации пользователю.<br />
Все персональные компьютеры (ПК) можно разделить на несколько категорий:<br />
• мобильные компьютеры – карманные (ручные) и блокнотные, или планшетные ПК (ноутбук), а также телефоны-компьютеры;<br />
• базовые настольные ПК – универсальные компьютеры и ПК для «цифрового дома»;<br />
• специализированные ПК – сетевые компьютеры, рабочие станции и серверы высокого уровня;<br />
• суперкомпьютерные системы.<br />
Пути развития традиционной индустрии информационных технологий намечают корпорации Microsoft и Intel. Некий усредненный компьютер согласно стандарту РС 2001 имеет следующие параметры:<br />
<img src="img/img-50.png"><br />
<img src="img/img-51.png"><br />
<img src="img/img-52.png"><br />
              </strong>
            </p>
          </tab-pane>
          <tab-pane class="text-color">
            <template slot="label">
              ЛПЗ №11
            </template>
            <p class="blockquote blockquote-primary">
              <strong><strong class="name">КОМПЛЕКСНОЕ ИСПОЛЬЗОВАНИЕ ВОЗМОЖНОСТЕЙ MS WORD  ДЛЯ СОЗДАНИЯ ДОКУМЕНТОВ </strong>
<b>Цель работы</b>: Закрепление и проверка навыков создания комплексных текстовых документов.<br />
<b>Задание 1</b>. Создать документ по образцу.<br />
<img src="img/img-53.png"><br />
<img src="img/img-54.png"><br />
<img src="img/img-55.png"><br />
• Вычислительная техника является определяющим компонентом таких составляющих научно-технического прогресса, как робототехника и гибкие производственные системы, автоматизированные системы проектирования и управления.<br />
•   С широким внедрением вычислительной техники в народное хозяйство связывается возможность перевода его на путь интенсивного развития.<br />
•   Миниатюрная вычислительная машина (микропроцессор) становится составной частью практически любого прибора, устройства, агрегата.<br />
• Нет ни одной отрасли промышленности, где применение вычислительной техники не сулило бы существенного выигрыша в эффективности производства, совершенствования качества выпускаемой продукции.<br />
• С широким использованием вычислительной техники связываются планы по коренному совершенствованию систем телевизионной и телефонной связи, медицинского обслуживания населения, образования.<br />
<b>Задание 2.</b> Создать документ по образцу и произвести форматирование текста по всем вариантам, приведенным в таблице.<br />
<strong>ГРАФИЧЕСКИЙ РЕДАКТОР PAINT</strong>
Программа Paint – сравнительно простой графический редактор, который входит в комплект поставки Windows.<br />
Программа Paint позволяет создавать и редактировать произвольные рисунки, схемы, чертежи, диаграммы, надписи, вставлять и редактировать готовые объекты, созданные в других приложениях.<br />
Программа Paint является редактором растрового типа: графическое изображение в нем строится из отдельных точек – пикселей.<br />
Кроме растровых редакторов, для создания графических объектов используются также графические редакторы векторного типа. Векторные изображения существуют в виде набора математических формул, которые описывают отдельные элементы рисунка. Векторная графика легко масштабируется без потери качества изображения, тогда как при увеличении растрового рисунка его очертания могут принять грубый ступенчатый характер из-за увеличения размеров составляющих его точек.<br />
Процесс рисования в программе Paint осуществляется с помощью специального Набора инструментов и цветовой Палитры. Набор инструментов и Палитру цветов можно перемещать по экрану с помощью мыши. Выбор инструмента и цвета символа осуществляется щелчком левой кнопки мыши. Для выбора цвета фона и окраски цветом фона используется правая кнопка мыши.<br />
<img src="img/img-56.png"><br />
<b>Задание 3. </b>Создать меню студенческого кафе по образцу.<br />
<img src="img/img-57.png"><br />
<img src="img/img-58.png"><br />
<b>Задание 4. </b>Создать схему, отражающую процесс аудита в упрощенном варианте.<br />
<img src="img/img-59.png"><br />
<b>Задание 5. </b>Оформить схему по образцу.<br />
<img src="img/img-60.png"><br />
<b>Задание 6. </b>Создать документ, отражающий оформительские возможности редактора.<br />
<b>ВОЗМОЖНОСТИ РЕДАКТОРА MS WORD </b><br />
<img src="img/img-61.png"><br />
<img src="img/img-62.png"><br />
<b>Задание 7.</b> Оформить рекламно-информационное письмо.<br />
Логотип фирменного знака создать в графическом редакторе Paint и скопировать в текстовый документ.<br />
<img src="img/img-63.png"><br />
<img src="img/img-64.png"><br />
Если Вы ищете высококачественный цветной принтер для домашнего либо офисного использования, для покупки которого не хотелось бы платить излишне высокую цену, мы можем удовлетворить Ваш запрос. Мы производим новые принтеры EPSON STYLUS COLOR 640, обладающие превосходным фотореалистическим качеством печати при разрешении 720…1’440 dpi, и продаем их по цене, доступной практически для каждого пользователя! Принтер EPSON STYLUS COLOR 640 в сочетании с фирменной системой воспроизведения изображений PerfectPictureTM Imaging System и очень легким в использовании драйвером – это именно то техническое средство, появление которого Вы давно ждали.<br />
Благодаря запантетованной системе воспроизведения изображений PerfectPictureTM Imaging System принтер EPSON STYLUS COLOR 640 выдает отпечатки непревзойденного фотореалистического качества. Он оснащен прецизионной печатающей головкой Micro Pie-<br />
zoTM для печати изображений с высоким разрешением (до 1’440 dpi) и выполняет незаметные глазу переходы полутонов благодаря нашей гордости – системе растрирования AcuPhotoHalftoningTM. Быстросохнущие чернила QuickDry создают сочные и стойкие цвета. Даже на простой бумаге принтер делает отпечатки с высоким разрешением до 720 dpi, которые поразят Вас превосходным качеством и передачей мельчайших деталей.<br />

              </strong>
            </p>
          </tab-pane>
          <tab-pane class="text-color">
            <template slot="label">
              Вспомогательный раздел
            </template>
            <p class="blockquote blockquote-primary">
              <strong><strong class="name">Уроки по Word 2016</strong><br />
<b><u>1 урок — как пронумеровать страницы</u></b>
Это самая распространенная задача в Word. Используется практически для всех документов: будь то у вас диплом, курсовая, или просто вы печатаете документ для себя. Ведь если не задать номера страниц, то при распечатке документа все листы можно хаотично перепутать…<br />
Хорошо если у вас 5-10 страничек, которые можно логически разложить по порядку за несколько минут, а если их 50-100 или более?!<br />
<u>Чтобы вставить номера страниц в документ</u> — перейдите в раздел «<u>Вставка</u>«, затем в открывшемся меню найдите раздел «<u>Колонтитулы</u>«. В нем будет выпадающее меню с функции нумерации страниц (см. рис. 1).<br />
<img src="img/img-65.png" ><br />
Довольно распространена задача <u>нумерации страниц кроме первой</u> (или первых двух). Это актуально, когда на первой страничке титульный лист или содержание.<br />
Делается это довольно просто. Щелкаете двойным щелчком по самому номеру первой страницы: в верхней панели Word появиться дополнительное меню «<u>Работа с колонтитулами</u>«. Далее заходим в это меню и ставим галочку напротив пункта «<u>Особый колонтитул на первой странице</u>«. Собственно, на этом все — у вас нумерация пойдет со второй страницы (см. рис. 2).<br />
<i>Добавление</i>: если вам нужно поставить нумерацию с третьей страницы — то используйте в инструмент «Макет/вставка разрыва страницы»<br />
<img src="img/img-66.png" ><br />
<b><u>2 урок — как в Word сделать линию</u></b><br />
Когда спрашивают о линиях в Word, так сразу и не поймешь, что имеют ввиду. Поэтому я рассмотрю несколько вариантов, чтобы точно попасть в «цель». И так…<br />
Если вам нужно просто подчеркнуть линией какой-нибудь слово, — то в разделе «Главная» есть специальная функция для этого — «<u>Подчеркивание</u>» или просто буква «<u>Ч</u>«. Достаточно выделить текст или слово, а затем нажать на эту функцию — текст станет подчеркнутым линией (см. рис. 3).<br />
<img src="img/img-67.png" ><br />
Если же вам нужно вставить просто линию (неважно какую: горизонтальную, вертикальную, наискосок и пр.), то перейдите в раздел «<u>Вставка</u>» и выберите вкладку «<u>Фигуры</u>«. Среди разнообразных фигур есть и линия (вторая по списку, см. рис. 4).<br />
<img src="img/img-68.png" ><br />
Ну и наконец еще один способ: просто зажать на клавиатуре клавишу тире «-» (рядом с «Backspace»).<br />
<b><u>Урок 3 — как сделать красную строку</u></b><br />
В некоторых случаях необходимо оформить документ с конкретными требованиями (например, пишете курсовую и преподаватель четко оговорил, как она должна быть оформлена). Как правило, в этих случаях требуется выполнить красную строку для каждого абзаца в тексте. У многих пользователей возникает дилемма: как ее сделать, да и еще сделать точно нужного размера.<br />
Рассмотрим вопрос. Сначала необходимо включить инструмент «<u>Линейка</u>» (по умолчанию он в Word выключен). Для этого перейдите в меню «<u>Вид</u>» и выберите соответствующий инструмент (см. рис. 5).<br />
<img src="img/img-69.png" alt=""><br />
Далее поставьте курсор перед первой буквой в первом предложении любого абзаца. Затем на линейке потяните <u>верхний</u> индикатор в правую сторону: вы увидите, как появиться красная строка (см. рис. 6. Кстати, многие ошибаются и двигают оба ползунка, из-за этого у них не получается). Благодаря линейке, красную строку можно отрегулировать очень точно в нужный размер.<br />
<img src="img/img-70.png" ><br />
Дальнейший абзацы, когда вы будете нажимать клавишу «Enter» — будут получаться автоматически с красной строкой.<br />
<b><u>4 урок — как создать оглавление (или содержание)</u></b><br />
Оглавление — это довольно трудоемкая задача (если делать ее неправильно). А многие начинающие пользователи сами составляют лист с содержанием всех глав, проставляют страницы и т.д. А в Word есть специальная функция для авто-создания оглавления с авто-постановкой всех страниц. Делается это очень быстро!<br />
Сначала в Word необходимо выделить заголовки. Делается это очень просто: листаете свой текст, встречаете заголовок — выделите его курсором, затем в разделе «<u>Главная</u>» выберите функцию выделения заголовка (см. рис. 7. Кстати, обратите внимание, что заголовки могут быть разными: заголовок 1, заголовок 2 и т.д. Они отличаются между собой по старшинству: т.е. заголовок 2 будет входить в раздел вашей статьи помеченный заголовком 1).<br />
<img src="img/img-71.png" ><br />
Теперь для создания оглавления (содержания) достаточно перейти в раздел «<u>Ссылки</u>» и выбрать меню оглавление. В месте курсора появиться оглавление, в котором страницы на нужные подзаголовки (которые мы отметили до этого) будут проставлены автоматически!<br />
<img src="img/img-72.png" ><br />
<b><u>5 урок — как «рисовать» в Word (вставка фигурок)</u></b><br />
Добавлять различные фигурки в Word бывает очень полезно. Помогает более наглядно показать на что обратить внимание, легче воспринимать информацию читающему ваш документ.<br />
Для вставки фигурки, перейдите в меню «<u>Вставка</u>» и во вкладке «<u>Фигуры</u>» выберите нужный вариант.<br />
<img src="img/img-73.png" alt=""><br />
Кстати, комбинации из фигурок при небольшой сноровке могут дать самые неожиданные результаты. Например, можно что-нибудь нарисовать: диаграмму, рисунок и пр. (см. рис. 10).<br />
<img src="img/img-74.png" ><br />
<b><u>6 урок — удаление страницы</u></b><br />
Казалось бы, простая операция иногда может стать настоящей проблемой. Обычно, чтобы удалить страницу, достаточно воспользоваться клавишами Delete и Backspace. Но бывает так, что они не помогают…<br />
Дело здесь в том, что на странице могут быть «не видимые» элементы, которые не удаляются обычным способом (например, разрывы страниц). Чтобы их увидеть, перейдите в раздел «<u>Главная</u>» и нажмите кнопку отображения непечатаемых символов (см. рис. 11). После этого выделяете эти спец. символы и спокойно удаляете — в итоге страница удалена.<br />
<img src="img/img-75.png" ><br />
<b><u>7 урок — создание рамки</u></b><br />
Рамка бывает нужна в отдельных случаях, когда необходимо что-то выделить, обозначить или подытожить информацию на каком-то листе. Делается это достаточно просто: переходите в раздел «<u>Дизайн</u>«, затем выбираете функцию «<u>Границы страницы</u>» (см. рис. 12).<br />
<img src="img/img-76.png" ><br />
Затем нужно выбрать тип рамки: с тенью, двойная рамка и пр. Тут уж все зависит от вашей фантазии (либо требований заказчика документа).<br />
<img src="img/img-77.png" ><br />
<b><u>8 урок — как делать сноски в Word</u></b><br />
А вот сноски (в отличие от рамок) очень часто встречаются. Например, употребили вы редкое слово — хорошо бы дать на него сноску и в конце страницы его расшифровать (тоже относится и к словам имеющий двойной смысл).<br />
Чтобы сделать сноску, установите курсор на нужное место, затем перейдите в раздел «<u>Ссылки</u>» и нажмите кнопку «<u>Вставить сноску</u>«. После этого вас «перекинет» в конец страницы, чтобы вы могли написать текст сноски (см. рис. 14).<br />
<img src="img/img-78.png" ><br />
<b><u>9 урок — как написать римские цифры</u></b><br />
Римские цифры обычно нужны для обозначения веков (т.е. чаще всего тем, кто связан с историей). Писать римские цифры очень просто: достаточно перейти на английский язык и ввести, скажем «XXX».<br />
<ol style="list-style-type: lower-latin;">
   <li>Но что делать, когда вы не знаете, как будет выглядеть число 655 на римский лад (к примеру)? Рецепт такой: сначала нажмите кнопки <u>CNTRL+F9</u> и введите в появившиеся скобки «=<u>655\*Roman</u>» (без кавычек) и нажмите <u>Word автоматически вычислит результат (см. рис. 15)!</u></li>
</ol>
<img src="img/img-79.png" ><br />
<b><u>10 урок — как сделать альбомный лист</u></b><br />
По умолчанию в Word все листы имеют книжную ориентацию. Бывает так, что часто требуется альбомный лист (это когда лист находиться перед вами не вертикально, а горизонтально).<br />
Делается это достаточно просто: переходите в раздел «<u>Макет</u>«, затем открываете вкладку «<u>Ориентация</u>» и выбирайте нужный вам вариант (см. рис. 16). Кстати, если вам нужно поменять ориентацию не всех листов в документе, а только одного из них — используйте <i>разрывы</i> («<u>Макет/разрывы/разрывы страниц</u>«).<br />
<img src="img/img-80.png" ><br />
              </strong>
            </p>
          </tab-pane>
          <tab-pane class="text-color">
            <template slot="label">
              Раздел контроля
            </template>
            <p class="blockquote blockquote-primary-new">
              <strong><strong class="name"><a class="a-href" target="_blank" href="https://onlinetestpad.com/ru/test/41838-test-na-znanie-microsoft-word">Тест на знания Word</a></strong></strong><br />
              <strong><strong class="name"><a class="a-href" target="_blank" href="https://onlinetestpad.com/ru/test/175279-tablicy-v-word">Таблицы в Word</a></strong></strong><br />
              <strong><strong class="name"><a class="a-href" target="_blank" href="https://onlinetestpad.com/ru/test/232172-7-sozdanie-slozhnykh-tekstovykh-dokumentov-msword-stili-i-giperssylka-v-mic">Создание сложных текстовых документов MSWord. Стили и гиперссылка в Microsoft Word</a></strong></strong><br />
            </p>
          </tab-pane>
            </tabs>
			   </div>    
            </div>
            </div>
      	   </div> 
          </div>    
      </div>
        </div>
      </div>
    </div>
    </div>
</template>
<script>
import { Button, Tabs, TabPane } from "@/components";
import { Carousel, CarouselItem } from "element-ui";

export default {
  components: {
    [Button.name]: Button,
    [Carousel.name]: Carousel,
    [CarouselItem.name]: CarouselItem,
    Tabs,
    TabPane,
  },
};
</script>
<style scoped>
.text-color {
  color: black;
}
.name {
  font-size: 1.5rem;
}
.checkbox-cell {
  height: 40px;
  display: flex;
  justify-content: center;
  align-items: center;
}
.typography {
  font-size: 24px;
}
.blockquote {
  padding: 20px;
  font-size: 1.3rem;
  line-height: 1.8;
}
.blockquote.blockquote-primary {
  color: black;
  border-color: black;
}
.blockquote.blockquote-primary-new {
  color: black;
  border-color: white;
}
.typography-line {
  padding-left: 0%;
  margin-bottom: 0px;
  position: relative;
  display: block;
  width: 100%;
}
.tab-content.tab-content-padding {
  padding: 20px;
}
.container {
  max-width: 1600px;
}
.el-carousel__container {
  position: relative;
  height: 730px;
}
.card {
  margin-bottom: 0px;
}
.a-href {
  color: black;
}
.blockquote.blockquote-primary-new2 {
  color: black;
  border-color: rgb(23, 23, 172);
  border-width: 2px;
}
</style>