<template>
    <div class="page-header clear-filter">
      <div
        style="position: fixed; left: 0; top: 0; width: 100%; height: 100%; background-image: url('img/1.jpg'); max-height: 999px;"
      ></div>
<div class="container">
<h3 class="title">Тема 1. Информационные ресурсы в профессиональной деятельности</h3>
  <div class="section section-tabs">
    <div class="container">
      <div class="row">
          <div class="card">
			  <div id="typography">
        	<div class="row">
          	<div class="col-md-12">
        	<div class="typography-line">
            </div>
        	<div class="typography-line">
              <blockquote>
            <tabs
              centered
              type="neutral"
              tab-nav-wrapper-classes="card-header"
              tab-content-classes="card-body"
              data-background-color="darkgreen"
            >
              <tab-pane class="text-color">
                <template slot="label">
                Теоретический раздел
                </template>
                <p class="blockquote blockquote-primary">
                <strong><strong class="name">Информационные ресурсы: определение, классификация, развитие</strong><br />
<table border="0"><tr><td>В информационном обществе все большее внимание уделяется не традиционным видам ресурсов (материальные, природные, трудовые, финансовые, энергетические и т.д.), а информационным, которые приобретают первостепенную значимость. Сегодня овладение информационными ресурсами рассматривается как экономическая категория.<br />
Информационные ресурсы - это совокупность данных, организованных для получения достоверной информации в самых разных областях знаний и практической деятельности.<br />
Ресурсы определяют как запасы, источники чего-либо.<br />
В современном мире объем информации увеличивается лавинообразно. Все труднее становится выбрать из нее ту, которая более всего отвечает существующему запросу. Различают пертинентную (подробней &gt;&gt;) и релевантную (подробней &gt;&gt;) информацию.<br />
Сегодня понятие &quot;информационные ресурсы&quot; достаточно многопланово и включает в себя все многообразие документов на традиционных и нетрадиционных носителях.<br />
Информационные ресурсы подразделяются по классам собираемой информации.<br />
К первично собираемой информации, т.е. той, которая отражает специфику ее источника, области или сферы создания, возникновения, относится информация, образующаяся самостоятельно в природных условиях (например, количество колец на спиле дерева, свидетельствует о его возрасте). Информация о количественных и качественных характеристиках разных социальных процессов образуют класс &quot;снимаемой информации&quot;. Выделенные по этому признаку информационные ресурсы можно классифицировать как естественные, производственные, социально-экономические. Например, информация о росте населения.<br />
Другой класс информационного ресурса образуют сведения, данные, получаемые искусственно в процессе научно-исследовательской деятельности, а также любой творческой работы. Она базируется на обработке уже имеющейся информации по специальным параметрам и моделям (математическая обработка, логическая, семантическая и т.д.). К этому же классу относятся и объекты, создаваемые как авторские произведения в области литературы, искусства. Важным компонентом этих ресурсов является информация, получаемая в результате интеллектуальной деятельности человека. Выделяется вторичная информация, возникающая на основе переработки уже имеющейся информации, и новая, фиксирующая то, что человечество до сих пор не знало. Сюда относятся открытия, прогнозы в области различных социальных и природных процессов.<br />
К информационным ресурсам относятся: библиотеки, архивы, базы данных, СМИ и т.п.) и информационные сервисы (Информационные сервисы - это группа сайтов, на которых можно воспользоваться разнообразными сервисными услугами: электронной почтой, блогом (подробней &gt;&gt;), а также познакомиться с механизмом его ведения, поиском, различными каталогами, словарями, справочниками, прогнозом погоды, телепрограммой, курсами валют и т.д. Пример: http://yandex.ru, http://rambler.ru , http://aport.ru) и т.п.<br />
Развитие мировых информационных ресурсов позволило:<br />
Превратить деятельность по оказанию информационных услуг (получение и предоставление в распоряжение пользователя информационных продуктов - совокупности данных, сформированную производителем для распространения в вещественной или невещественной форме) в глобальную человеческую деятельность;<br />
Сформировать мировой и внутригосударственный рынок информационных услуг;<br />
Образовать всевозможные базы данных ресурсов регионов и государств, к которым возможен сравнительно недорогой доступ;<br />
Повысить обоснованность и оперативность принимаемых решений в фирмах, банках, биржах, промышленности, торговли и др. за счет своевременного использования необходимой информации.<br />
По существующей классификации, информационные ресурсы могут быть государственными и негосударственными и как элемент состава имущества находятся в собственности граждан, органов государственной власти, органов местного самоуправления, организаций и общественных объединений.<br />
</td>
</tr>
</table>
<b>ИНФОРМАЦИОННЫЕ ТЕХНОЛОГИИ В </b><br />
<b>ПРОФЕССИОНАЛЬНОЙ ДЕЯТЕЛЬНОСТИ</b><br />
Одним из важнейших ресурсов современного информационного общества являются <b>информационные ресурсы</b>. Ресурс – это запас или источник некоторых средств. Различают следующие виды общественных ресурсов: материальные, сырьевые, энергетические, трудовые, финансовые.<br />
Значимость информационных ресурсов постоянно растет. На нынешней фазе продвижения к информационному обществу информационные ресурсы становятся товаром, совокупная стоимость которого на рынке сопоставима со стоимостью традиционных ресурсов.<br />
В последней трети 20 века среди специалистов сложилось мнение, что развитие средств информатизации и информационных технологий ведет к качественному переходу общества в новое состояние.<br />
Понятие «информационное общество» впервые возникло в Японии. Для такого общества характерны следующие основные признаки:<br />
• любой его член, группа членов, любая организация в любое время могут получить доступ к информационным ресурсам, необходимым для профессиональной деятельности или в личных целях;<br />
• становятся доступными для любого человека современные информационные технологии и средства связи;<br />
• создана развитая информационная инфраструктура, позволяющая постоянно пополнять и обновлять информационные ресурсы в количествах, необходимых для решения задач социального, экономического и научно-технического развития.<br />
Итак «информационное общество» - это общество, в котором в изобилии циркулирует высокая по качеству информация, а также есть все необходимые средства для ее хранения, распределения и использования, т.е. информация легко и быстро распространяется по требованию заинтересованных людей и организаций и выдается им в привычной для них форме.<br />
Интересный критерий оценки полномасштабного информационного общества предложил А.П. Ершов: по совокупным пропускным способностям каналов связи. За этим критерием стоит простая и глубокая мысль: развитие каналов связи отражает и уровень компьютеризации, и объем накопленной информации и объективную потребность общества во всех видах информационного обмена, и другие проявления информатизации.<br />
Информация всегда играла огромную роль в жизни общества и отдельного индивидуума. Мы знаем, что несколько раз в истории человечества происходили радикальные изменения в информационной области, которые называют информационными революциями.<br />
Первая информационная революция связана с изобретением письменности. Письменность создала возможность для накопления, распространения знаний и передачи знаний будущим поколениям.<br />
Вторая информационная революция (середина 16 века) была связана с изобретением книгопечатания. Появилась возможность не только сохранять информацию, но и сделать ее массово-доступной. Грамотность становится массовым явлением. Все это ускорило развитие науки и техники, помогло промышленной революции.<br />
Третья информационная революция (конец 19века) была обусловлена прогрессом в развитии средств связи. Телеграф, телефон, радио позволили оперативно передавать информацию на любые расстояния. Именно в этот период началось зарождение того процесса, который сейчас называют глобализацией.<br />
Четвертая информационная революция (70-ые годы 20 века) связана с появлением микропроцессорной техники и, в частности, персональных компьютеров. Отметим, что не появление компьютеров в середине 20 века, а именно создание микропроцессорных систем обусловило данную информационную революцию. Возникшие вскоре компьютерные телекоммуникации радикально изменили системы хранения и поиска информации. Именно четвертая информационная революция дала толчок к существенным переменам в развитии общества, определившим появление нового термина – «информационное общество».<br />
По мере перехода от одной информационной революции к другой нарастали проявления информационного кризиса – явления, важнейшей чертой которого является превышение того уровня объема информации, за которым находится способность человека воспринимать и анализировать ее.<br />
В полной мере информационный кризис проявился к середине 20 века. Потоки информации стали настолько огромными, что человек не мог переработать и осмыслить их в полной мере.<br />
Информационный кризис породил ряд негативных явлений:<br />
• противоречия между ограниченными возможностями человека по восприятию и переработке информации и постоянно нарастающими информационными потоками;<br />
• существование огромной избыточной информации, которая затрудняет восприятие полезной информации;<br />
• укрепление образовательных, экономических, политических и других социальных барьеров, препятствующих распространению информации.<br />
Одна из задач информационного общества – смягчение последствий информационного кризиса. Однако следует отчетливо осознавать, что если внедрение компьютеров и информационных технологий в разные сферы профессиональной деятельности и повседневной жизни человека позволяет решить многие проблемы технически, то в социальном плане это не всегда удается. Свидетельством этого являются, в частности, проявления информационного неравенства на пути продвижения к информационному обществу. «Информационная элита» имеет больший доступ к информационным ресурсам и технологиям, нежели простые пользователи. Также эта разница чувствуется между сельскими и городскими образовательными учреждениями.<br />
<strong><i>1.2 Образование в информационном обществе </i><br /></strong>
Образование – одна из самых консервативных общественных систем. Формы, методы и организация системы образования в основном сложились в 17в. и практически не реагировали на развитие технологий. Однако новые информационные технологии уже внесли в образование существенные новации; еще больше нового они сулят в развитом информационном обществе.<br />
По мере продвижения к информационному обществу наблюдаются следующие тенденции в сфере образования.<br />
• Переход от механического, репродуктивного процесса обучения к органическому, гуманистическому обучению. Информационные технологии позволяют адаптировать учебный процесс к нуждам отдельного индивидуума и быстро реагировать на возникающие перемены. Организационный способ достижения этой цели – индивидуальное обучение. В социальном плане это может обеспечить учащимся равные возможности в получении образования.<br />
• Поддержка разнообразия образования . Стандартизованный процесс обучения в традиционной школе по общим учебным планам программам не позволяет учитывать разнообразие культур, присущее различным группам населения(национальным, религиозным и т.д.). Информационные технологии способствуют реализации разнообразия культур в обучении.<br />
• Развитие системы гибких индивидуальных учебных программ. Здесь иной аспект поддержки разнообразия. Переход к новым технологиям представления информации позволяет подстраивать учебные программы под возможности и интересы учащихся.<br />
• Децентрализация учебных заведений. Вместо централизованного обучения с фиксированным расписанием и набором уроков на основе новых технологий школа сможет организовать проведение части учебного процесса на дому, а части – в составе гибких, динамически формируемых учебных групп по интересам.<br />
• Информатизация управления учебным заведением. Образовательные учреждения обеспечиваются информационными системами, автоматизируется управленческая деятельность, создаются и используются распределенные базы данных в различных предметных областях.<br />
Уровень количественного и качественного развития образовательной системы позволяет судить о степени продвижения страны по пути к информационному обществу. Но на этом пути имеются определенные проблемы.<br />
Одна из важных проблем в современном образовании – это возможность сделать его более доступным для каждого человека. В силу своего динамизма информационное общество требует от своих членов непрерывного обучения. Это позволит человеку не отстать от времени и быть способным сменить профессию. Можно говорить о принципе пожизненного повышения квалификации. При этом возникли новые формы обучения, в частности, <b>дистанционное образование</b>, которое быстро наращивает свои возможности и охватывает различные уровни образовательной системы, включая школьный, университетский и послевузовский.<br />
Важным и полезным моментом в обучении явилось использование <b>технологии мультимедиа</b>, которые делают более доступными сложные абстрактные построения. Ершов А.П. называл в свое время этот процесс визуализацией абстракций. В настоящее время благодаря мультимедийным технологиям в сочетании с гипертекстовой структурой учебного материала возможно создавать высокоэффективные средства обучения – электронные книги, мультимедиа-энциклопедии, компьютерные фильмы, базы данных и т.д., которые позволяют объединить текстовую, графическую, аудио- и видеоинформацию, анимацию.<br />
В информационном обществе возможен полный или частичный отход школы от традиционной классно-урочной системы. Индивидуализация обучения, возможность организации с помощью информационных технологий персональных образовательных программ для учащихся могут привести к замене классической модели организации обучения проектногрупповой и индивидуальной моделями. Однако и в рамках классноурочной системы при наличии компьютеров информационные технологии обучения могут быть достаточно эффективными. Они позволяют учителю индивидуализировать обучение и осуществлять текущий контроль знаний учащихся.<br />
В информационном обществе есть все возможности для того, чтобы сделать более полноценным <b>образование инвалидов</b>. Им на помощь придут дистанционные формы обучения.<br />
Тем не менее, актуальными остаются слова генерального директора ЮНЕСКО Ф.Майора: «Технологии развиваются быстрее, чем возможности их использования, которыми располагает образование».<br />
Поэтому часть из отмеченных выше явлений пока следует рассматривать скорее как тенденции, нежели реальности. В последние годы стали говорить о появлении нового вида образования, которое называют <b>информатическим</b> <b> образованием </b>(по аналогии с математическим, химическим и т. д.).<br />
История развития школьного информатического образования в России относится к 60-ым годам прошлого столетия. В 1985г. в школьные программы был введен новый предмет «Основы информатики и вычислительной техники».<br />
О динамике развития этого направления в образовании можно судить по тому, что за столь короткое время школьная информатика прошла несколько этапов. Вначале стояла задача формирования <b>алгоритмической культуры</b> учащихся. По мере оснащения школ компьютерами задача была расширена до формирования <b>компьютерной грамотности</b> учащихся.<br />
<i>Компьютерная грамотность = алгоритмическая культура + умение «общаться» с компьютером + представление об устройстве и принципах действия ЭВМ + представления об областях применения и возможностях ЭВМ, социальные последствия компьютеризации. На следующем этапе развития, когда у школ появилась возможность работать в компьютерных сетях, задача школьной информатики расширилась до формирования <b>информационной культуры</b> учащихся: Информационная культура = компьютерная грамотность + информационное моделирование + понимание основных принципов и квалифицированное использование основных типов современных информационных систем. </i><br />
Необходимые знания и навыки для решения задач, которые обозначают термином <b>«информационная компетентность»</b> школа должна дать каждому человеку, который будет жить в информационном обществе.<br />
В отчете Международного компьютерного общества Института инженеров по электротехнике и электронике (IEEE-CS), опубликованном в 2001г. формулируются, в частности, те культурные и социальные изменения, которые в первую очередь определяли содержание информатического образования в последнее десятилетие 20-го века:<br />
• появление новых педагогических технологий;<br />
• скорость распространения компьютеров во всем мире;<br />
• экономика компьютерных технологий;<br />
• признание информатики как академической дисциплины.<br />
В том же отчете отмечается, что благодаря техническим достижениям в вузовской информатике появились новые разделы или радикально трансформировались старые:<br />
• WWW и его приложения;<br />
• сетевые технологии;<br />
• графика и мультимедиа;<br />
• реляционные базы данных;<br />
• объектно-ориентированное программирование;<br />
• надежность программного обеспечения;<br />
• безопасность и криптография;<br />
• конкретные предметные области применения информатики и информационных технологий.<br />
<i> Цели и задачи использования информационных и </i>
<i>коммуникационных технологий в профессиональной деятельности </i>
Стратегия развития современного общества на основе знаний и высокоэффективных технологий потребовала внесения значительных корректив в педагогическую теорию и практику, активизировала поиск новых моделей образования, направленных на повышение уровня квалификации и профессионализма педагогов, на удовлетворение потребностей общества в специалистах, способных к успешной адаптации и самореализации в развитом, информационном обществе.<br />
<b>Цель дисциплины</b> - сформировать у будущих специалистов систему знаний, умений и навыков в области использования средств информационных и коммуникационных технологий (ИКТ) в обучении и образовании.<br />
Вопросы для самоконтроля <br />
1.Дайте определения следующим терминам: «информация», «данные», «информационная система», «информационная среда», «информационные технологии».<br />
2.Приведите классификацию информационных систем.<br />
3.Из каких компонентов состоит настольный ПК?<br />
4.Как могут быть применены в вашей профессиональной деятельности ноутбуки и компьютеры-телефоны?<br />
5.Перечислите виды и достоинства мобильных компьютеров.<br />
6.Назовите основные отличия компьютеров IBM PC и Apple.<br />
7.Какие фирмы производят специализированные ПК?<br />
8.На что надо обратить внимание при приобретении ПК?

                </strong>
                </p>
      </tab-pane>
      <tab-pane class="text-color">
        <template slot="label">
          Практический раздел
        </template>
        <p class="blockquote blockquote-primary">
          <strong><strong><b>Практическая работа №1</b><br /></strong>
<b><i>Тема:</i></b> Информационные ресурсы. Информационные технологии в профессиональной деятельности<br />
<b><i>Цель работы:</i></b> научиться пользоваться образовательными информационными ресурсами, искать нужную информацию с их помощью; овладеть навыками установки программного обеспечения.<br />
<b><i> Краткие теоретические сведения</i></b><br />
Информационные ресурсы. Образовательные информационные ресурсы Понятие «информационного ресурса общества» (ИРО) является одним из ключевых понятий социальной информатики. Широкое использование этого понятия началось после выхода в 1984 году книги Громова Г.Р. «Национальные информационные ресурсы: проблемы промышленной эксплуатации».<br />
«Информационный ресурс – это знания, представленные в проектной форме»,– такое краткое и недостаточно строгое определение было предложено профессором Ю.М. Каныгиным.<br />
Таким образом, информационные ресурсы – это знания, подготовленные для целесообразного социального использования. Понятие ИРО, накопленных в обществе знаний, может быть рассмотрено в узком и широком смысле слова. ИРО в узком смысле слова – это знания, уже готовые для целесообразного социального использования, то есть отчужденные от носителей и материализованные знания. ИРО в широком смысле слова включают в себя все отчужденные от носителей и включенные в информационный обмен знания, существующие как в устной, так и в материализованной форме.<br />
Понятие ресурс определяется в Словаре русского языка С.И. Ожегова как запас, источник чего-нибудь. Что же касается информационных ресурсов, то это понятие является сравнительно новым. Оно еще только начинает входить в жизнь современного общества, хотя в последние годы становится все более употребительным не только в научной литературе, но и в общественно-политической деятельности. Причиной этого, безусловно, является глобальная информатизация общества, в котором все больше начинает осознаваться особо важная роль информации и научных знаний.<br />
<i>Для классификации информационных ресурсов могут быть использованы следующие их наиболее важные параметры:</i><br />
· тематика хранящейся в них информации;<br />
· форма собственности – государственная (федеральная, субъекта федерации,<br />
· муниципальная), общественных организаций, акционерная, частная;<br />
· доступность информации – открытая, закрытая, конфиденциальная;<br />
· принадлежность к определенной информационной системе – библиотечной,-<br />
· архивной, научно-технической;<br />
· источник информации – официальная информация, публикации в СМИ,<br />
· статистическая отчетность, результаты социологических исследований;<br />
· назначение и характер использования информации– массовое региональное,<br />
· ведомственное;<br />
· форма представления информации – текстовая, цифровая, графическая,<br />
· мультимедийная;<br />
· вид носителя информации – бумажный, электронный.<br />
Под образовательными информационными ресурсами мы будем понимать текстовую, графическую и мультимедийную информацию, а также исполняемые программы (дистрибутивы), то есть электронные ресурсы, созданные специально для использования в процессе обучения на определенной ступени образования и для определенной предметной области. При работе с образовательными ресурсами появляются такие понятия, как субъект и объект этих ресурсов.<br />
<i>Выделяют следующие субъекты информационной деятельности:</i><br />
· субъект, создающий объекты (все пользователи образовательной системы-<br />
· преподаватель, студент);<br />
· субъект, использующий объекты (все пользователи образовательной системы);<br />
· субъект, администрирующий объекты, то есть обеспечивающий среду работы с<br />
· объектами других субъектов (администраторы сети);<br />
· субъект, контролирующий использование объектов субъектами (инженеры).<br />
· К образовательным электронным ресурсам относят:<br />
· учебные материалы (электронные учебники, учебные пособия, рефераты, дипломы),<br />
· учебно-методические материалы (электронные методики, учебные программы),<br />
· научно-методические (диссертации, кандидатские работы),<br />
· дополнительные текстовые и иллюстративные материалы (лабораторные работы,<br />
· лекции,<br />
· системы тестирования (тесты – электронная проверка знаний),<br />
· электронные полнотекстовые библиотеки;<br />
· электронные периодические издания сферы образования;<br />
· электронные оглавления и аннотации статей периодических изданий сферы<br />
· образования,<br />
· электронные архивы выпусков.<br />
<b>Установка программного обеспечения</b><br />
<i>Установка программного обеспечения осуществляется поэтапно:</i><br />
· запуск инсталлятора InstallShield;<br />
· выбор типа версии (полная или демонстрационная);<br />
· принятие (или отклонение) лицензионного соглашения;<br />
· ввод имени пользователя, названия организации;<br />
· выбор каталога для размещения файлов программы;<br />
· ввод кода инсталляции (только при выборе полной версии);<br />
· выбор типа инсталляции (полная, типичная, выборочная);<br />
· выбор компонентов для инсталляции (только для выборочной инсталляции);<br />
· копирование файлов на жесткий диск;<br />
· создание программной группы и ярлыков в главном меню;<br />
· создание записи в реестре для обеспечения возможности удаления программы (или<br />
· изменения состава компонентов) через Панель управления.<br />
Предусмотрена возможность отмены инсталляции на любой стадии.<br />
<i>Кроме того, инсталлятор имитирует также процессы настройки и деинсталляции:</i><br />
· определение наличия установленной версии и состава установленных компонентов;<br />
· изменение состава компонентов;<br />
· восстановление испорченной версии;<br />
· полное удаление программы.<br />
<i>Удаление программы через панель управления:</i><br />
· В панели управления (Пуск-Панель управления) щелкните Установка и удаление<br />
· программ.<br />
· В списке Установленные программы выберите название программы для удаления, а<br />
· затем щелкните Удалить. Чтобы подтвердить удаление, нажмите кнопку Да.<br />
· На странице Удаление завершено нажмите кнопку Готово.<br />
<b><i> Задание</i></b><br />
<i>Задание 1.</i><br />
<ol>
	<li>Загрузите Интернет.</li>
	<li>В строке поиска введите фразу «каталог образовательных ресурсов».</li>
	<li>Перечислите, какие разделы включают в себя образовательные ресурсы сети Интернет.</li>
  <li>Охарактеризуйте любые три.</li>
</ol>
	
<i>Задание 2.</i><br />
С помощью Универсального справочника-энциклопедии найдите ответы на следующие вопросы:<br />
<ol>
	<li>Укажите время утверждения григорианского календаря.</li>
	<li>Каков диаметр атома?</li>
	<li>Укажите смертельный уровень звука.</li>
	<li>Какова температура кипения железа?</li>
	<li>Какова температура плавления ртути?</li>
	<li>Укажите скорость обращения Луны вокруг Земли?</li>
	<li>Какова масса Земли?</li>
	<li>Какая гора в России является самой высокой?</li>
	<li>Дайте характеристику народа .</li>
	<li>Укажите годы правления Ивана I.</li>
	<li>Укажите годы правления Екатерины I.</li>
	<li>Укажите годы правления Ивана IV.</li>
	<li>Укажите годы правления Хрущева Н.С.</li>
	<li>В каком году был изобретен первый деревянный велосипед?</li>
</ol>
<i>Задание 3.</i><br />
<ol>
	<li>Установите программу «Яндекс. Браузер» из папки «teachers». Опишите все этапы установки.</li>
</ol>
<ol>
	<li>Удалите программу «Яндекс. Браузер» через «Панель управления». Опишите все этапы.</li>
</ol>
<b><i>4. Содержание отчета</i></b><br />
Отчет должен содержать:<br />
<ol>
	<li>Название работы.</li>
	<li>Цель работы.</li>
	<li>Задание.</li>
	<li>Результаты выполнения задания.</li>
	<li>Вывод по работе.</li>
</ol>
<ol>
	<b><i>5. Контрольные вопросы</i></b>
	<li>Что такое информационное общество?</li>
	<li>Что такое информационные ресурсы?</li>
	<li>Чем характеризуются национальные ресурсы общества?</li>
	<li>Что такое инсталляция (деинсталляция) программного обеспечения?</li>
	<li>Порядок инсталляция (деинсталляция) программного обеспечения?</li>
</ol>

          </strong>
        </p>
      </tab-pane>
	  <tab-pane class="text-color">
        <template slot="label">
          Вспомогательный раздел
        </template>
          <p class="blockquote blockquote-primary">
          <strong><strong>
            ИНФОРМАЦИОННЫЕ ТЕХНОЛОГИИ В ПРОФЕССИОНАЛЬНОЙ ДЕЯТЕЛЬНОСТИ 
            <br /></strong>
<strong>Тема 1. Информатизация образования как фактор развития общества</strong>
<b>Аннотация. </b>Данная тема раскрывает<b> </b>понятие информатизации общества, его основные характеристики. Приводится перечень информационных революций и причины их возникновения. Рассматривается роль образования в формировании информационной культуры общества.<br />
<b>Ключевые слова. </b>Информатизация, образование, развитие, общество.<b> Методические рекомендации по изучению темы. </b><br />
- Тема содержит лекционную часть, где в разделе «Лекция» имеются общие представления по теме;<br />
- После прохождения предыдущей части, надо выполнить задание «Эссе» и подготовить вопросы по тексту;<br />
- И напоследок есть раздел Обсуждений, где вы можете обсудить разные интересные факты, рассказать о чем-то новом, или же просто спрашивать то, чего не поняли.<br />
<strong><i>1.1 Информатизация общества как социальный процесс и его </i></strong>
<strong><i>основные характеристики </i></strong>
В конце XX века человечество вступило в стадию развития, получившего название <i>постиндустриальное или информационное общество.</i><br />
Одним из важнейших ресурсов современного информационного общества являются <b>информационные ресурсы</b>. Ресурс – это запас или источник некоторых средств. Различают следующие виды общественных ресурсов: материальные, сырьевые, энергетические, трудовые, финансовые.<br />
Значимость информационных ресурсов постоянно растет. На нынешней фазе продвижения к информационному обществу информационные ресурсы становятся товаром, совокупная стоимость которого на рынке сопоставима со стоимостью традиционных ресурсов.<br />
В последней трети 20 века среди специалистов сложилось мнение, что развитие средств информатизации и информационных технологий ведет к качественному переходу общества в новое состояние.<br />
Понятие «информационное общество» впервые возникло в Японии. Для такого общества характерны следующие основные признаки:<br />
• любой его член, группа членов, любая организация в любое время могут получить доступ к информационным ресурсам, необходимым для профессиональной деятельности или в личных целях;<br />
• становятся доступными для любого человека современные информационные технологии и средства связи;<br />
• создана развитая информационная инфраструктура, позволяющая постоянно пополнять и обновлять информационные ресурсы в количествах, необходимых для решения задач социального, экономического и научно-технического развития.<br />
Итак «информационное общество» - это общество, в котором в изобилии циркулирует высокая по качеству информация, а также есть все необходимые средства для ее хранения, распределения и использования, т.е. информация легко и быстро распространяется по требованию заинтересованных людей и организаций и выдается им в привычной для них форме.<br />
Интересный критерий оценки полномасштабного информационного общества предложил А.П. Ершов: по совокупным пропускным способностям каналов связи. За этим критерием стоит простая и глубокая мысль: развитие каналов связи отражает и уровень компьютеризации, и объем накопленной информации и объективную потребность общества во всех видах информационного обмена, и другие проявления информатизации.<br />
Информация всегда играла огромную роль в жизни общества и отдельного индивидуума. Мы знаем, что несколько раз в истории человечества происходили радикальные изменения в информационной области, которые называют информационными революциями.<br />
Первая информационная революция связана с изобретением письменности. Письменность создала возможность для накопления, распространения знаний и передачи знаний будущим поколениям.<br />
Вторая информационная революция (середина 16 века) была связана с изобретением книгопечатания. Появилась возможность не только сохранять информацию, но и сделать ее массово-доступной. Грамотность становится массовым явлением. Все это ускорило развитие науки и техники, помогло промышленной революции.<br />
Третья информационная революция (конец 19века) была обусловлена прогрессом в развитии средств связи. Телеграф, телефон, радио позволили оперативно передавать информацию на любые расстояния. Именно в этот период началось зарождение того процесса, который сейчас называют глобализацией.<br />
Четвертая информационная революция (70-ые годы 20 века) связана с появлением микропроцессорной техники и, в частности, персональных компьютеров. Отметим, что не появление компьютеров в середине 20 века, а именно создание микропроцессорных систем обусловило данную информационную революцию. Возникшие вскоре компьютерные телекоммуникации радикально изменили системы хранения и поиска информации. Именно четвертая информационная революция дала толчок к существенным переменам в развитии общества, определившим появление нового термина – «информационное общество».<br />
По мере перехода от одной информационной революции к другой нарастали проявления информационного кризиса – явления, важнейшей чертой которого является превышение того уровня объема информации, за которым находится способность человека воспринимать и анализировать ее.<br />
В полной мере информационный кризис проявился к середине 20 века. Потоки информации стали настолько огромными, что человек не мог переработать и осмыслить их в полной мере.<br />
Информационный кризис породил ряд негативных явлений:<br />
• противоречия между ограниченными возможностями человека по восприятию и переработке информации и постоянно нарастающими информационными потоками;<br />
• существование огромной избыточной информации, которая затрудняет восприятие полезной информации;<br />
• укрепление образовательных, экономических, политических и других социальных барьеров, препятствующих распространению информации.<br />
Одна из задач информационного общества – смягчение последствий информационного кризиса. Однако следует отчетливо осознавать, что если внедрение компьютеров и информационных технологий в разные сферы профессиональной деятельности и повседневной жизни человека позволяет решить многие проблемы технически, то в социальном плане это не всегда удается. Свидетельством этого являются, в частности, проявления информационного неравенства на пути продвижения к информационному обществу. «Информационная элита» имеет больший доступ к информационным ресурсам и технологиям, нежели простые пользователи. Также эта разница чувствуется между сельскими и городскими образовательными учреждениями.<br />
<strong><i>1.2 Образование в информационном обществе </i></strong>
Образование – одна из самых консервативных общественных систем. Формы, методы и организация системы образования в основном сложились в 17в. и практически не реагировали на развитие технологий. Однако новые информационные технологии уже внесли в образование существенные новации; еще больше нового они сулят в развитом информационном обществе.<br />
По мере продвижения к информационному обществу наблюдаются следующие тенденции в сфере образования.<br />
• Переход от механического, репродуктивного процесса обучения к органическому, гуманистическому обучению. Информационные технологии позволяют адаптировать учебный процесс к нуждам отдельного индивидуума и быстро реагировать на возникающие перемены. Организационный способ достижения этой цели – индивидуальное обучение. В социальном плане это может обеспечить учащимся равные возможности в получении образования.<br />
• Поддержка разнообразия образования . Стандартизованный процесс обучения в традиционной школе по общим учебным планам программам не позволяет учитывать разнообразие культур, присущее различным группам населения(национальным, религиозным и т.д.). Информационные технологии способствуют реализации разнообразия культур в обучении.<br />
• Развитие системы гибких индивидуальных учебных программ. Здесь иной аспект поддержки разнообразия. Переход к новым технологиям представления информации позволяет подстраивать учебные программы под возможности и интересы учащихся.<br />
• Децентрализация учебных заведений. Вместо централизованного обучения с фиксированным расписанием и набором уроков на основе новых технологий школа сможет организовать проведение части учебного процесса на дому, а части – в составе гибких, динамически формируемых учебных групп по интересам.<br />
• Информатизация управления учебным заведением. Образовательные учреждения обеспечиваются информационными системами, автоматизируется управленческая деятельность, создаются и используются распределенные базы данных в различных предметных областях.<br />
Уровень количественного и качественного развития образовательной системы позволяет судить о степени продвижения страны по пути к информационному обществу. Но на этом пути имеются определенные проблемы.<br />
Одна из важных проблем в современном образовании – это возможность сделать его более доступным для каждого человека. В силу своего динамизма информационное общество требует от своих членов непрерывного обучения. Это позволит человеку не отстать от времени и быть способным сменить профессию. Можно говорить о принципе пожизненного повышения квалификации. При этом возникли новые формы обучения, в частности, <b>дистанционное образование</b>, которое быстро наращивает свои возможности и охватывает различные уровни образовательной системы, включая школьный, университетский и послевузовский.<br />
Важным и полезным моментом в обучении явилось использование <b>технологии мультимедиа</b>, которые делают более доступными сложные абстрактные построения. Ершов А.П. называл в свое время этот процесс визуализацией абстракций. В настоящее время благодаря мультимедийным технологиям в сочетании с гипертекстовой структурой учебного материала возможно создавать высокоэффективные средства обучения – электронные книги, мультимедиа-энциклопедии, компьютерные фильмы, базы данных и т.д., которые позволяют объединить текстовую, графическую, аудио- и видеоинформацию, анимацию.<br />
В информационном обществе возможен полный или частичный отход школы от традиционной классно-урочной системы. Индивидуализация обучения, возможность организации с помощью информационных технологий персональных образовательных программ для учащихся могут привести к замене классической модели организации обучения проектногрупповой и индивидуальной моделями. Однако и в рамках классноурочной системы при наличии компьютеров информационные технологии обучения могут быть достаточно эффективными. Они позволяют учителю индивидуализировать обучение и осуществлять текущий контроль знаний учащихся.<br />
В информационном обществе есть все возможности для того, чтобы сделать более полноценным <b>образование инвалидов</b>. Им на помощь придут дистанционные формы обучения.<br />
Тем не менее, актуальными остаются слова генерального директора ЮНЕСКО Ф.Майора: «Технологии развиваются быстрее, чем возможности их использования, которыми располагает образование».<br />
Поэтому часть из отмеченных выше явлений пока следует рассматривать скорее как тенденции, нежели реальности. В последние годы стали говорить о появлении нового вида образования, которое называют <b>информатическим</b> <b> образованием </b>(по аналогии с математическим, химическим и т. д.).<br />
История развития школьного информатического образования в России относится к 60-ым годам прошлого столетия. В 1985г. в школьные программы был введен новый предмет «Основы информатики и вычислительной техники».<br />
О динамике развития этого направления в образовании можно судить по тому, что за столь короткое время школьная информатика прошла несколько этапов. Вначале стояла задача формирования <b>алгоритмической культуры</b> учащихся. По мере оснащения школ компьютерами задача была расширена до формирования <b>компьютерной грамотности</b> учащихся.<br />
<i>Компьютерная грамотность = алгоритмическая культура + умение «общаться» с компьютером + представление об устройстве и принципах действия ЭВМ + представления об областях применения и возможностях ЭВМ, социальные последствия компьютеризации. На следующем этапе развития, когда у школ появилась возможность работать в компьютерных сетях, задача школьной информатики расширилась до формирования <b>информационной культуры</b> учащихся: Информационная культура = компьютерная грамотность + информационное моделирование + понимание основных принципов и квалифицированное использование основных типов современных информационных систем. </i><br />
Необходимые знания и навыки для решения задач, которые обозначают термином <b>«информационная компетентность»</b> школа должна дать каждому человеку, который будет жить в информационном обществе.<br />
В отчете Международного компьютерного общества Института инженеров по электротехнике и электронике (IEEE-CS), опубликованном в 2001г. формулируются, в частности, те культурные и социальные изменения, которые в первую очередь определяли содержание информатического образования в последнее десятилетие 20-го века:<br />
• появление новых педагогических технологий;<br />
• скорость распространения компьютеров во всем мире;<br />
• экономика компьютерных технологий;<br />
• признание информатики как академической дисциплины.<br />
В том же отчете отмечается, что благодаря техническим достижениям в вузовской информатике появились новые разделы или радикально трансформировались старые:<br />
• WWW и его приложения;<br />
• сетевые технологии;<br />
• графика и мультимедиа;<br />
• реляционные базы данных;<br />
• объектно-ориентированное программирование;<br />
• надежность программного обеспечения;<br />
• безопасность и криптография;<br />
• конкретные предметные области применения информатики и информационных технологий.<br />
В России подготовка специалистов по информатике и информационным технологиям ведется в учреждениях среднего и высшего профессионального образования, а также в многочисленных учреждениях дополнительного образования. Таким образом, информатическое образование действительно стало большой самостоятельной отраслью, свидетельством вхождения мира в информационное общество.<br />
<strong><i>1.3 Цели и задачи использования информационных и </i></strong>
<strong><i>коммуникационных технологий в профессиональной деятельности </i></strong>
Стратегия развития современного общества на основе знаний и высокоэффективных технологий потребовала внесения значительных корректив в педагогическую теорию и практику, активизировала поиск новых моделей образования, направленных на повышение уровня квалификации и профессионализма педагогов, на удовлетворение потребностей общества в специалистах, способных к успешной адаптации и самореализации в развитом, информационном обществе.<br />
<b>Цель дисциплины</b> - сформировать у будущих учителей систему знаний, умений и навыков в области использования средств информационных и коммуникационных технологий (ИКТ) в обучении и образовании.<br />
<b>Задачи дисциплины: </b><br />
• раскрыть взаимосвязи дидактических, психолого-педагогических и методических основ применения компьютерных технологий для решения задач обучения и образования;<br />
• сформировать компетентности в области использования возможностей современных средств ИКТ в образовательной деятельности;<br />
• обучить студентов использованию и применению средств ИКТ в профессиональной деятельности специалиста, работающего в системе образования;<br />
• ознакомить с современными приемами и методами использования средств ИКТ при проведении разных видов учебных занятий, реализуемых в учебной и внеучебной деятельности;<br />
• развить творческий потенциал будущего учителя, необходимый для дальнейшего самообучения, саморазвития и самореализации в условиях бурного развития и совершенствования средств ИКТ.<br />
В процессе изучения этого курса мы должны овладеть следующими основными терминами и понятиями:<br />
• информационное общество;<br />
• новые информационные технологии (НИТ);<br />
• средства НИТ;<br />
• коммуникационные технологии и средства коммуникационных технологий;<br />
• технологии мультимедиа;<br />
• виртуальная реальность;<br />
• системы искусственного интеллекта.<br />
<strong>1.4. Вопросы для самоконтроля</strong>
1.Дайте определения следующим терминам: «информация», «данные», «информационная система», «информационная среда», «информационные технологии».<br />
2.Приведите классификацию информационных систем.<br />
3.Из каких компонентов состоит настольный ПК?<br />
4.Как могут быть применены в вашей профессиональной деятельности ноутбуки и компьютеры-телефоны?<br />
5.Перечислите виды и достоинства мобильных компьютеров.<br />
6.Назовите основные отличия компьютеров IBM PC и Apple.<br />
7.Какие фирмы производят специализированные ПК?<br />
8.На что надо обратить внимание при приобретении ПК?<br />
<strong>1.5. Задания для практики</strong>
Изучить базовую литературу - учебников и монографий.<br />
Написать эссе по данной теме.<br />
<strong>Методические рекомендации по написанию эссе Введение</strong>
Эссе от французского &quot;essai&quot;, англ. &quot;essay&quot;, &quot;assay&quot; - попытка, проба, очерк; от латинского &quot;exagium&quot; - взвешивание. Создателем жанра эссе считается М.Монтень (&quot;Опыты&quot;, 1580 г.). Это прозаическое сочинение - рассуждение небольшого объема со свободной композицией. Жанр критики и публицистики, свободная трактовка какой-либо проблемы. Эссе выражает индивидуальные впечатления и соображения по конкретному поводу или вопросу и заведомо не претендует на определяющую или исчерпывающую трактовку предмета. Как правило, эссе предполагает новое, субъективно окрашенное слово о чем-либо и может иметь философский, историко-биографический, публицистический, литературно-критический, научно-популярный, беллетристический характер. Эссе студента – это самостоятельная письменная работа <b>на тему, предложенную преподавателем (тема может быть предложена и студентом, но обязательно должна быть согласована с преподавателем). Цель эссе состоит в развитии навыков самостоятельного творческого мышления и письменного изложения собственных мыслей. </b>Писать эссе чрезвычайно полезно, поскольку это позволяет автору научиться четко и грамотно формулировать мысли, структурировать информацию, использовать основные категории анализа, выделять причинно-следственные связи, иллюстрировать понятия соответствующими примерами, аргументировать свои выводы; овладеть научным стилем речи. Эссе должно содержать: четкое изложение сути поставленной проблемы, включать самостоятельно проведенный анализ этой проблемы с использованием концепций и аналитического инструментария, рассматриваемого в рамках дисциплины, выводы, обобщающие авторскую позицию по поставленной проблеме. В зависимости от специфики дисциплины формы эссе могут значительно дифференцироваться. В некоторых случаях это может быть анализ имеющихся статистических данных по изучаемой проблеме, анализ материалов из средств массовой информации и использованием изучаемых моделей, подробный разбор предложенной задачи с развернутыми мнениями, подбор и детальный анализ примеров, иллюстрирующих проблему и т.д.<br />
<strong>Тема эссе</strong>
Тема не должна инициировать изложение лишь определений понятий, ее цель – побуждать к размышлению. Тема эссе должна содержать в себе вопрос, проблему, мотивировать на размышление.<br />
<strong>Построение эссе</strong>
Построение эссе – это ответ на вопрос или раскрытие темы, которое основано на классической системе доказательств.<br />
<b>Структура эссе: </b><br />
<strong>Титульный лист</strong>
<b>Введение </b>– суть и обоснование выбора данной темы, состоит из ряда компонентов, связанных логически и стилистически; На этом этапе очень важно правильно <b>сформулировать вопрос, на который вы собираетесь найти ответ в ходе своего исследования. </b>При работе над введением могут помочь ответы на следующие вопросы: «Надо ли давать определения терминам, прозвучавшим в теме эссе?», «Почему тема, которую я раскрываю, является важной в настоящий момент?», «Какие понятия будут вовлечены в мои рассуждения по теме?», «Могу ли я разделить тему на несколько более мелких подтем?».<br />
<b>Основная часть </b>– теоретические основы выбранной проблемы и изложение основного вопроса. Данная часть предполагает развитие аргументации и анализа, а также обоснование их, исходя из имеющихся данных, других аргументов и позиций по этому вопросу. В этом заключается основное содержание эссе и это представляет собой главную трудность. Поэтому важное значение имеют подзаголовки, на основе которых осуществляется структурирование аргументации; именно здесь необходимо обосновать (логически, используя данные или строгие рассуждения) предлагаемую аргументацию/анализ. Там, где это необходимо, в качестве аналитического инструмента можно использовать графики, диаграммы и таблицы. В зависимости от поставленного вопроса анализ проводится на основе следующих категорий: Причина – следствие, общее – особенное, форма – содержание, часть – целое, Постоянство – изменчивость. В процессе построения эссе необходимо помнить, что один параграф должен содержать только одно утверждение и соответствующее доказательство, подкрепленное графическим и иллюстративным материалом. Следовательно, наполняя содержанием разделы аргументацией (соответствующей подзаголовкам), необходимо в пределах параграфа ограничить себя рассмотрением одной главной мысли. Хорошо проверенный (и для большинства – совершено необходимый) способ построения любого эссе – использование подзаголовков для обозначения ключевых моментов аргументированного изложения: это помогает посмотреть на то, что предполагается сделать (и ответить на вопрос, хорош ли замысел). Такой подход поможет следовать точно определенной цели в данном исследовании. Эффективное использование подзаголовков – не только обозначение основных пунктов, которые необходимо осветить. Их последовательность может также свидетельствовать о наличии или отсутствии логичности в освещении темы. <b>Заключение </b>– обобщения и аргументированные выводы по теме с указанием области ее применения и т.д. Подытоживает эссе или еще раз вносит пояснения, подкрепляет смысл и значение изложенного в основной части. Методы, рекомендуемые для составления заключения: повторение, иллюстрация, цитата, впечатляющее утверждение. Заключение может содержать такой очень важный, дополняющий эссе элемент, как указание на применение (импликацию) исследования, не исключая взаимосвязи с другими проблемами.<br />
<strong>Структура аппарата доказательств, необходимых для написания эссе</strong>
Доказательство – это совокупность логических приемов обоснования истинности какого-либо суждения с помощью других истинных и связанных с ним суждений. Оно связано с убеждением, но не тождественно ему: аргументация или доказательство должны основываться на данных науки и общественно-исторической практики, убеждения же могут быть основаны на предрассудках, неосведомленности людей в вопросах экономики и политики, видимости доказательности. Другими словами, доказательство или аргументация – это рассуждение, использующее факты, истинные суждения, научные данные и убеждающее нас в истинности того, о чем идет речь. Структура любого доказательства включает в себя три составляющие: тезис, аргументы и выводы или оценочные суждения. <b>Тезис –</b> это положение (суждение), которое требуется доказать. <b>Аргументы –</b> это категории, которыми пользуются при доказательстве истинности тезиса. <b>Вывод –</b> это мнение, основанное на анализе фактов. <b>Оценочные суждения –</b> это мнения, основанные на наших убеждениях, верованиях или взглядах. <b>Аргументы </b>обычно делятся на следующие группы:<br />
<ol>
	<li><b>Удостоверенные факты –</b> фактический материал (или статистические данные). Факты – это питательная среда для выяснения тенденций, а на их основании – законов в различных областях знаний, поэтому мы часто иллюстрируем действие законов на основе фактических данных.</li>
	<li><b>Определения </b>в процессе аргументации используются как описание понятий, связанных с тезисом.</li>
	<li><b>Законы </b>науки и ранее доказанные теоремы тоже могут использоваться как аргументы доказательства.</li>
</ol>
<strong>Виды связей в доказательстве</strong>
Для того чтобы расположить тезисы и аргументы в логической последовательности, необходимо знать способы их взаимосвязи. Связь предполагает взаимодействие тезиса и аргумента и может быть прямой, косвенной и разделительной. Прямое доказательство – доказательство, при котором истинность тезиса непосредственно обосновывается аргументом. Например: мы не должны идти на занятия, так как сегодня воскресенье. Метод прямого доказательства можно применять, используя технику индукции, дедукции, аналогии и причинно-следственных связей. Индукция – процесс, в результате которого мы приходим к выводам, базирующимся на фактах. Мы движемся в своих рассуждениях от частного к общему, от предположения к утверждению. Общее правило индукции гласит: чем больше фактов, тем убедительнее аргументация.<br />
Дедукция – процесс рассуждения от общего к частному, в котором вывод обычно строится с опорой на две предпосылки, одна из которых носит более общий характер. Например, <i>все люди, ставящие перед собой ясные цели и сохраняющие присутствие духа во время критических ситуаций, являются великими лидерами. По свидетельству многочисленных современников, такими качествами обладал А. Линкольн – один из самых ярких лидеров в истории Америки. </i>Аналогия – способ рассуждений, построенный на сравнении. Аналогия предполагает, что если объекты Л и Б схожи по нескольким направлениям, то они должны иметь одинаковые свойства. Необходимо помнить о некоторых особенностях данного вида аргументации: направления сравнения должны касаться наиболее значительных черт двух сравниваемых объектов, иначе можно прийти к совершенно абсурдному выводу. Причинно-следственная аргументация – аргументация с помощью объяснения причин того или иного явления (очень часто явлений, находящихся во взаимозависимости).<br />
<strong>Требования к фактическим данным и другим источникам</strong>
При написании эссе чрезвычайно важно то, как используются эмпирические данные и другие источники (особенно качество чтения). Все (фактические) данные соотносятся с конкретным временем и местом, поэтому прежде, чем их использовать, необходимо убедится в том, что они соответствуют необходимому для исследований времени и месту. Соответствующая спецификация данных по времени и месту – один из способов, который может предотвратить чрезмерное обобщение, результатом которого может, например, стать предположение о том, что все страны по некоторым важным аспектам одинаковы (если вы так полагаете, тогда это должно быть доказано, а не быть голословным утверждением). Всегда можно избежать чрезмерного обобщения, если помнить, что в рамках эссе используемые данные являются иллюстративным материалом, а не заключительным актом, т.е. они подтверждают аргументы и рассуждения и свидетельствуют о том, что автор умеет использовать данные должным образом. Нельзя забывать также, что данные, касающиеся спорных вопросов, всегда подвергаются сомнению. От автора не ждут определенного или окончательного ответа. Необходимо понять сущность фактического материала, связанного с этим вопросом (соответствующие индикаторы? насколько надежны данные для построения таких индикаторов? к какому заключению можно прийти на основании имеющихся данных и индикаторов относительно причин и следствий? и т.д.), и продемонстрировать это в эссе. Нельзя ссылаться на работы, которые автор эссе не читал сам. <b>Как подготовить и написать эссе?</b><br />
Качество любого эссе зависит от трех взаимосвязанных составляющих, таких как:<br />
• исходный материал, который будет использован (конспекты прочитанной литературы, лекций, записи результатов дискуссий, собственные соображения и накопленный опыт по данной<br />
проблеме);<br />
• качество обработки имеющегося исходного материала (его организация, аргументация и доводы);<br />
• аргументация (насколько точно она соотносится с поднятыми в эссе проблемами).<br />
Процесс написания эссе можно разбить на несколько стадий: обдумывание – планирование – написание – проверка – правка. <b>Планирование –</b> определение цели, основных идей, источников информации, сроков окончания и представления работы. <b>Цель </b>должна определять действия. <b>Идеи</b>, как и цели, могут быть конкретными и общими, более абстрактными. Мысли, чувства, взгляды и представления могут быть выражены в форме аналогий, ассоциации, предположений, рассуждений, суждений, аргументов, доводов и т.д. Аналогии – выявление идеи и создание представлений, связь элементов значений. Ассоциации – отражение взаимосвязей предметов и явлений действительности в форме закономерной связи между нервно-психическими явлениями (в ответ на тот или иной словесный стимул выдать «первую пришедшую в голову» реакцию). Предположения – утверждение, не подтвержденное никакими доказательствами. Рассуждения – формулировка и доказательство мнений. Аргументация – ряд связанных между собой суждений, которые высказываются для того, чтобы убедить читателя (слушателя) в верности (истинности) тезиса, точки зрения, позиции. Суждение – фраза или предложение, для которого имеет смысл вопрос: истинно или ложно? Доводы – обоснование того, что заключение верно абсолютно или с какой-либо долей вероятности. В качестве доводов используются факты, ссылки на авторитеты, заведомо истинные суждения (законы, аксиомы и т.п.), доказательства (прямые, косвенные, «от противного», «методом исключения») и т.д. Перечень, который получится в результате перечисления идей, поможет определить, какие из них нуждаются в особенной аргументации. Источники. Тема эссе подскажет, где искать нужный материал. Обычно пользуются библиотекой, Интернетресурсами, словарями, справочниками. Пересмотр означает редактирование текста с ориентацией на качество и эффективность. Качество текста складывается из четырех основных компонентов: ясности мысли, внятности, грамотности и корректности. Мысль – это содержание написанного. Необходимо четко и ясно формулировать идеи, которые хотите выразить, в противном случае вам не удастся донести эти идеи и сведения до окружающих. Внятность – это доступность текста для понимания. Легче всего ее можно достичь, пользуясь логично и последовательно тщательно выбранными словами, фразами и взаимосвязанными абзацами, раскрывающими тему. Грамотность отражает соблюдение норм грамматики и правописания. Если в чем-то сомневаетесь, загляните в учебник, справьтесь в словаре или руководстве по стилистике или дайте прочитать написанное человеку, чья манера писать вам нравится. Корректность – это стиль написанного. Стиль определятся жанром, структурой работы, целями, которые ставит перед собой пишущий, читателями, к которым он обращается.<br />
Ознакомиться с текстом документа «Тема 1» , добавить вопросы для самоконтроля.<br />
<strong>1.6. Глоссарий по теме 1</strong>
<b>Информационное общество</b> — теоретическая концепция постиндустриального общества; историческая фаза возможного развития цивилизации, в которой главными продуктами производства становятся информация и знания.<br />
<b>Информатизация</b> - в РФ - комплекс мер, направленных на обеспечение оперативного доступа к информационным ресурсам.<br />
<b>Информатизация</b> - организационный социально-экономический и научно-технический процесс создания оптимальных условий для удовлетворения информационных потребностей и реализации прав граждан, органов государственной власти, органов местного самоуправления, организаций, общественных объединений на основе формирования и использования информационных ресурсов.<br />
<strong>1.7. Использованные информационные ресурсы</strong>
<ol>
	<li>«О высшем и послевузовском образовании». Федеральный закон от 22.08.96 г. № 125-ФЗ (с изменениями от 10.01.03 г.)</li>
	<li>«Об образовании». Федеральный закон от 13.01.96 г. № 12-ФЗ (с изм. От 10.01.03 г.)</li>
	<li>Архангельский Г. Работа 2.0: прорыв к свободному времени. –</li>
</ol>
М.: Манн, Иванов и Фербер, 2010. – 208 с.<br />
<ol>
	<li>Асмолов А.Г., Семенов А.Л., Уваров А.Ю. Российская школа и новые информационные технологии: взгляд в следующее десятилетие. – М.: НексПринт, 2010. – 84 с.</li>
	<li>Беспалько В.П. Педагогика и прогрессивные технологии обучения. – М., 1995. – 336 с.</li>
	<li>Горелов И.Н. Разговор с компьютером. Психолингвистический аспект проблемы. – М.: Наука, – 1987. – 255 с.</li>
	<li>Горюнова М.А., Семенова Т.В., Солоневичева М.Н.</li>
</ol>
Интерактивные доски и их использование в учебном процессе. – СПб., 2010. – 336 с. 8. Григорьев С.Г., Гриншкун В.В., Информатизация образования. Фундаментальные основы // Учебник для студентов педагогических вузов и слушателей системы повышения квалификации педагогов. – Томск: Издво «ТМЛ-Пресс», 2008. – 286 с.<br />
<ol>
	<li>Григорьев С.Г., Гриншкун В.В., Кузнецов А.А. Образовательные электронные издания и ресурсы: Методическое пособие. М.: Дрофа, –</li>
</ol>
2009, 156 с.<br />
<ol>
	<li>Дьячко А.Г., Крупин Ю.А. и др. Информационные технологии в планировании учебного процесса высшего образовательного учреждения. – М., 2000. – 96 с.</li>
	<li>Киселев Г.М., Бочкова Р.В. Информационные технологии в педагогическом образовании. – М., 2012. – 308 с.</li>
	<li>Патаракин Е.Д. Социальные взаимодействия и сетевое обучение 2.0. – М.: НП «Современные технологии в образовании и культуре», 2009. – 176 с.</li>
	<li>Полат Е.С., Бухаркина М.Ю., Моисеева М.В., Петров А.Е. Новые педагогические и информационные технологии в системе образования. // Под ред. Е.С. Полат. – М.: «Академия», 2002. – 272 с.<b> </b></li>
</ol>
<strong> Тема 2. Понятие информационных и коммуникационных</strong>
<strong>технологий (ИКТ)</strong>
<b>Аннотация. </b>Данная тема раскрывает роль и место ИКТ в классификации педагогических технологий. Затем вы ознакомитесь с дидактическими свойствами и функциями ИКТ.<br />
<b>Ключевые слова.</b> Информационные технологии, свойства, функции. <b>Методические рекомендации по изучению темы. </b><br />
- Тема содержит лекционную часть, где в разделе «Лекция» имеются общие представления по теме;<br />
- После прохождения предыдущей части, надо выполнить задание и подготовить вопросы по тексту;<br />
- И напоследок есть раздел Обсуждений, где вы можете обсудить разные интересные факты, рассказать о чем-то новом, или же просто спрашивать то, чего не поняли.<br />
<b><i>Понятие информационных и коммуникационных технологий </i></b><br />
<strong><i>(ИКТ) </i></strong>
Следует отметить, что последние десятилетия прошлого века характеризуются общемировой тенденцией к использованию информационных технологий во многих областях знаний, в науке, технике, промышленности и в образовании.<br />
Вначале попробуем определить, что мы понимаем под понятием информационные технологии (ИТ). <b>Информационные технологии</b> – это система научных и инженерных знаний, а также методов и средств, которая используется для создания, сбора, хранения и обработки информации, безотносительно к предметной области, в<br />
которой создается и используется данная информация.<br />
Ответим на вопрос – а что же означает ИКТ?<br />
Информационные и коммуникационные технологии (ИКТ) – это комплекс средств, состоящих из средств вычислительной техники, программных средств и соответствующей документации.<br />
<strong><i>2.1 Эволюция информационных и коммуникационных технологий </i></strong>
Обращаясь к истокам ИКТ, мы, прежде всего, выделяем <i>программированное обучение.</i> Американский педагог У.Шрамм так сформулировал первые итоги развития программированного обучения: «программированное обучение есть своего рода автоматический репетитор, который ведет учащегося: путем коротких логически связанных шагов, так что он почти не делает ошибок и дает правильные ответы, которые немедленно подкрепляются путем сообщения результата, в результате чего он движется последовательными приближениями к ответу, который является целью обучения».<br />
В 60-ые годы программированное обучение стало отправным пунктом для перехода к технологическому пониманию полностью программированного учебного процесса.<br />
В 70-ые годы воздействие системного подхода постепенно привело к общей установке педагогической технологии, которая формулируется так: решать дидактические проблемы на пути управления учебным процессом с точно заданными целями, достижение которых должно поддаваться четкому описанию и определению. Этот подход сейчас распространен очень широко. По характеристике японского ученого-педагога Т.Сакамото, педагогическая технология представляет собой внедрение в педагогику системного способа мышления, который можно иначе назвать «систематизацией образования » или «систематизацией классного обучения». Развитие педагогической технологии охватило всю сферу дидактического проектирования. С конца 60-х годов в мире развивается подход к образовательному процессу, которое можно определить как системное дидактическое проектирование (СДП).<br />
Концепция информатизации образования в нашей стране была предложена в 1988г академиками Велиховым Е.П. и Ершовым А.П.<br />
В России в соответствии с предложенной концепцией информатизации образования усиленно развивались следующие основные направления:<br />
<ol>
	<li>применение универсальных ИТ в учебном процессе;</li>
	<li>применение компьютерных средств в телекоммуникациях;</li>
	<li>разработка и использование в учебном процессе компьютерных обучающих и контролирующих программ, компьютерных учебников и т.п.;</li>
	<li>разработка и использование мультимедийных программных продуктов, содержащих значительный объем информации (например, электронные энциклопедии), сопровождаемые специальным методическим материалом для их использования в целях обучения;</li>
	<li>разработка специализированных программно-методических комплексов, ориентированных на решение задач изучаемых предметных областей, и используемых в учебном процессе для выполнения учебных заданий (в основном это расчетные и моделирующие программы);</li>
	<li>использование заданий при изучении различных дисциплин, требующих от студентов знания программирования.</li>
</ol>
<strong><i>2.2 Место ИКТ в классификации педагогических технологий </i></strong>
Педагогические технологии можно классифицировать по нескольким критериям: характер содержания образования, категория обучающихся, длительность применения, организация учебной деятельности, отношение к ребенку, научная концепция усвоения знаний.<br />
 В российской педагогической практике наибольшее распространение получили следующие технологии.<br />
1) Современное традиционное обучение.<br />
2) Педагогические технологии на основе личностной ориентации педагогического процесса (педагогика сотрудничества, гуманноличностная технология Амонашвили, система Е.Н. Ильина).<br />
3) Педагогические технологии на основе активизации и интенсификации деятельности учащихся (игровые технологии; проблемное обучение; технологии обучения на основе опорных сигналов Шаталова; школа интенсивного обучения Китайгородской; технология коммуникативного обучения иноязычной культуре).<br />
4) Педагогические технологии на основе эффективности управления и организации учебного процесса.<br />
• Технология перспективно-опережающего обучения при комментируемом управлении Лысенковой.<br />
• Дифференцированное обучение.<br />
• Уровневая дифференциация обучения на основе обязательных результатов Фирсова.<br />
• Технология индивидуализации обучения ( Инге Унт, Границкая, Шадриков В.Д.).<br />
• Технология программированного обучения (Б.Скиннер, В.П.<br />
Беспалько).<br />
• Групповое и коллективное обучение (Дьяченко В.К.). • <u>Компьютерные (новые информационные) технологии обучения.</u><br />
5) Педагогические технологии на основе дидактического усовершенствования и реконструирования материала.<br />
• Реализация теории поэтапного формирования умственных действий (Волович);<br />
• Экология и диалектика (Тарасов Л.В.);<br />
• Диалог культур (Библер В.С., Курганов С.Ю.);<br />
• Укрупненные дидактические единицы (Эрдниев П.М.). 6) Технологии развивающего обучения.<br />
• Система развивающего обучения Л.В.Занкова;<br />
• Развивающее обучение Д.Б.Эльконина – В.В.Давыдова;<br />
• Технология саморазвивающего обучения (Селевко Г.К.).<br />
7) Частнопредметные педагогические технологии.<br />
• Технология раннего и интенсивного обучения грамоте<br />
(Зайцев Н.А.);<br />
• Технология обучения математике на основе решения задач<br />
(Хазанкин Р.Г.);<br />
• Педагогическая технология на основе системы эффективных уроков (Окунев);<br />
• Система поэтапного обучения физике (Палтышев Н.Н.);<br />
• Методика выравнивающего и развивающего обучения информатике (Андреева Е.В., Фалина И.Н.).<br />
Из приведенного перечня педагогических технологий видно, что ИКТ относятся к 4-й группе технологий. Эта группа строится на основе эффективности управления и организации учебного процесса. И хотя мы наблюдаем общую тенденцию к использованию ИКТ в учебном процессе и в образовании в целом, вопрос о том, повысилась ли эффективность и качество обучения пока еще остается открытым. В настоящее время наше общество находится в стадии освоения компьютерных средств, а это требует больших материальных затрат..<br />
<strong><i>2.3 Дидактические свойства и функции информационных и </i></strong>
<strong><i>коммуникационных технологий </i></strong>
Средства компьютерных телекоммуникаций позволяют обеспечить учебный процесс следующими элементами:<br />
• поурочными учебными и учебно-методическими материалами;<br />
• обратной связью между преподавателем и обучаемым;<br />
• доступом к отечественным и зарубежным информационным и справочным системам;<br />
• доступом к электронным библиотекам;<br />
• доступом к информационным ресурсам ведущих отечественных и зарубежных электронных газет и журналов;<br />
• обменом управленческой информацией внутри системы обучения.<br />
Такие функции средств телекоммуникации в учебном процессе обеспечиваются наличием у них определенных дидактических свойств (ДС).<br />
По определению Е.С. Полат, «под дидактическими свойствами того или иного средства обучения понимаются основные характеристики, признаки этого средства, отличающие их от других, существенные для дидактики как в плане теории так и практики».<br />
При классификации дидактических свойств Интернет (а мы в основном будем иметь дело с ресурсами Интернет) можно выделить два основных класса свойств компьютерных телекоммуникаций:<br />
<ol>
	<li>свойства, связанные с их телекоммуникационной основой, т.е. их технологические возможности;</li>
	<li>свойства, связанные с применением компьютеров (в том числе и мультимедийных).</li>
</ol>
В первом классе свойств выделяются два крупных подкласса дидактических свойств, связанных с телекоммуникационной основой КТК (компьютерные телекоммуникации): вещание и диалог. Важным дидактическим свойством телекоммуникации является ее двусторонний характер, обеспечивающий условия для интерактивности. С технической точки зрения, это означает, что сигнал по каналу компьютерной телекоммуникации с одинаковым успехом идет в любом из двух направлений, в отличие от радио- и телевещания. С педагогической точки зрения, появляется возможность диалога (интерактивность), что позволяет обеспечивать реальное взаимодействие учителя и учащихся. Начиналось использование КТК именно с диалога. Но в настоящее время стало стремительно развиваться и вещательное направление.<br />
Свойства, связанные с компьютерной основой КТК (т.е. относящиеся ко второму классу свойств). К сети Интернет подключены компьютеры, существенно различающиеся по своим возможностям. Это компьютеры абонента сети, которые выполняют ограниченный набор функций. Кроме того, в Интернет имеется немного компьютеров, которые содержат получаемую абонентами информацию (хост-компьютеры), но значение этих компьютеров для сети очень велико. Наконец, имеются компьютеры, принадлежащие фирме-провайдеру, поставщику услуг Интернет. Отсюда мы получаем следующие подклассы дидактических свойств: • дидактические свойства компьютера абонента;<br />
• дидактические свойства хост-компьютера;<br />
• дидактические свойства компьютера провайдера.<br />
<i>Дидактические свойства компьютера абонента: </i><br />
• способность хранить, выдавать на печать и структурировать переданную и полученную информацию;<br />
• способность программного обеспечения компьютера отправителя и получателя электронных писем разбираться в структуре хранения полученных писем, удалять или архивировать потерявшие актуальность, вести базу данных адресов корреспондентов и т. п.;<br />
• обеспечение гибкого, удобного и понятного интерфейса для работы со сложно структурированной информацией;<br />
• поддержка работы с гипермедийной информацией;<br />
• поддержка копирования такого расширенного текста из одного программного средства в другое.<br />
<i>Дидактические свойства хост-компьютера: </i><br />
• способность хранить и структурировать переданную и полученную информацию;<br />
• способность осуществлять поиск информации как на самом<br />
компьютере, так и в сети;<br />
• поддержка работы с гипермедийной информацией;<br />
• способность передавать полученную от абонента информацию по указанному электронному адресу.<br />
<i>Дидактические свойства компьютера провайдера: </i><br />
• способность хранить и структурировать переданную и полученную информацию;<br />
• способность отслеживать «судьбу» электронных писем (выявлять и сообщать о задержке доставки письма, о неверной адресации и т.п.);<br />
• способность проводить поиск нужной абоненту информации в структуре хранимых на нем данных;<br />
• совместимость аппаратного и программного обеспечения компьютеров провайдера данной услуги и компьютера его абонента;<br />
• способность проводить поиск нужной абоненту информации в сетевых структурах данных.<br />
Итак, мы рассмотрели общую классификацию дидактических свойств средств компьютерных телекоммуникаций.<br />
<strong>Дидактические функции компьютерных телекоммуникаций</strong>
Под дидактическими функциями мы понимаем внешнее проявление свойств средств обучения, используемых в учебно-воспитательном процессе с определенными целями. Это – их назначение, роль и место в учебном процессе.<br />
Что дают телекоммуникации для решения педагогических проблем? Некоторый опыт применения телекоммуникаций в различных сферах образования показал, что этот вид информационных технологий позволяет:<br />
• оперативно обмениваться информацией, идеями, планами по интересующим участников вопросам, темам проектов, расширяя при этом свой кругозор, повышая свой культурный уровень;<br />
• обеспечивать оперативную консультационную помощь широкому кругу обучаемых из научно-методических центров;<br />
• организовывать совместные исследовательские работы учащихся, учителей, студентов из одного либо разных регионов, или даже разных стран. Метод проектов дает возможность организовывать творческую исследовательскую деятельность либо чисто самостоятельную практическую деятельность участников с использованием многообразия методов и форм самостоятельной познавательной и практической творческой деятельности;<br />
• формировать у участников процесса коммуникативные навыки, культуру общения(умение кратко и четко формулировать собственные мысли, терпимо относиться к мнению партнеров, способность вести дискуссию, аргументированно доказывать свою точку зрения);<br />
• прививать навыки исследовательской деятельности, моделируя работу научной лаборатории, творческой мастерской;<br />
• развивать умения добывать информацию из разнообразных источников (начиная от партнера по совместному проекту, кончая удаленными базами данных), обрабатывать ее с помощью современных компьютерных технологий, хранить и передавать на дальние расстояния;<br />
• создавать подлинную языковую среду ( в условиях совместных международных телекоммуникационных проектов, телеконференций, аудио- и видеоконференций, чатов), способствующую возникновению естественной потребности в общении на иностранном языке и отсюда – потребности в изучении иностранных языков;<br />
• способствовать культурному, гуманитарному развитию учащихся на основе приобщения к самой широкой информации культурного, этнического, гуманистического плана.<br />
Компьютерные телекоммуникации, информационные ресурсы и услуги Интернет при грамотном их использовании позволяют осуществить <i>принципиально новый подход к обучению и воспитанию учащихся, который: </i><br />
<ol>
	<li>базируется на широком общении, сближении, стирании границ между отдельными социумами; на свободном обмене мнениями, идеями, информацией участников совместного проекта, на естественном желании познать новое, расширить свой кругозор;</li>
	<li>имеет в своей основе реальные исследовательские методы (научная или творческая лаборатория,) позволяющие познавать законы природы, основы техники, технологии, социальные явления в их динамике, в процессе решения жизненно важных проблем;</li>
	<li>базируется на широких контактах с культурой других народов, с опытом других людей;</li>
	<li>естественным образом инициирует развитие гуманитарного образования, акцентирует внимание на нравственных аспектах жизни и деятельности человека, на состояние и сохранение окружающей его среды;</li>
	<li>стимулирует развитие как родной речи участников сотрудничества, так и овладение иностранными языками, если речь идет о международных проектах;</li>
	<li>способствует приобретению и учащимися, и учителями разнообразных сопутствующих навыков, которые могут оказаться полезными в жизни, в том числе и навыков пользования компьютерной техникой и технологией.</li>
</ol>
<strong>2.4. Вопросы для самоконтроля</strong>
<ol>
	<li>Что такое информационная система?</li>
	<li>Как вы понимаете информационную технологию?</li>
	<li>Этапы развития информационных систем.</li>
	<li>Классификация информационных систем.</li>
	<li>Что такое информационный процесс?</li>
	<li>Техника безопасности при работе на ПК.</li>
	<li><b>.5Задание для практики </b>Аннотирование книг, статей.</li>
</ol>
<strong>2.6. Глоссарий по теме 2</strong>
<b>Информационная технология</b> - совокупность методов, производственных и программно-технологических средств, объединенных в технологическую цепочку, обеспечивающую сбор, хранение, обработку, вывод и распространение информации. Информационные технологии предназначены для снижения трудоемкости процессов использования информационных ресурсов.<br />
<b>Новая информационная технология</b> - информационная технология с дружественным интерфейсом работы пользователя, использующая персональные компьютеры и телекоммуникационные средства.<br />
Основными принципами новых компьютерных технологий являются:<br />
- интерактивный режим работы с компьютером;<br />
- интегрированность с другими программными продуктами; - гибкость процесса изменения постановок задач и данных.<br />
<strong>2.7. Использованные информационные ресурсы</strong>
<ol>
	<li>«О высшем и послевузовском образовании». Федеральный закон от 22.08.96 г. № 125-ФЗ (с изменениями от 10.01.03 г.)</li>
	<li>«Об образовании». Федеральный закон от 13.01.96 г. № 12-ФЗ (с изм. От 10.01.03 г.)</li>
	<li>Архангельский Г. Работа 2.0: прорыв к свободному времени. – М.: Манн, Иванов и Фербер, 2010. – 208 с.</li>
	<li>Асмолов А.Г., Семенов А.Л., Уваров А.Ю. Российская школа и новые информационные технологии: взгляд в следующее десятилетие. – М.: НексПринт, 2010. – 84 с.</li>
	<li>Беспалько В.П. Педагогика и прогрессивные технологии обучения. – М., 1995. – 336 с.</li>
	<li>Горелов И.Н. Разговор с компьютером. Психолингвистический аспект проблемы. – М.: Наука, – 1987. – 255 с.</li>
	<li>Горюнова М.А., Семенова Т.В., Солоневичева М.Н.</li>
</ol>
Интерактивные доски и их использование в учебном процессе. – СПб., 2010. – 336 с. 8. Григорьев С.Г., Гриншкун В.В., Информатизация образования. Фундаментальные основы // Учебник для студентов педагогических вузов и слушателей системы повышения квалификации педагогов. – Томск: Издво «ТМЛ-Пресс», 2008. – 286 с.<br />
<ol>
	<li>Григорьев С.Г., Гриншкун В.В., Кузнецов А.А. Образовательные электронные издания и ресурсы: Методическое пособие. М.: Дрофа, –</li>
</ol>
2009, 156 с.<br />
<ol>
	<li>Дьячко А.Г., Крупин Ю.А. и др. Информационные технологии в планировании учебного процесса высшего образовательного учреждения. – М., 2000. – 96 с.</li>
	<li>Киселев Г.М., Бочкова Р.В. Информационные технологии в педагогическом образовании. – М., 2012. – 308 с.</li>
	<li>Патаракин Е.Д. Социальные взаимодействия и сетевое обучение 2.0. – М.: НП «Современные технологии в образовании и культуре», 2009. – 176 с.</li>
	<li>Полат Е.С., Бухаркина М.Ю., Моисеева М.В., Петров А.Е. Новые педагогические и информационные технологии в системе образования. // Под ред. Е.С. Полат. – М.: «Академия», 2002. – 272 с.<b> </b></li>
</ol>
<strong>Тема 3. Современные технические и программные средства</strong>
<b>информационных технологий. </b><br />
<b>Аннотация. </b>В данной теме вы сможете ознакомиться с современными техническими и программными средствами информационных технологий.<br />
<b>Ключевые слова. </b>Мультимедиа, компьютерные технологии, база данных.<br />
<b>Методические рекомендации по изучению темы. </b><br />
- Тема содержит лекционную часть, где в разделе «Лекция» имеются общие представления по теме;<br />
- После прохождения предыдущей части, надо выполнить задание и подготовить вопросы по тексту;<br />
- И напоследок есть раздел Обсуждений, где вы можете обсудить разные интересные факты, рассказать о чем-то новом, или же просто спрашивать то, чего не поняли.<br />
<b><i>Современные технические и программные средства </i></b><br />
<strong><i>информационных технологий </i></strong>
Рассмотрим некоторые виды информационных технологий. Наиболее широко используются офисные технологии. Они позволяют обрабатывать информацию нескольких видов, поскольку этого требует данная сфера деятельности. Делопроизводство в первую очередь подразумевает возможности работы с текстовыми документами. Кроме того, офисные технологии должны предоставлять возможности производить расчеты над различными числовыми данными; оформления итоговой документации (такой как сводки, отчеты), содержащей различные графические иллюстрации; хранить данные в структурированном виде и оперировать этими данными. Поэтому офисные технологии включают в качестве ресурсов различные программные средства: текстовые и табличные процессоры, графические редакторы или средства деловой графики, системы управления базами данных (СУБД), средства подготовки презентаций. Одним из первых представителей таких комплексных программных средств была интегрированная система Works, включавшая текстовый редактор, электронные таблицы, СУБД. В настоящее время широкое распространение получила система MS Office, содержащая мощный текстовый процессор Word, табличный процессор Excel, СУБД Access, программное средство для разработки презентаций PowerPoint, почтовую программу OutLook, редактор Web-страниц FrontPage.<br />
<strong><i>3.1 Программные средства и технологии обработки текстовой </i></strong>
<strong><i>информации </i></strong>
Использование компьютеров коренным образом изменило технологию письма, издательского дела. Стремление упростить работу с разными текстами привело к созданию прикладного программного обеспечения, ориентированного на решение этих задач. Различают две основные группы программ подготовки текстовых документов: текстовые редакторы и текстовые процессоры. <i>Текстовыми редакторами</i> называют программы, создающие текстовые файлы без элементов форматирования. Редакторы такого рода незаменимы при создании текстов компьютерных программ, они понятны и просты в использовании. Примером редактора неформатированных текстов является редактор Блокнот (NotePad) операционной системы Windows.<br />
<i>Текстовые процессоры</i> позволяют форматировать текст, вставлять в документ графику и другие объекты. Примером текстового процессора является MS Word (ОС Windows). Большинство современных текстовых редакторов основаны на технологии WYSIWYG (What You See Is What You Get – то, что ты видишь на экране, есть то, что ты получишь), т.е. гарантируют соответствие внешнего вида документа на экране и его бумажной копии.<br />
К основным возможностям текстовых процессоров можно отнести следующие операции, составляющие основу технологии работы с текстами:<br />
- создание документа;<br />
- редактирование документа (перемещение по тексту; вставка и замена символов; удаление, перемещение, копирование, поиск и замена фрагментов текста; отмена команд; обмен фрагментами между различными документами);<br />
- сохранение документов во внешней памяти (на дисках) и чтение из внешней памяти в оперативную;<br />
- форматирование документов, т.е. выполнение преобразований, изменяющих внешний вид документа (оформление отдельных символов, абзацев, страниц документа в целом – изменение длины строки, междустрочного расстояния, выравнивания текста, изменение типа и размера шрифта и т.д.);<br />
- печать документов;<br />
- автоматическое составление оглавлений и указателей в документе;<br />
- создание и форматирование таблиц;<br />
- внедрение в документ рисунков, формул и др.; - проверка пунктуации и орфографии.<br />
Современный объектно-ориентированный подход позволяет реализовать механизмы встраивания и внедрения объектов – OLEтехнологии (Object Linking and Embedding). Эта технология позволяет копировать и вставлять объекты из одного приложения в другое. Например, в текстовый документ, созданный в приложении MS Word можно встроить изображения, анимацию, звук и даже видеофрагменты и таким образом из обычного документа получить мультимедийный документ.<br />
<i>Редакционно-издательские системы.</i> Этот класс программ предназначен для набора, оформления и полной подготовки к типографскому изданию книг и журналов. Примерами таких систем могут служить: Microsoft Publisher, Corel Ventura, Adobe PageMaker, Quark<br />
<ol style="list-style-type: lower-latin;">
	<li>Издательские системы незаменимы для компьютерной верстки и графики, значительно облегчают работу с многостраничными документами, т.к. предоставляют возможности автоматической разбивки текста на страницы, расстановки номеров страниц, создания заголовков и т.д.</li>
</ol>
<strong><i>3.2 Мультимедиа-технологии </i></strong>
Мультимедиа-технология позволяет одновременно использовать различные способы представления информации: числа, текст, графику, анимацию, видео и звук.<br />
Важной особенностью мультимедиа-технологии является возможность создания интерактивных документов. Графический интерфейс мультимедийных проектов обычно содержит различные управляющие элементы (кнопки перехода, текстовые окна, полосы прокрутки, списки выбора и др.).<br />
Одним из типов мультимедийных приложений являются компьютерные презентации. Презентация представляет собой последовательность слайдов, содержащих мультимедийные объекты: числа, текст, графику, анимацию, видео и звук.<br />
Публикации во Всемирной паутине реализуются в форме мультимедийных Web-сайтов, которые, кроме текста, могут включать в себя иллюстрации, анимацию, звуковую и видеоинформацию.<br />
<strong><i>3.3 Технологии работы с графической информацией </i></strong>
Информационные технологии обработки графической информации включают в себя специфические модели представления информации данного вида, особые методы ввода, формирования и вывода изображений, свои аппаратные и программные средства.<br />
Программные средства компьютерной графики - графические редакторы делятся на две большие группы: растровые и векторные редакторы. Это деление обусловлено способом представления и хранения графической информации (растровый или векторный способ).<br />
Среди программных средств компьютерной графики особое место занимают программные средства деловой графики. Они предназначены для создания иллюстраций к отчетной документации, статистическим сводкам и другим иллюстративным материалам. Обычно это различные графики, диаграммы, схемы и т.п. Программные средства деловой графики обычно включаются в состав текстовых и табличных процессоров (электронных таблиц).<br />
К инструментам деловой графики можно отнести и системы автоматизированного проектирования (САПР), которые предназначены для создания чертежей, но по сути являются векторными графическими редакторами.<br />
Компьютерные технологии обработки графической информации включают не только особое программное обеспечение (программные ресурсы), но и специфические аппаратные ресурсы, такие как различные устройства ввода и вывода графической информации: сканеры, цифровые фото- и видеокамеры, дигитайзеры, графические планшеты, плоттеры и т.п.<br />
<strong><i>3.4 Технологии баз данных. Понятие и виды баз данных </i></strong>
Хранение информации – одна из важнейших функций компьютера. Одним из распространенных средств такого хранения являются базы данных (БД). «База данных может быть определена как структурная совокупность данных, поддерживаемых в актуальном состоянии (в соответствии объектам некоторой предметной области) и служащая для удовлетворения информационных потребностей многих пользователей… Для поддержания актуальности данных, хранящихся в базе, получения сводок по информационным запросам, перехода к данным и программам пользователей служат системы управления базами данных (СУБД)…»<br />
Интеграция данных в базе подразумевает совместное использование данных для решения различных прикладных задач и устраняет дублирование данных. Согласованное использование данных требует централизованного управления, которое называется администрированием данных. Вообще, коллектив специалистов, обслуживающих большие базы данных, включает администраторов, аналитиков, системных и прикладных программистов.<br />
Таким образом, технологии баз данных включают в себя такие ресурсы как информационный (специальным образом структурированная информация), кадровый (специалисты, создающие и обслуживающие БД); информационные процессы, связанные с представлением и систематизацией информации, ее хранением и поиском; информационные системы – СУБД.<br />
Всегда, когда возникает потребность манипулирования большими массивами данных, используются базы данных. Рассмотрим основные понятия и определения, имеющие отношение к базам данных (БД).<br />
В общем случае под данными понимается информация, находящаяся в памяти ЭВМ или подготовленная для ввода в ЭВМ. Подготовка информации состоит в ее формализации, кодировании и перенесении на магнитные носители. Таким образом, <i>данные</i> – это формализованное представление информации, которое может быть описано понятным для вычислительного устройства способом.<br />
<i>Обработка данных</i> предполагает наличие совокупности задач, осуществляющих преобразование массивов данных. Обработка включает в себя ввод данных в ЭВМ, отбор данных по каким-либо критериям и параметрам, преобразование структуры данных, перемещение данных во внешнюю память, вывод результатов.<br />
Под <i>управлением данными</i> понимается весь круг операций с данными, которые необходимы для успешного функционирования систем взаимосвязанных задач обработки данных.<br />
<i>База данных</i> – это совокупность взаимосвязанных данных некоторой предметной области, хранимых в памяти ЭВМ и организованных таким образом, что эти данные могут быть использованы для решения многих задач многими пользователями.<br />
Современные БД должны удовлетворять определенному набору <b><i>требований</i></b>:<br />
- адекватность базы данных предметной области;<br />
- интегрированность данных;<br />
- независимость данных;<br />
- минимальная избыточность хранимых данных;<br />
- целостность базы данных;<br />
- обеспечение защиты от несанкционированного доступа или случайного уничтожения данных;<br />
- гибкость и адаптивность структуры базы данных;<br />
- динамичность данных и способность к расширению;<br />
- возможность поиска по многим ключам. Информация в БД хранится в упорядоченном виде. Существует несколько различных типов БД: иерархические, сетевые, табличные.<br />
<strong>Иерархические БД</strong>
Иерархические БД графически могут быть представлены как дерево, состоящее из объектов различных уровней. Верхний уровень занимает один объект; второй - объекты второго уровня и т.д.<br />
<img src="img/img-1.png"><br />
Между объектами существуют связи, каждый объект может включать в себя несколько объектов более низкого уровня. Примером иерархической БД является организация папок в ОС Windows.<br />
<h3>Сетевые БД</h3>
Сетевая БД отличается от иерархической тем, что в ней каждый элемент вышестоящего уровня может быть связан одновременно с любыми элементами следующего уровня.<br />
Вообще, на связи между объектами в сетевых моделях не накладывается никаких ограничений. Сетевой БД фактически является Всемирная паутина глобальной компьютерной сети Интернет. Гиперссылки связывают между собой сотни миллионов документов в единую распределенную сетевую БД.<br />
<img src="img/img-2.png"><br />
<strong>Реляционные БД</strong>
Реляционная (или табличная) БД содержит перечень объектов одного типа, т.е. объектов с одинаковым набором свойств.<br />
Такую базу удобно представлять в виде двумерной таблицы (или чаще – нескольких связанных между собой таблиц).<br />
Примером такой таблицы может служить БД «Учащиеся», представляющая собой перечень объектов (учеников), каждый из которых имеет фамилию, имя, отчество, дату рождения, класс, номер личного дела и др.<br />
Столбцы такой таблицы называют полями; каждое поле характеризуется своим именем (названием соответствующего свойства объекта) и типом данных, которые это поле может хранить. Каждое поле обладает определенным набором свойств (размер, формат и т.п.). Таким образом, поле БД – это столбец таблицы, содержащий значения определенного свойства объектов.<br />
Строки таблицы являются записями. Записи разбиты на поля. Каждая строка таблицы содержит запись об одном единственном объекте, включая все его свойства.<br />
В каждой таблице должно быть хотя бы одно ключевое поле, содержимое которого уникально для любой записи в этой таблице. Значения ключевого поля однозначно определяют каждую запись в таблице. В приведенном выше примере ключевым полем может являться поле «Номер личного дела». Очень часто в качестве ключевого поля используется поле, содержащее данные типа <i>счетчик</i>.<br />
В реляционных БД используются следующие основные типы полей:<br />
- счетчик – целые числа, которые задаются автоматически при вводе записей и не могут быть изменены пользователем;<br />
- числовой – этот тип имеют поля, значения которых могут быть только числами;<br />
- Символьный (текстовый) – такой тип имеют поля, в которых хранятся символьные последовательности (слова, тексты, коды и др.), содержащие до 255 символов;<br />
- Дата/время – дата и время;<br />
- Логический – значения типа истина/ложь (да/нет).<br />
От типа величины зависят те действия, которые можно с ней производить. Например, с числовыми данными можно выполнять арифметические операции, а с символьными и логическими – нельзя.<br />
Базы данных используются под управлением систем управления базами данных (СУБД).<br />
СУБД – специальные программы, предназначенные для создания БД, выполнения операций поиска, сортировки данных и других видов обработки данных.<br />
Таким образом, принято разделять понятия: БД – упорядоченные наборы данных;<br />
СУБД – программы, управляющие хранением и обработкой данных.<br />
<strong><i>3.5 Система управления базами данных</i><i> </i></strong>
(СУБД) – это система программного обеспечения, позволяющая обрабатывать обращения к базе данных, поступающие от прикладных программ конечных пользователей.<br />
Системы управления базами данных позволяют объединять большие объемы информации и обрабатывать их, сортировать, делать выборки по определённым критериям и т.п.<br />
Современные СУБД дают возможность включать в них не только текстовую и графическую информацию, но и звуковые фрагменты и даже видеоклипы.<br />
Простота использования СУБД позволяет создавать новые базы данных, не прибегая к программированию, а пользуясь только встроенными функциями.<br />
СУБД обеспечивают правильность, полноту и непротиворечивость данных, а также удобный доступ к ним. Популярные СУБД – FoxPro, Access for Windows, Paradox.<br />
Современная СУБД выполняет следующие функции:<br />
- ввод информации в БД и обеспечение ее логического контроля;<br />
- возможность исправления информации;<br />
- удаление устаревшей информации;<br />
- контроль непротиворечивости данных;<br />
- защита данных от разрушения;<br />
- поиск информации с заданными свойствами;<br />
- автоматическое упорядочение информации в соответствии с определенными требованиями;<br />
- обеспечение коллективного доступа к данным нескольких пользователей одновременно;<br />
- защита данных от несанкционированного доступа.<br />
Для менее сложных применений вместо СУБД используются <i>информационно-поисковые системы (ИПС),</i> которые выполняют следующие функции:<br />
- хранение большого объема информации;<br />
- быстрый поиск требуемой информации;<br />
- добавление, удаление и изменение хранимой информации; - вывод ее в удобном для человека виде.<br />
Весь комплекс программных и аппаратных средств, предназначенных для хранения, изменения и обработки информации, а также обеспечивающих взаимодействие с пользователем, принято называть информационной системой. Примером такой информационной системы могут служить, например системы продажи авиационных и железнодорожных билетов.<br />
Все информационные системы можно классифицировать, например, по используемой технической базе. Простейшая информационная система работает на одном компьютере. Вся информация сосредоточена в памяти этой машины и на ней же функционирует все программное обеспечение системы.<br />
Существуют информационные системы на базе локальной сети. Обычно такие ИС обслуживают предприятие, учреждение, фирму. Здесь информация может передаваться по сети между разными пользователями, разные части общедоступных данных могут храниться на разных компьютерах данной сети.<br />
И, наконец, существуют информационные системы на базе глобальных компьютерных сетей. Все известные службы Интернета можно рассматривать как такие системы. Наиболее крупной из них является WWW. Имеется также множество так называемых корпоративных систем, которые функционируют на базе локальных сетей предприятий одного ведомства, региона и т.д.<br />
<strong><i>3.6. Типы баз данных </i></strong>
Для решения различных задач используются различные модели баз данных. Процесс выбора базы данных, которая наиболее подходит для построения конкретного приложения, называется <i>масштабированием</i>.<br />
Рассмотрим некоторые модели баз данных.<br />
<strong>Автономные базы данных</strong>
Автономные локальные базы данных хранят свои данные в локальной файловой системе на том компьютере, на котором они установлены, при этом, система управления и машина базы данных, осуществляющая доступ к ней, находится на том же самом компьютере. Сеть в данном случае не используется. Разработчик автономной базы данных не имеет дело с проблемой параллельного доступа, когда два человека пытаются одновременно изменить одну и ту же запись.<br />
Автономные базы данных не используются для приложений, требующих значительной вычислительной мощности. К приложениям, использующим автономные базы данных, можно отнести приложения, обрабатывающие документацию небольшого подразделения или конторы, кадровый состав небольшого предприятия, бухгалтерские документы небольшой бухгалтерии и т.п. Каждый пользователь такого приложения манипулирует своими собственными данными на своем компьютере и не имеет доступа к данным другого пользователя.<br />
<strong>Файл-серверные базы данных</strong>
Файл-серверные базы данных отличаются от автономных тем, что они могут быть доступны многим клиентам через сеть. Сама база данных хранится на сетевом файл-сервере в единственном экземпляре. Для каждого клиента во время работы создается локальная копия данных, с которой он манипулирует. При этом возникают и решаются проблемы, связанные с возможным одновременным доступом нескольких пользователей к одной и той же информации.<br />
Одним из недостатков файл-серверных баз данных является непроизводительная загрузка сети. При каждом запросе клиента данные в его локальной копии полностью обновляются из базы данных на сервере. Даже если запрос относится всего к одной записи, обновляются все записи данных. Если записей в базе данных много, то даже при небольшом числе клиентов сеть будет загружена очень основательно, что серьезно скажется на скорости выполнения запросов.<br />
К приложениям, использующим файл-серверные базы данных, можно отнести приложения, обслуживающие крупные учреждения. В таких приложениях администраторы отдельных подразделений обращаются к общим данным и не создают свои локальные базы данных (при этом сохраняется конфиденциальность информации, и каждый администратор имеет доступ только к той информации, которая касается деятельности только его подразделения).<br />
<strong>Базы данных типа клиент/сервер</strong>
Для больших баз данных с множеством пользователей часто используются базы данных на платформе клиент/сервер. В этом случае доступ к базе данных для группы клиентов выполняется специальным компьютером – сервером. Клиент дает задание серверу выполнить те или иные операции поиска или обновления базы данных. Мощный сервер, ориентированный на операции с запросами клиентов, самым оптимальным способом выполняет такие запросы и сообщает клиенту результаты своей работы.<br />
Подобная организация работы повышает эффективность выполнения приложений за счет использования мощности сервера, разгружает сеть и обеспечивает хороший контроль целостности данных.<br />
В базах данных такого типа возникает проблема проектирования приложения таким образом, чтобы оно максимально использовало возможности сервера и минимально нагружало сеть, передавая через нее только минимум информации. <b>Многоярусные базы данных </b><br />
Иногда этот сравнительно новый и перспективный способ сетевой организации баз данных называется multitier (многонитевый). Здесь под нитью понимается один из множества потоков данных, обменивающихся одновременно с базой данных.<br />
Наиболее распространен трехъярусный вариант, при котором:<br />
- на нижнем уровне на компьютерах пользователя расположены приложения клиентов, обеспечивающие пользовательский интерфейс;<br />
- на втором уровне расположен сервер приложений, обеспечивающий обмен данными между пользователями и распределенными базами данных. Сервер приложений размещается в узле сети, доступном всем клиентам;<br />
- на третьем уровне расположен удаленный сервер баз данных, принимающий информацию от серверов приложений и управляющий ими.<br />
Такая организация баз данных наиболее сложная и гибкая.<br />
<strong>3.7. Вопросы для самоконтроля</strong>
<ol>
	<li>Дайте определение СУБД.</li>
	<li>Охарактеризуйте основные информационно-логические модели баз данных.</li>
	<li>Дайте определение и характеристику реляционной базе данных.</li>
	<li>Перечислите этапы обобщенной технологии работы с БД.</li>
	<li>На какие категории делятся современные СУБД?</li>
	<li>Перечислите возможности, достоинства и недостатки MS Access.</li>
	<li>Назовите основные объекты СУБД MS Access.</li>
	<li>В чем состоит особенность создания объектов баз данных MS</li>
</ol>
Access в режиме Конструктор!<br />
<ol>
	<li>Каким образом производятся расчеты в базе данных MS Access?</li>
	<li>Перечислите современные СУБД для корпоративного применения</li>
</ol>
<strong>3.8. Задания для практики</strong>
Ознакомиться с текстом документа «Тема 3», добавить вопросы для самоконтроля.<br />
<strong>3.9. Глоссарий по теме 3</strong>
<b>База данных</b> – совместно используемый набор логически связанных данных (и описание этих данных), предназначенный для удовлетворения информационных потребностей организации.<br />
<strong>3.10. Использованные информационные ресурсы</strong>
<ol>
	<li>«О высшем и послевузовском образовании». Федеральный закон от 22.08.96 г. № 125-ФЗ (с изменениями от 10.01.03 г.)</li>
	<li>«Об образовании». Федеральный закон от 13.01.96 г. № 12-ФЗ (с изм. От 10.01.03 г.)</li>
	<li>Архангельский Г. Работа 2.0: прорыв к свободному времени. – М.: Манн, Иванов и Фербер, 2010. – 208 с.</li>
	<li>Асмолов А.Г., Семенов А.Л., Уваров А.Ю. Российская школа и новые информационные технологии: взгляд в следующее десятилетие. – М.: НексПринт, 2010. – 84 с.</li>
	<li>Беспалько В.П. Педагогика и прогрессивные технологии обучения. – М., 1995. – 336 с.</li>
	<li>Горелов И.Н. Разговор с компьютером. Психолингвистический аспект проблемы. – М.: Наука, – 1987. – 255 с.</li>
	<li>Горюнова М.А., Семенова Т.В., Солоневичева М.Н.</li>
</ol>
Интерактивные доски и их использование в учебном процессе. – СПб., 2010. – 336 с. 8. Григорьев С.Г., Гриншкун В.В., Информатизация образования. Фундаментальные основы // Учебник для студентов педагогических вузов и слушателей системы повышения квалификации педагогов. – Томск: Издво «ТМЛ-Пресс», 2008. – 286 с.<br />
<ol>
	<li>Григорьев С.Г., Гриншкун В.В., Кузнецов А.А. Образовательные электронные издания и ресурсы: Методическое пособие. М.: Дрофа, –</li>
</ol>
2009, 156 с.<br />
<ol>
	<li>Дьячко А.Г., Крупин Ю.А. и др. Информационные технологии в планировании учебного процесса высшего образовательного учреждения. – М., 2000. – 96 с.</li>
	<li>Киселев Г.М., Бочкова Р.В. Информационные технологии в педагогическом образовании. – М., 2012. – 308 с.</li>
	<li>Патаракин Е.Д. Социальные взаимодействия и сетевое обучение 2.0. – М.: НП «Современные технологии в образовании и культуре», 2009. – 176 с.</li>
	<li>Полат Е.С., Бухаркина М.Ю., Моисеева М.В., Петров А.Е. Новые педагогические и информационные технологии в системе образования. // Под ред. Е.С. Полат. – М.: «Академия», 2002. – 272 с.<b> </b></li>
</ol>
<strong>Тема 4. Перспективные направления разработки и использования ИКТ в образовании</strong>
<b>Аннотация. </b>Данная тема раскрывает использования ИКТ в образовании.<br />
<b>Ключевые слова. </b>ИКТ в образовании, дистанционное обучение. <b>Методические рекомендации по изучению темы. </b><br />
- Тема содержит лекционную часть, где в разделе «Лекция» имеются общие представления по теме;<br />
- После прохождения предыдущей части, надо выполнить задание и подготовить вопросы по тексту;<br />
- И напоследок есть раздел Обсуждений, где вы можете обсудить разные интересные факты, рассказать о чем-то новом, или же просто спрашивать то, чего не поняли.<br />
<b><i>Перспективные направления разработки и использования ИКТ в </i></b><br />
<strong><i>образовании </i></strong>
Современные исследования в области применения компьютеров в обучении развиваются в нескольких направлениях.<br />
<ol>
	<li>интеллектуальные обучающие системы;</li>
	<li>учебные мультимедиа и гипермедиа;</li>
	<li>учебные среды, микромиры и моделирование;</li>
	<li>новые технологии для обучения конкретным дисциплинам. Рассмотрим некоторые из этих направлений.</li>
</ol>
<strong><i>4.1 Интеллектуальные обучающие системы (ИОС</i><i>) </i></strong>
являются наиболее перспективными в области компьютерного обучения. Они основаны на технологии искусственного интеллекта (ИИ). ИОС реализует адаптивное и двустороннее взаимодействие, которое направлено на эффективную передачу знаний. <i>Адаптивность</i> означает, что система дает пояснения, подходящие каждому обучаемому, с помощью динамического управления. <i>Двустороннее взаимодействие</i> – это взаимодействие со смешанной инициативой, при которой обучаемый может задать вопросы или просить систему решить задачу. ИОС отличаются друг от друга методологиями представлений знаний о предметной области, об обучаемом и о процессе обучения. Одним из перспективных направлений развития ИОС является создание самообучающихся систем. В этих системах знания приобретаются в диалоге с человеком. Архитектура таких систем может содержать следующие компоненты:<br />
• микромир;<br />
• учащийся – человек;<br />
• учащийся – компьютер;<br />
• интерфейс между двумя учащимися и микромиром;<br />
• интерфейс между двумя учащимися.<br />
Другое направление развития систем искусственного интеллекта представляют распределенные системы. В этих системах два и более компьютеров связываются таким образом, что ученики могут обучаться, сотрудничая или соревнуясь, каждый на своем компьютере. Такие системы представляют собой подобие «классного» обучения, но на совершенно ином уровне. Такое обучение оказывается более эффективным и интересным, чем обучение в одиночку.<br />
Недостатком многих ИОС является ориентация на специальные знания в рамках определенного предмета. В них не предусмотрена возможность простой адаптации к другой предметной области. Поэтому более общий подход состоит в развитии интеллектуального окружения (оболочки), из которого затем можно получить много ИОС путем наполнения их различным содержанием. Пример такой системы – EEPS, обучающая среда для решения задач, обеспечивающая обучение решению задач в качественных областях науки. Система реализует модель преподавания, основанную на трех режимах:<br />
• режим вопросов (обучаемый расспрашивает компьютер с целью получения ответов на задачи);<br />
• режим исследования (решение задачи общими усилиями<br />
обучаемого с компьютером);<br />
• режим решения (обучаемый решает задачу самостоятельно, получая минимальную помощь и советы компьютера).<br />
<i>Учебная мультимедиа и гипермедиа</i> представляет собой развитие технологии программированного обучения. Основной акцент в этих системах делается на иллюстративно-наглядную сторону. Современные графические и звуковые возможности компьютеров обусловили появление средств гипер- и мультимедиа. Под управлением компьютера система мультисред может производить объединение текста, графики, звуков, видео-образов и мультимедиа.<br />
Развитием идей мультимедиа являются технологии компьютерной виртуальной реальности. Эти технологии используют специальные экраны, датчики, шлемы, перчатки и т.п., которые позволяют моделировать управление, например, самолетом. У обучаемого возникает иллюзия управления самолетом.<br />
<strong><i>4.2 Дистанционное обучение (ДО) </i></strong>
В настоящее время активно развивается новая форма обучения, получившая название «дистанционное обучение». Это специфическая образовательная система, которая базируется на современных педагогических и информационных технологиях.<br />
Новые информационные технологии позволяют использовать новые средства взаимодействия преподавателя и учащихся. При ДО обучаемый и преподаватель пространственно разделены друг от друга. Но при этом они находятся в постоянном взаимодействии, организованном с помощью особых приемов построения учебного курса, форм контроля, методов коммуникации с помощью электронной почты и других технологий интернета, а также специально предпринимаемых организационноадминистративных мероприятий. ДО, основанное на использовании технологий интернета, выполняет ряд новых функций и предполагает реализацию определенных принципов, среди которых важное значение имеет принцип распределенного сотрудничества, интеграции, вхождения в мировое сетевое образовательное сообщество. Перечислим характеристики, присущие ДО:<br />
• более тщательное и детальное планирование деятельности обучаемого, ее организации, четкую постановку целей обучения, доставку необходимых учебных материалов;<br />
• интерактивность между обучаемым и преподавателем;<br />
• высокоэффективная обратная связь;<br />
• использование специальных приемов и средств поощрения и мотивации обучаемых;<br />
• структурирование курса ДО – оно должно быть модульным, чтобы обучаемый четко осознавал свое продвижение от модуля к модулю.<br />
При ДО применяются различные информационные и коммуникационные технологии (чаще всего – сочетание различных технологий). При этом использование каждой технологии зависит от целей и задач, стоящих перед дистанционным курсом. Например, традиционные средства обучения на печатной основе используются для знакомства учащихся с новым учебным материалом, интерактивные аудио- и видеоконференции обеспечивают общение в режиме реального времени, компьютерные конференции и электронная почта используются для отправки сообщений, обеспечения обратной связи с учащимися, а также для постоянных контактов между учащимися одной группы. Видеолекции заранее записанные на пленку помогут учащимся визуализировать содержание учебного материала. Являясь относительно новой формой обучения с точки зрения времени ее появления, ДО не появилось на пустом месте. Его прародителем по праву считается «обучение по переписке» или заочное обучение. Студент получал по почте комплект учебных пособий и перечень заданий, которые он должен был выполнить за определенное время (набор упражнений, задач, экспериментов для самостоятельной работы). Позднее, с появлением радио и телевидения возникли учебные радиопередачи и телепередачи.<br />
Зачастую они совмещались с обучением «по переписке», т.к. учащимся и преподавателям была необходима обратная связь для общения друг с другом в периоды между очными экзаменационными сессиями. Когда появились средства новых информационных технологий – ПК (с обучающими, контролирующими программами, моделями и тренажерами), факсимильная связь, видео технологии, аудио технологии и интернет – все это отразилось на обучении «по переписке». Каким образом? Информация стала подаваться студентам в различной форме, а не только в виде традиционных учебников на бумажной основе. Стали возможными постоянные контакты между всеми участниками обучения в межсессионные периоды. А в настоящее время с появлением более совершенных средств информационных и коммуникационных технологий физическая дистанция (расстояние между учащимися и преподавателем) постепенно перестает влиять на процесс обучения и его качество.<br />
В зависимости от типа используемых при создании и проведении дистанционных курсов средств обучения и выбора канала коммуникации для обеспечения обратной связи выделяют следующие виды ДО.<br />
<i>1)Курсы на основе комплексных «кейс-технологий». </i><br />
В основу подобных курсов положена самостоятельная работа студентов по изучению различных печатных и мультимедийных учебных материалов, представляемых в форме кейса (от англ. Case- портфель, ситуация). При этом, с одной стороны, любой кейс является завершенным программно-методическим комплексом, где все элементы связаны друг с другом в единое целое – это материалы для знакомства с теорией, практические задания, дополнительные тесты и справочные материалы, компьютерные модели и симуляции. Учебные материалы «кейсов» отличает «интерактивность», предполагающая и стимулирующая самостоятельную работу обучающихся.<br />
Кроме самостоятельных занятий, студенты посещают очные установочные лекции, а также «воскресные школы», семинары и тренинги, очные консультации и принимают участие в контрольных мероприятиях (проводимых как очно, так и заочно). В последнее время при создании курсов часть очных встреч переносят в среду интернет – внедряются такие формы учебной деятельности, как интернеттьюториалы, консультирование по электронной почте, виртуальные деловые игры и тренинги, студенческие конференции и пр. По мере создания русскоязычных ресурсов в интернете студенты получают возможность работать с информацией, получаемой из электронных библиотек, сетевых баз данных.<br />
В режиме телекоммуникационного доступа может осуществляться компьютерное тестирование для контроля и самоконтроля знаний и иные элементы учебной деятельности.<br />
<i>2) </i><i>Курсы на основе компьютерных сетевых технологий. </i>В основе подобных курсов лежат интерактивные электронные учебные пособия различного вида и назначения. К ним относятся обучающие программы, электронные учебники, компьютерные тесты, базы знаний и т.д., доступные для студентов с помощью интернет или же локальных сетей (интранет).<i> </i><br />
Использование технологий интернета позволяет не только представлять студентам учебный материал в различных видах и формах, но и организовывать управляемый учебный процесс, осуществляемый под руководством преподавателя. При этом обучение может происходить как индивидуально, так и в составе учебных групп. Контакты осуществляются с помощью электронной почты, телеконференций и их интенсивность может приближаться к аналогичной при очном обучении. Если в вузе создается система ДО, то чаще всего для этого приобретается специальная программная оболочка, делающая этот процесс более эффективным.<br />
<i>3) </i><i>Курсы на основе телевизионных сетей и спутниковых каналов передачи данных. </i><br />
Перечисленные 3 формы ДО являются в настоящее время самыми распространенными в российской и мировой практике. Но существуют и другие формы.<br />
Дистанционный курс (ДК) – это система обучения, в которой присутствуют преподаватель и студент. Это именно обучение, а не самообразование. Каждая система обучения строится на определенной дидактической концепции, которая определяет отбор содержания, методов, организационных форм, средств обучения. Более того, мы имеем дело с новой формой обучения – обучением на расстоянии с использованием новейших средств информационных технологий. При проектировании ДК необходимо проанализировать <i>дидактические возможности телекоммуникаций,</i> а также других средств НИТ, которые будут использоваться как в виде средств обучения, так и в виде технологической основы формирования образовательной среды<i>. </i><br />
Разработка ДК может базироваться на различных педагогических положениях и концепциях. Рассмотрим на примере концептуальные положения Полат Е.С.<br />
- В центре процесса обучения находится самостоятельная деятельность обучаемого (обучение, а не преподавание). Учение, самостоятельное приобретение и применение знаний стало потребностью современного человека. Отсюда, с одной стороны, необходима более гибкая система образования, с другой стороны – обучаемый должен не только овладеть определенной суммой знаний, но и научиться самостоятельно приобретать знания, работать с информацией. Самостоятельное приобретение знаний не должно носить пассивный характер.<br />
- Организация самостоятельной (индивидуальной или групповой) деятельности обучаемых в сети предполагает использование <i>новейших педагогических технологий. </i><br />
- ДО, индивидуализированное по своей сути, не должно исключать возможностей коммуникации, не только с преподавателем, но и с другими партнерами.<br />
- ДО предусматривает ту или иную форму дифференциации ( разноуровневое обучение).<br />
- Система контроля должна носить систематический характер. Она может строиться как на основе оперативной обратной связи, так и отсроченного контроля (например, тестирование.)<br />
ДО предоставляет новые возможности для получения образования тем, для кого его получение в традиционной форме затруднительно или невозможно (например, люди с ограниченными возможностями), для тех, кто работает и не имеет достаточного времени, кто хочет повысить свою квалификацию.<br />
Мы рассмотрели основные направления и подходы в компьютерном обучении. Однако существуют определенные проблемы в этой области, которые проявляются в несоответствии затраченных усилий и имеющихся результатов. Поэтому требуется разработка адекватной теории компьютерного обучения, новых методов представления знаний и моделирования процесса обучения и поведения обучаемого.<br />
<strong>4.3. Вопросы для самоконтроля</strong>
<ol>
	<li>В чем особенности дистанционного обучения?</li>
	<li>Назовите отрицательные и положительные стороны ДО.</li>
	<li>Что собой представляет структура Интернет?</li>
	<li>Перечислите основные протоколы Интернета.</li>
	<li>Какие средства поиска существуют в Интернете?</li>
	<li>В чем заключаются отличия поисковых систем от электронных каталогов? ,</li>
	<li>Как работает электронная почта?</li>
	<li>Какие средства общения предлагает Интернет?</li>
</ol>
<strong>4.4. Задания для практики</strong>
Подготовить доклад по данной теме.<br />
Ознакомиться с текстом документа «Тема 4» , добавить вопросы для самоконтроля.<br />
<strong>4.5. Глоссарий по теме 4</strong>
<b>Дистанционное обучение (ДО) Distant learning</b> - обучение, при котором все или большая часть учебных процедур осуществляется с использованием современных информационных и телекоммуникационных технологий при территориальной разобщенности преподавателя и студентов.<br />
<b>Дистанционное образование Distance education</b> – 1. Целенаправленное и методически организованное руководство учебнопознавательной деятельностью лиц, находящихся на расстоянии от образовательного центра, осуществляемое посредством электронных и традиционных средств связи. 2. Процесс получения знаний, умений и навыков с помощью специализированной образовательной среды, основанной на использовании ИКТ, обеспечивающих обмен учебной информацией на расстоянии, и реализующей систему сопровождения и администрирования учебного процесса.<br />
<b>Дистанционная технология обучения (образовательного процесса)</b> - совокупность методов и средств обучения и администрирования учебных процедур, обеспечивающих проведение учебного процесса на расстоянии на основе использования современных информационных и телекоммуникационных технологий.<br />
<strong>4.6. Использованные информационные ресурсы</strong>
<ol>
	<li>«О высшем и послевузовском образовании». Федеральный закон от 22.08.96 г. № 125-ФЗ (с изменениями от 10.01.03 г.)</li>
	<li>«Об образовании». Федеральный закон от 13.01.96 г. № 12-ФЗ (с изм. От 10.01.03 г.)</li>
	<li>Архангельский Г. Работа 2.0: прорыв к свободному времени. – М.:</li>
</ol>
Манн, Иванов и Фербер, 2010. – 208 с.<br />
<ol>
	<li>Асмолов А.Г., Семенов А.Л., Уваров А.Ю. Российская школа и новые информационные технологии: взгляд в следующее десятилетие. – М.: НексПринт, 2010. – 84 с.</li>
	<li>Беспалько В.П. Педагогика и прогрессивные технологии обучения. – М., 1995. – 336 с.</li>
	<li>Горелов И.Н. Разговор с компьютером. Психолингвистический аспект проблемы. – М.: Наука, – 1987. – 255 с.</li>
	<li>Горюнова М.А., Семенова Т.В., Солоневичева М.Н.</li>
</ol>
Интерактивные доски и их использование в учебном процессе. – СПб., 2010. – 336 с. 8. Григорьев С.Г., Гриншкун В.В., Информатизация образования. Фундаментальные основы // Учебник для студентов педагогических вузов и слушателей системы повышения квалификации педагогов. – Томск: Издво «ТМЛ-Пресс», 2008. – 286 с.<br />
<ol>
	<li>Григорьев С.Г., Гриншкун В.В., Кузнецов А.А. Образовательные электронные издания и ресурсы: Методическое пособие. М.: Дрофа, –</li>
</ol>
2009, 156 с.<br />
<ol>
	<li>Дьячко А.Г., Крупин Ю.А. и др. Информационные технологии в планировании учебного процесса высшего образовательного учреждения. – М., 2000. – 96 с.</li>
	<li>Киселев Г.М., Бочкова Р.В. Информационные технологии в педагогическом образовании. – М., 2012. – 308 с.</li>
	<li>Патаракин Е.Д. Социальные взаимодействия и сетевое обучение 2.0. – М.: НП «Современные технологии в образовании и культуре», 2009. – 176 с.</li>
	<li>Полат Е.С., Бухаркина М.Ю., Моисеева М.В., Петров А.Е. Новые педагогические и информационные технологии в системе образования. // Под ред. Е.С. Полат. – М.: «Академия», 2002. – 272 с.</li>
</ol>

          </strong>
          </p>
      </tab-pane>
      <tab-pane class="text-color">
        <template slot="label">
          Раздел контроля
        </template>
          <p class="blockquote blockquote-primary">
          <strong><strong><b>Вопросы для самоконтроля</b><br /></strong>
<ol>
	<li>В чем особенности дистанционного обучения?</li>
	<li>Назовите отрицательные и положительные стороны ДО</li>
	<li>Что собой представляет структура Интернет?</li>
	<li>Какие средства поиска существуют в Интернете?</li>
	<li>В чем заключаются отличия поисковых систем от электронных каталогов?</li>
	<li>Как работает электронная почта?</li>
	<li>Какие средства общения предлагает Интернет?</li>
</ol>
          </strong>
		  </p>
		  <p class="blockquote blockquote-primary-new">
			  <strong><strong class="name"><a class="a-href" target="_blank" href="https://onlinetestpad.com/ru/test/6266-informacionnye-tekhnologii-v-professionalnoj-deyatelnosti-promezhutochnyj-k">Тест 1</a></strong></strong><br />
              <strong><strong class="name"><a class="a-href" target="_blank" href="https://testedu.ru/test/informatika/11-klass/informaczionnyie-texnologii-v-professionalnoj-deyatelnosti.html">Тест 2</a></strong></strong><br />
              <strong><strong class="name"><a class="a-href" target="_blank" href="https://konstruktortestov.ru/test-15156">Тест 3</a></strong></strong><br />
            </p>
      </tab-pane>
            </tabs>
             </blockquote>
			   </div>    
            </div>
            </div>
      	   </div> 
          </div>    
      </div>
        </div>
      </div>
    </div>
    </div>
</template>
<script>
import { Button, Tabs, TabPane } from "@/components";

export default {
  components: {
    [Button.name]: Button,
    Tabs,
    TabPane,
  },
};
</script>
<style scoped>
.text-color {
  color: black;
}
.name {
  font-size: 1.5rem;
}
.checkbox-cell {
  height: 40px;
  display: flex;
  justify-content: center;
  align-items: center;
}
.typography {
  font-size: 24px;
}
.blockquote {
  padding: 20px;
  font-size: 1.3rem;
  line-height: 1.8;
}
.blockquote.blockquote-primary {
  color: black;
  border-color: black;
}
.typography-line {
  padding-left: 0%;
  margin-bottom: 0px;
  position: relative;
  display: block;
  width: 100%;
}
.tab-content.tab-content-padding {
  padding: 20px;
}
.container {
  max-width: 1600px;
}
.el-carousel__container {
  position: relative;
  height: 730px;
}
.card {
  margin-bottom: 0px;
}
.a-href {
  color: black;
}
</style>